{"law_id":"484","section_number":"11-2207","catch_line":"EXCEPTIONS TO PARKING TIME LIMITATIONS AND TO REQUIRED ACTIVATION OF PARKING METERS BY DEPOSIT OF COINS; PARKING SPACE ENCUMBRANCE.","history":"","order_by":"11-2207","metadata":false,"url":"\/11-2207\/","token":"11-2207","structure":{"1":{"id":"131","name":"ARTICLE K. - PARKING METERS","identifier":"K","label":"article","url":"\/II\/11\/2\/K\/"},"2":{"id":"115","name":"CHAPTER 2. - MOTOR VEHICLES AND TRAFFIC","identifier":"2","label":"chapter","url":"\/II\/11\/2\/"},"3":{"id":"110","name":"PART 11 - TRANSPORTATION","identifier":"11","label":"part","url":"\/II\/11\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"referred_to_by":{"0":{"id":"457","section_number":"11-2175","catch_line":"PARKING LIMITATIONS ON CITY-OWNED FACILITIES.","url":"http:\/\/localhost:8888\/11-2175\/"}},"edition_id":"1","section_id":"484","structure_id":"131","full_text":"(a) When parking or loading on the streets of the City is prohibited for longer than the time limits stated in this chapter and\/or when parking is permitted in metered parking spaces only when the operator of a vehicle, upon entering the parking meter space, immediately activates or causes to be activated the timing mechanism on the meter in accordance with this chapter, the operator of a motor vehicle or other person may park on or otherwise encumber the parking areas or metered spaces or loading zones on the streets of the City for periods of time longer than otherwise permitted by this chapter and without activating any parking meter or meters when the following conditions have been satisfied and when a permit has been issued for the encumbrance of a parking area.\r\r","text":{"0":{"id":"1346","text":"When parking or loading on the streets of the City is prohibited for longer than the time limits stated in this chapter and\/or when parking is permitted in metered parking spaces only when the operator of a vehicle, upon entering the parking meter space, immediately activates or causes to be activated the timing mechanism on the meter in accordance with this chapter, the operator of a motor vehicle or other person may park on or otherwise encumber the parking areas or metered spaces or loading zones on the streets of the City for periods of time longer than otherwise permitted by this chapter and without activating any parking meter or meters when the following conditions have been satisfied and when a permit has been issued for the encumbrance of a parking area.","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"1347","text":"","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"2":{"id":"1348","text":"\tPersons requiring temporary parking space immediately adjacent to residential, commercial or industrial buildings for loading or unloading of building or office equipment or personal property and who satisfy the review agent that the use of the parking spaces is necessary in order to move the equipment or property. \n","type":"section","prefixes":["(b)","(1)"],"prefix":"(1)","entire_prefix":"(b)(1)","prefix_anchor":"(b)(1)","level":2},"3":{"id":"1349","text":"\tPersons having a permit from the Director of the Department of City Planning or his designee in connection with any building construction or demolition project that will take thirty (30) or fewer calendar days to complete and who satisfy the review agent that the use of the parking spaces is necessary to the completion of the project. Projects that will take longer than thirty (30) calendar days to complete may be allocated street space provided that a permit is procured for the space or spaces needed. The per space per day fee for any such permit shall be set by the City Manager and shall be an amount equal to the highest daily parking rate for all City parking decks, garages, and surface lots. The fee shall be paid in advance for the estimated time for the completion of the work. Any work done beyond the initial estimate will be paid for at the completion of the project. The City reserves the right to rescind any such permit and will refund any overpayment of the fee if the permit is rescinded. \n","type":"section","prefixes":["(b)","(2)"],"prefix":"(2)","entire_prefix":"(b)(2)","prefix_anchor":"(b)(2)","level":2},"4":{"id":"1350","text":"\tPersons having a permit from the Inspections Department to perform any plumbing, electrical, heating, sign-hanging or other project in any public way or on premises adjacent to any street, alley, or sidewalk, and who satisfy the review agent that the use of the parking space(s) is necessary to facilitate the project. \n","type":"section","prefixes":["(b)","(3)"],"prefix":"(3)","entire_prefix":"(b)(3)","prefix_anchor":"(b)(3)","level":2},"5":{"id":"1351","text":"\tPersons engaged in any public improvement under contract with the City or engaged in any work under the supervision of the City Engineer, who have a certification from the City Manager that the use of the parking spaces is necessary to facilitate the project. \n","type":"section","prefixes":["(b)","(4)"],"prefix":"(4)","entire_prefix":"(b)(4)","prefix_anchor":"(b)(4)","level":2},"6":{"id":"1352","text":"\tRepresentatives of the Wake County Board of Elections, upon request that additional parking is required on an election day at one (1) or more polling places to accommodate voters. \n","type":"section","prefixes":["(b)","(5)"],"prefix":"(5)","entire_prefix":"(b)(5)","prefix_anchor":"(b)(5)","level":2},"7":{"id":"1353","text":"\tPersons who are operating civic or convention centers as defined in §10-2002 of this Code. The Inspections Director may set aside parking for such a facility pursuant to this standard on any block face adjoining the facility or on any block face adjoining the block faces immediately adjoining the facility. No such reservation shall be for a period of more than three (3) consecutive days, and any such reservation shall not include existing loading zones within the reserved area. \n","type":"section","prefixes":["(b)","(6)"],"prefix":"(6)","entire_prefix":"(b)(6)","prefix_anchor":"(b)(6)","level":2},"8":{"id":"1354","text":"\tPersons who are operating hotels, motels, or other places of assembly in the downtown exempt parking area as defined in §10-2061(k)(2) may request the reservation of on-street spaces adjoining their facility when the facility is hosting a conference or other meeting which will create a demand for parking which cannot be satisfied by the facility&#8217;s existing off-street parking. No such reservation shall be effective for more than three (3) consecutive days, and any such reservation shall not include existing loading zones within the reserved area. \n","type":"section","prefixes":["(b)","(7)"],"prefix":"(7)","entire_prefix":"(b)(7)","prefix_anchor":"(b)(7)","level":2},"9":{"id":"1355","text":"\tThe City Manager may at any time authorize the reservation of metered or unmetered parking spaces for the purpose of loading and unloading passenger buses. No such reservation shall exceed seventy-two (72) consecutive hours. \n","type":"section","prefixes":["(b)","(8)"],"prefix":"(8)","entire_prefix":"(b)(8)","prefix_anchor":"(b)(8)","level":2},"10":{"id":"1356","text":"\tContractors engaged in the servicing of building equipment limited to electrical, mechanical, plumbing, fire alarm, fire pump, and building elevator contractors may apply for a one-day renewable permit to perform such work. There shall be an administrative fee assessed for each permit equal to nine (9) times the current parking meter hourly rate. This permit shall be available only in the areas delineated in §10-2081(c) and §10A-2061(k)(2) of this Code. \n(10)\tMovers engaged in moving the contents of a home, office, industrial or other commercial site from one location to another for the continued use of the same party may apply for a one-day renewable permit to encumber one (1) or more parking spaces while completing the work. The fee for this permit shall be the same as the fee for the permit described in subsection (9) above. \n","type":"section","prefixes":["(b)","(9)"],"prefix":"(9)","entire_prefix":"(b)(9)","prefix_anchor":"(b)(9)","level":2},"11":{"id":"1357","text":"","type":"section","prefixes":["(c)"],"prefix":"(c)","entire_prefix":"(c)","prefix_anchor":"(c)","level":1},"12":{"id":"1358","text":"\tPersons licensed as funeral directors and holding services in any funeral home or church shall be exempted from making application and receiving permits provided for by this section so long as suitable markings are used to indicate to the public that a funeral is in progress. \n","type":"section","prefixes":["(c)","(1)"],"prefix":"(1)","entire_prefix":"(c)(1)","prefix_anchor":"(c)(1)","level":2},"13":{"id":"1359","text":"\tPublic utilities engaging in construction and maintenance work in\/or adjacent to any public way that have a right-of-way permit for such work shall be exempted from making application and receiving permits provided for by this section so long as suitable markings are used to indicate to the public that such work is being undertaken. \n(Code 1959 , §21-48.1; Ord. No. 1984-452, §1, 12-4-84; Ord. No. 1989-424, §§1—3, 9-5-89; Ord. No. 1992-988, §1, 6-2-92; Ord. No. 2001-56, §1, 7-17-01; Ord. No. 2011-914, §1, 6-21-11) \nCross reference: Temporary parking restrictions by the Chief of Police, §11-2181 \n","type":"section","prefixes":["(c)","(2)"],"prefix":"(2)","entire_prefix":"(c)(2)","prefix_anchor":"(c)(2)","level":2}},"ancestry":{"1":{"id":"131","name":"ARTICLE K. - PARKING METERS","identifier":"K","label":"article","url":"\/II\/11\/2\/K\/"},"2":{"id":"115","name":"CHAPTER 2. - MOTOR VEHICLES AND TRAFFIC","identifier":"2","label":"chapter","url":"\/II\/11\/2\/"},"3":{"id":"110","name":"PART 11 - TRANSPORTATION","identifier":"11","label":"part","url":"\/II\/11\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"476","structure_id":"131","section_number":"11-2200","catch_line":"PENALTIES.","url":"\/11-2200\/","token":"11-2200"},"1":{"id":"477","structure_id":"131","section_number":"11-2201","catch_line":"DEFINITIONS.","url":"\/11-2201\/","token":"11-2201"},"2":{"id":"478","structure_id":"131","section_number":"11-2202","catch_line":"PARKING METER ZONES.","url":"\/11-2202\/","token":"11-2202"},"3":{"id":"479","structure_id":"131","section_number":"11-2203","catch_line":"INSTALLATION OF PARKING METERS.","url":"\/11-2203\/","token":"11-2203"},"4":{"id":"480","structure_id":"131","section_number":"11-2204","catch_line":"OPERATION OF PARKING METERS.","url":"\/11-2204\/","token":"11-2204"},"5":{"id":"482","structure_id":"131","section_number":"11-2205","catch_line":"PARKING TIME LIMITS.","url":"\/11-2205\/","token":"11-2205"},"6":{"id":"483","structure_id":"131","section_number":"11-2206","catch_line":"METER ZONES; PERIOD OF OPERATION.","url":"\/11-2206\/","token":"11-2206"},"7":{"id":"484","structure_id":"131","section_number":"11-2207","catch_line":"EXCEPTIONS TO PARKING TIME LIMITATIONS AND TO REQUIRED ACTIVATION OF PARKING METERS BY DEPOSIT OF COINS; PARKING SPACE ENCUMBRANCE.","url":"\/11-2207\/","token":"11-2207"},"8":{"id":"485","structure_id":"131","section_number":"11-2208","catch_line":"PARKING EXCEPTIONS AND SPACE RESERVATIONS AUTHORIZED BY CITY COUNCIL.","url":"\/11-2208\/","token":"11-2208"},"9":{"id":"486","structure_id":"131","section_number":"11-2209","catch_line":"CONTENTS OF APPLICATION; FORM.","url":"\/11-2209\/","token":"11-2209"},"10":{"id":"487","structure_id":"131","section_number":"11-2210","catch_line":"ISSUANCE OF PERMITS.","url":"\/11-2210\/","token":"11-2210"},"11":{"id":"488","structure_id":"131","section_number":"11-2211","catch_line":"UNLAWFUL ACTS.","url":"\/11-2211\/","token":"11-2211"},"12":{"id":"489","structure_id":"131","section_number":"11-2212","catch_line":"VIOLATIONS.","url":"\/11-2212\/","token":"11-2212"},"13":{"id":"490","structure_id":"131","section_number":"11-2213","catch_line":"ENFORCEMENT.","url":"\/11-2213\/","token":"11-2213"},"14":{"id":"491","structure_id":"131","section_number":"11-2214","catch_line":"USE OF PROCEEDS.","url":"\/11-2214\/","token":"11-2214"},"15":{"id":"493","structure_id":"131","section_number":"11-2215","catch_line":"RESERVATION OF POWERS.","url":"\/11-2215\/","token":"11-2215"},"16":{"id":"494","structure_id":"131","section_number":"11-2216","catch_line":"IMMOBILIZATION OF VEHICLES.","url":"\/11-2216\/","token":"11-2216"},"17":{"id":"495","structure_id":"131","section_number":"11-2217","catch_line":"RESERVED.","url":"\/11-2217\/","token":"11-2217"},"18":{"id":"496","structure_id":"131","section_number":"11-2217","catch_line":"RESERVED. ","url":"\/11-2217\/","token":"11-2217"}},"previous_section":{"id":"483","structure_id":"131","section_number":"11-2206","catch_line":"METER ZONES; PERIOD OF OPERATION.","url":"\/11-2206\/","token":"11-2206"},"next_section":{"id":"485","structure_id":"131","section_number":"11-2208","catch_line":"PARKING EXCEPTIONS AND SPACE RESERVATIONS AUTHORIZED BY CITY COUNCIL.","url":"\/11-2208\/","token":"11-2208"},"references":{"0":{"id":"464","section_number":"11-2181","catch_line":"TEMPORARY PARKING RESTRICTIONS BY CHIEF OF POLICE.","url":"http:\/\/localhost:8888\/11-2181\/"},"1":{"id":"488","section_number":"11-2211","catch_line":"UNLAWFUL ACTS.","url":"http:\/\/localhost:8888\/11-2211\/"}},"formats":{"txt":"\/11-2207.txt","json":"\/11-2207.xml"},"dublin_core":{"Title":"EXCEPTIONS TO PARKING TIME LIMITATIONS AND TO REQUIRED ACTIVATION OF PARKING METERS BY DEPOSIT OF COINS; PARKING SPACE ENCUMBRANCE.","Type":"Text","Format":"text\/html","Identifier":"§ 11-2207","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nEXCEPTIONS TO PARKING TIME LIMITATIONS AND TO REQUIRED ACTIVATION OF PARKING\nMETERS BY DEPOSIT OF COINS; PARKING SPACE ENCUMBRANCE. (§ 11-2207)\n\n(a) When parking or loading on the streets of the City is prohibited for longer\nthan the time limits stated in this chapter and\/or when parking is permitted in\nmetered parking spaces only when the operator of a vehicle, upon entering the\nparking meter space, immediately activates or causes to be activated the timing\nmechanism on the meter in accordance with this chapter, the operator of a motor\nvehicle or other person may park on or otherwise encumber the parking areas or\nmetered spaces or loading zones on the streets of the City for periods of time\nlonger than otherwise permitted by this chapter and without activating any\nparking meter or meters when the following conditions have been satisfied and\nwhen a permit has been issued for the encumbrance of a parking area.\n\n(b) \n\n   (1) \tPersons requiring temporary parking space immediately adjacent to\n   residential, commercial or industrial buildings for loading or unloading of\n   building or office equipment or personal property and who satisfy the review\n   agent that the use of the parking spaces is necessary in order to move the\n   equipment or property. \n   \n\n   (2) \tPersons having a permit from the Director of the Department of City\n   Planning or his designee in connection with any building construction or\n   demolition project that will take thirty (30) or fewer calendar days to\n   complete and who satisfy the review agent that the use of the parking spaces\n   is necessary to the completion of the project. Projects that will take longer\n   than thirty (30) calendar days to complete may be allocated street space\n   provided that a permit is procured for the space or spaces needed. The per\n   space per day fee for any such permit shall be set by the City Manager and\n   shall be an amount equal to the highest daily parking rate for all City\n   parking decks, garages, and surface lots. The fee shall be paid in advance for\n   the estimated time for the completion of the work. Any work done beyond the\n   initial estimate will be paid for at the completion of the project. The City\n   reserves the right to rescind any such permit and will refund any overpayment\n   of the fee if the permit is rescinded. \n   \n\n   (3) \tPersons having a permit from the Inspections Department to perform any\n   plumbing, electrical, heating, sign-hanging or other project in any public way\n   or on premises adjacent to any street, alley, or sidewalk, and who satisfy the\n   review agent that the use of the parking space(s) is necessary to facilitate\n   the project. \n   \n\n   (4) \tPersons engaged in any public improvement under contract with the City or\n   engaged in any work under the supervision of the City Engineer, who have a\n   certification from the City Manager that the use of the parking spaces is\n   necessary to facilitate the project. \n   \n\n   (5) \tRepresentatives of the Wake County Board of Elections, upon request that\n   additional parking is required on an election day at one (1) or more polling\n   places to accommodate voters. \n   \n\n   (6) \tPersons who are operating civic or convention centers as defined in\n   §10-2002 of this Code. The Inspections Director may set aside parking for\n   such a facility pursuant to this standard on any block face adjoining the\n   facility or on any block face adjoining the block faces immediately adjoining\n   the facility. No such reservation shall be for a period of more than three (3)\n   consecutive days, and any such reservation shall not include existing loading\n   zones within the reserved area. \n   \n\n   (7) \tPersons who are operating hotels, motels, or other places of assembly in\n   the downtown exempt parking area as defined in §10-2061(k)(2) may request the\n   reservation of on-street spaces adjoining their facility when the facility is\n   hosting a conference or other meeting which will create a demand for parking\n   which cannot be satisfied by the facility&#8217;s existing off-street parking.\n   No such reservation shall be effective for more than three (3) consecutive\n   days, and any such reservation shall not include existing loading zones within\n   the reserved area. \n   \n\n   (8) \tThe City Manager may at any time authorize the reservation of metered or\n   unmetered parking spaces for the purpose of loading and unloading passenger\n   buses. No such reservation shall exceed seventy-two (72) consecutive hours. \n   \n\n   (9) \tContractors engaged in the servicing of building equipment limited to\n   electrical, mechanical, plumbing, fire alarm, fire pump, and building elevator\n   contractors may apply for a one-day renewable permit to perform such work.\n   There shall be an administrative fee assessed for each permit equal to nine\n   (9) times the current parking meter hourly rate. This permit shall be\n   available only in the areas delineated in §10-2081(c) and §10A-2061(k)(2) of\n   this Code. \n   (10)\tMovers engaged in moving the contents of a home, office, industrial or\n   other commercial site from one location to another for the continued use of\n   the same party may apply for a one-day renewable permit to encumber one (1) or\n   more parking spaces while completing the work. The fee for this permit shall\n   be the same as the fee for the permit described in subsection (9) above. \n   \n\n(c) \n\n   (1) \tPersons licensed as funeral directors and holding services in any funeral\n   home or church shall be exempted from making application and receiving permits\n   provided for by this section so long as suitable markings are used to indicate\n   to the public that a funeral is in progress. \n   \n\n   (2) \tPublic utilities engaging in construction and maintenance work in\/or\n   adjacent to any public way that have a right-of-way permit for such work shall\n   be exempted from making application and receiving permits provided for by this\n   section so long as suitable markings are used to indicate to the public that\n   such work is being undertaken. \n   (Code 1959 , §21-48.1; Ord. No. 1984-452, §1, 12-4-84; Ord. No. 1989-424,\n   §§1—3, 9-5-89; Ord. No. 1992-988, §1, 6-2-92; Ord. No. 2001-56, §1,\n   7-17-01; Ord. No. 2011-914, §1, 6-21-11) \n   Cross reference: Temporary parking restrictions by the Chief of Police,\n   §11-2181\n"}