{"law_id":"494","section_number":"11-2216","catch_line":"IMMOBILIZATION OF VEHICLES.","history":"","order_by":"11-2216","metadata":false,"url":"\/11-2216\/","token":"11-2216","structure":{"1":{"id":"131","name":"ARTICLE K. - PARKING METERS","identifier":"K","label":"article","url":"\/II\/11\/2\/K\/"},"2":{"id":"115","name":"CHAPTER 2. - MOTOR VEHICLES AND TRAFFIC","identifier":"2","label":"chapter","url":"\/II\/11\/2\/"},"3":{"id":"110","name":"PART 11 - TRANSPORTATION","identifier":"11","label":"part","url":"\/II\/11\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"referred_to_by":false,"edition_id":"1","section_id":"494","structure_id":"131","full_text":"(a) The City Manager or his designee may immobilize by the use of wheel locks and tow and impound any vehicle which is illegally parked in violation of article J or article K of Part 11 of this Code, and for which there are three (3) or more outstanding, unpaid, and overdue parking tickets for a period of ninety (90) days. For the purpose of determining whether an illegally parked vehicle has had issued against it three (3) or more outstanding, unpaid, and overdue parking tickets for a period of ninety (90) days, it shall be sufficient if the license plate number of the illegally parked vehicle and the license number of the vehicle having received the tickets are the same.\r\r(b) If a wheel lock is attached to a vehicle, a notice shall be affixed to the windshield or other part of the vehicle so as to be readily visible. The notice shall warn that the vehicle has been immobilized and that any attempt to move the vehicle may result in damage to the vehicle. The City of Raleigh shall not be responsible for any damage to an immobilized illegally parked vehicle resulting from unauthorized attempts to free or move the vehicle. An immobilization fee of fifty dollars ($50.00) shall be charged for the removal of the wheel lock. The notice shall also state the total amount of civil penalties due for parking tickets which are overdue and unpaid and attributable to such vehicle, and the immobilization fee to be charged. The address and telephone number to be contacted to pay the charges to have the wheel lock removed shall also be listed.\r\r(c) If civil penalties due and an immobilization fee as herein provided are not paid, or satisfactory arrangements in lieu of payment are not made, within twenty-four (24) hours of the attachment of the wheel lock, such vehicle may be towed and impounded to any public or private impoundment lot. If a private contractor tows and stores the vehicle he may impose against the vehicle his customary fees and charges for such services. \nOnce a vehicle has been impounded, the Finance Director or his designee, shall mail a notice of impoundment to the registered owner and lienholders, if any are known, at the address or addresses reported to the City by the North Carolina Department of Motor Vehicles.\r\r(d) Upon payment of all civil penalties and overdue and unpaid parking tickets issued for the vehicle and of all other charges authorized by this section, including immobilization, towing, and impoundment fees, the vehicle shall be released to the owner or any other person legally entitled to claim possession of the vehicle.\r\r(f) The owner or other person entitled to possession of the vehicle which has been immobilized pursuant to this section may submit a request for hearing to the Finance Director by certified mail or personal delivery within seven (7) days from the receipt of the notice provided for in subsection (c) hereinabove. If a hearing is requested, a statement shall be sent to the requesting party to inform him of the time and place of the hearing, of the basis of the vehicles immobilization and impoundment, of the rules governing conduct of the hearing, of the right to present evidence as to why the vehicle should not have been immobilized or towed, and of the right to be represented by counsel. The hearing officer shall prepare a written report of his findings within three (3) days of the hearing. The report shall state his conclusion as to whether the vehicle was properly immobilized and towed, and the reasons underlying his conclusion. If it is concluded that the vehicle was improperly immobilized or towed, then any improper charges shall be canceled, or if paid, rebated.\r\r(g) It shall be unlawful for anyone to remove from a vehicle a wheel lock placed thereon pursuant to this section or to remove from impoundment any vehicle placed therein pursuant to this section without all civil penalties and applicable charges having first been paid or an approved payment plan having been made.\r\r(h) The City Manager is authorized to establish guidelines to adjust the amount of civil penalties imposed pursuant to this section to promote the resolution of any claim against persons with ten (10) or more outstanding delinquent parking tickets. \n(Ord. No. 1995-714, §1, 9-5-95)\r\r","text":{"0":{"id":"1381","text":"The City Manager or his designee may immobilize by the use of wheel locks and tow and impound any vehicle which is illegally parked in violation of article J or article K of Part 11 of this Code, and for which there are three (3) or more outstanding, unpaid, and overdue parking tickets for a period of ninety (90) days. For the purpose of determining whether an illegally parked vehicle has had issued against it three (3) or more outstanding, unpaid, and overdue parking tickets for a period of ninety (90) days, it shall be sufficient if the license plate number of the illegally parked vehicle and the license number of the vehicle having received the tickets are the same.","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"1382","text":"If a wheel lock is attached to a vehicle, a notice shall be affixed to the windshield or other part of the vehicle so as to be readily visible. The notice shall warn that the vehicle has been immobilized and that any attempt to move the vehicle may result in damage to the vehicle. The City of Raleigh shall not be responsible for any damage to an immobilized illegally parked vehicle resulting from unauthorized attempts to free or move the vehicle. An immobilization fee of fifty dollars ($50.00) shall be charged for the removal of the wheel lock. The notice shall also state the total amount of civil penalties due for parking tickets which are overdue and unpaid and attributable to such vehicle, and the immobilization fee to be charged. The address and telephone number to be contacted to pay the charges to have the wheel lock removed shall also be listed.","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"2":{"id":"1383","text":"If civil penalties due and an immobilization fee as herein provided are not paid, or satisfactory arrangements in lieu of payment are not made, within twenty-four (24) hours of the attachment of the wheel lock, such vehicle may be towed and impounded to any public or private impoundment lot. If a private contractor tows and stores the vehicle he may impose against the vehicle his customary fees and charges for such services. \nOnce a vehicle has been impounded, the Finance Director or his designee, shall mail a notice of impoundment to the registered owner and lienholders, if any are known, at the address or addresses reported to the City by the North Carolina Department of Motor Vehicles.","type":"section","prefixes":["(c)"],"prefix":"(c)","entire_prefix":"(c)","prefix_anchor":"(c)","level":1},"3":{"id":"1384","text":"Upon payment of all civil penalties and overdue and unpaid parking tickets issued for the vehicle and of all other charges authorized by this section, including immobilization, towing, and impoundment fees, the vehicle shall be released to the owner or any other person legally entitled to claim possession of the vehicle.","type":"section","prefixes":["(d)"],"prefix":"(d)","entire_prefix":"(d)","prefix_anchor":"(d)","level":1},"4":{"id":"1385","text":"The owner or other person entitled to possession of the vehicle which has been immobilized pursuant to this section may submit a request for hearing to the Finance Director by certified mail or personal delivery within seven (7) days from the receipt of the notice provided for in subsection (c) hereinabove. If a hearing is requested, a statement shall be sent to the requesting party to inform him of the time and place of the hearing, of the basis of the vehicles immobilization and impoundment, of the rules governing conduct of the hearing, of the right to present evidence as to why the vehicle should not have been immobilized or towed, and of the right to be represented by counsel. The hearing officer shall prepare a written report of his findings within three (3) days of the hearing. The report shall state his conclusion as to whether the vehicle was properly immobilized and towed, and the reasons underlying his conclusion. If it is concluded that the vehicle was improperly immobilized or towed, then any improper charges shall be canceled, or if paid, rebated.","type":"section","prefixes":["(f)"],"prefix":"(f)","entire_prefix":"(f)","prefix_anchor":"(f)","level":1},"5":{"id":"1386","text":"It shall be unlawful for anyone to remove from a vehicle a wheel lock placed thereon pursuant to this section or to remove from impoundment any vehicle placed therein pursuant to this section without all civil penalties and applicable charges having first been paid or an approved payment plan having been made.","type":"section","prefixes":["(g)"],"prefix":"(g)","entire_prefix":"(g)","prefix_anchor":"(g)","level":1},"6":{"id":"1387","text":"The City Manager is authorized to establish guidelines to adjust the amount of civil penalties imposed pursuant to this section to promote the resolution of any claim against persons with ten (10) or more outstanding delinquent parking tickets. \n(Ord. No. 1995-714, §1, 9-5-95)","type":"section","prefixes":["(h)"],"prefix":"(h)","entire_prefix":"(h)","prefix_anchor":"(h)","level":1}},"ancestry":{"1":{"id":"131","name":"ARTICLE K. - PARKING METERS","identifier":"K","label":"article","url":"\/II\/11\/2\/K\/"},"2":{"id":"115","name":"CHAPTER 2. - MOTOR VEHICLES AND TRAFFIC","identifier":"2","label":"chapter","url":"\/II\/11\/2\/"},"3":{"id":"110","name":"PART 11 - TRANSPORTATION","identifier":"11","label":"part","url":"\/II\/11\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"476","structure_id":"131","section_number":"11-2200","catch_line":"PENALTIES.","url":"\/11-2200\/","token":"11-2200"},"1":{"id":"477","structure_id":"131","section_number":"11-2201","catch_line":"DEFINITIONS.","url":"\/11-2201\/","token":"11-2201"},"2":{"id":"478","structure_id":"131","section_number":"11-2202","catch_line":"PARKING METER ZONES.","url":"\/11-2202\/","token":"11-2202"},"3":{"id":"479","structure_id":"131","section_number":"11-2203","catch_line":"INSTALLATION OF PARKING METERS.","url":"\/11-2203\/","token":"11-2203"},"4":{"id":"480","structure_id":"131","section_number":"11-2204","catch_line":"OPERATION OF PARKING METERS.","url":"\/11-2204\/","token":"11-2204"},"5":{"id":"482","structure_id":"131","section_number":"11-2205","catch_line":"PARKING TIME LIMITS.","url":"\/11-2205\/","token":"11-2205"},"6":{"id":"483","structure_id":"131","section_number":"11-2206","catch_line":"METER ZONES; PERIOD OF OPERATION.","url":"\/11-2206\/","token":"11-2206"},"7":{"id":"484","structure_id":"131","section_number":"11-2207","catch_line":"EXCEPTIONS TO PARKING TIME LIMITATIONS AND TO REQUIRED ACTIVATION OF PARKING METERS BY DEPOSIT OF COINS; PARKING SPACE ENCUMBRANCE.","url":"\/11-2207\/","token":"11-2207"},"8":{"id":"485","structure_id":"131","section_number":"11-2208","catch_line":"PARKING EXCEPTIONS AND SPACE RESERVATIONS AUTHORIZED BY CITY COUNCIL.","url":"\/11-2208\/","token":"11-2208"},"9":{"id":"486","structure_id":"131","section_number":"11-2209","catch_line":"CONTENTS OF APPLICATION; FORM.","url":"\/11-2209\/","token":"11-2209"},"10":{"id":"487","structure_id":"131","section_number":"11-2210","catch_line":"ISSUANCE OF PERMITS.","url":"\/11-2210\/","token":"11-2210"},"11":{"id":"488","structure_id":"131","section_number":"11-2211","catch_line":"UNLAWFUL ACTS.","url":"\/11-2211\/","token":"11-2211"},"12":{"id":"489","structure_id":"131","section_number":"11-2212","catch_line":"VIOLATIONS.","url":"\/11-2212\/","token":"11-2212"},"13":{"id":"490","structure_id":"131","section_number":"11-2213","catch_line":"ENFORCEMENT.","url":"\/11-2213\/","token":"11-2213"},"14":{"id":"491","structure_id":"131","section_number":"11-2214","catch_line":"USE OF PROCEEDS.","url":"\/11-2214\/","token":"11-2214"},"15":{"id":"493","structure_id":"131","section_number":"11-2215","catch_line":"RESERVATION OF POWERS.","url":"\/11-2215\/","token":"11-2215"},"16":{"id":"494","structure_id":"131","section_number":"11-2216","catch_line":"IMMOBILIZATION OF VEHICLES.","url":"\/11-2216\/","token":"11-2216"},"17":{"id":"495","structure_id":"131","section_number":"11-2217","catch_line":"RESERVED.","url":"\/11-2217\/","token":"11-2217"},"18":{"id":"496","structure_id":"131","section_number":"11-2217","catch_line":"RESERVED. ","url":"\/11-2217\/","token":"11-2217"}},"previous_section":{"id":"493","structure_id":"131","section_number":"11-2215","catch_line":"RESERVATION OF POWERS.","url":"\/11-2215\/","token":"11-2215"},"next_section":{"id":"495","structure_id":"131","section_number":"11-2217","catch_line":"RESERVED.","url":"\/11-2217\/","token":"11-2217"},"references":false,"formats":{"txt":"\/11-2216.txt","json":"\/11-2216.xml"},"dublin_core":{"Title":"IMMOBILIZATION OF VEHICLES.","Type":"Text","Format":"text\/html","Identifier":"§ 11-2216","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nIMMOBILIZATION OF VEHICLES. (§ 11-2216)\n\n(a) The City Manager or his designee may immobilize by the use of wheel locks\nand tow and impound any vehicle which is illegally parked in violation of\narticle J or article K of Part 11 of this Code, and for which there are three\n(3) or more outstanding, unpaid, and overdue parking tickets for a period of\nninety (90) days. For the purpose of determining whether an illegally parked\nvehicle has had issued against it three (3) or more outstanding, unpaid, and\noverdue parking tickets for a period of ninety (90) days, it shall be sufficient\nif the license plate number of the illegally parked vehicle and the license\nnumber of the vehicle having received the tickets are the same.\n\n(b) If a wheel lock is attached to a vehicle, a notice shall be affixed to the\nwindshield or other part of the vehicle so as to be readily visible. The notice\nshall warn that the vehicle has been immobilized and that any attempt to move\nthe vehicle may result in damage to the vehicle. The City of Raleigh shall not\nbe responsible for any damage to an immobilized illegally parked vehicle\nresulting from unauthorized attempts to free or move the vehicle. An\nimmobilization fee of fifty dollars ($50.00) shall be charged for the removal of\nthe wheel lock. The notice shall also state the total amount of civil penalties\ndue for parking tickets which are overdue and unpaid and attributable to such\nvehicle, and the immobilization fee to be charged. The address and telephone\nnumber to be contacted to pay the charges to have the wheel lock removed shall\nalso be listed.\n\n(c) If civil penalties due and an immobilization fee as herein provided are not\npaid, or satisfactory arrangements in lieu of payment are not made, within\ntwenty-four (24) hours of the attachment of the wheel lock, such vehicle may be\ntowed and impounded to any public or private impoundment lot. If a private\ncontractor tows and stores the vehicle he may impose against the vehicle his\ncustomary fees and charges for such services. \nOnce a vehicle has been impounded, the Finance Director or his designee, shall\nmail a notice of impoundment to the registered owner and lienholders, if any are\nknown, at the address or addresses reported to the City by the North Carolina\nDepartment of Motor Vehicles.\n\n(d) Upon payment of all civil penalties and overdue and unpaid parking tickets\nissued for the vehicle and of all other charges authorized by this section,\nincluding immobilization, towing, and impoundment fees, the vehicle shall be\nreleased to the owner or any other person legally entitled to claim possession\nof the vehicle.\n\n(f) The owner or other person entitled to possession of the vehicle which has\nbeen immobilized pursuant to this section may submit a request for hearing to\nthe Finance Director by certified mail or personal delivery within seven (7)\ndays from the receipt of the notice provided for in subsection (c) hereinabove.\nIf a hearing is requested, a statement shall be sent to the requesting party to\ninform him of the time and place of the hearing, of the basis of the vehicles\nimmobilization and impoundment, of the rules governing conduct of the hearing,\nof the right to present evidence as to why the vehicle should not have been\nimmobilized or towed, and of the right to be represented by counsel. The hearing\nofficer shall prepare a written report of his findings within three (3) days of\nthe hearing. The report shall state his conclusion as to whether the vehicle was\nproperly immobilized and towed, and the reasons underlying his conclusion. If it\nis concluded that the vehicle was improperly immobilized or towed, then any\nimproper charges shall be canceled, or if paid, rebated.\n\n(g) It shall be unlawful for anyone to remove from a vehicle a wheel lock placed\nthereon pursuant to this section or to remove from impoundment any vehicle\nplaced therein pursuant to this section without all civil penalties and\napplicable charges having first been paid or an approved payment plan having\nbeen made.\n\n(h) The City Manager is authorized to establish guidelines to adjust the amount\nof civil penalties imposed pursuant to this section to promote the resolution of\nany claim against persons with ten (10) or more outstanding delinquent parking\ntickets. \n(Ord. No. 1995-714, §1, 9-5-95)\n"}