{"law_id":"554","edition_id":"1","section_id":"554","structure_id":"171","section_number":"12-1001","catch_line":"AWNINGS, CANOPIES, MARQUEES, SIGNS AND OTHER PROJECTIONS OVER SIDEWALKS.","history":"","full_text":"","order_by":"12-1001","text":{"0":{"id":"1508","text":"","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"1509","text":"\tExpress approval required. \nIt shall be unlawful except with the express approval of the Council, for any person, firm, or corporation to construct or maintain any awning, (fixed or movable) sign, canopy, marquee, structure, or any other encroachment on, projecting into, overhanging, or with its supports on the public rights-of-way, provided no express approval by the City Council is required for mailboxes, lawn irrigation systems for single-family and duplex dwelling units and plantings on street rights-of-way, for banners erected in accordance with the banner display program policy. Before authorizing the construction of any awning, (fixed or movable) sign, canopy, marquee, structure, or encroachment, the Council shall find that such construction will not in any way hinder, obstruct, delay, or in anywise endanger the free and safe use of the public rights-of-way, and comply with the procedure set forth in §12-1022. Permission for the use of the public rights-of-way for any use permitted herein shall not relieve the petitioner from compliance with any other requirement of this Code. In addition to the permission of the City Council, encroachments over, under or in streets and alleys under the control of the State Department of Transportation may be erected only if that department consents thereto. Permission for the use of the public rights-of-way for any use permitted herein shall be subject to revocation by the Council at will. \nCross reference: City permit required for the planting of plant material in any public street, §9-8005; banner display program policy, Resolution No. (2000) 590. \n","type":"section","prefixes":["(a)","(1)"],"prefix":"(1)","entire_prefix":"(a)(1)","prefix_anchor":"(a)(1)","level":2},"2":{"id":"1510","text":"\tAwnings, etc. \nAwnings, marquees and other structures extending from and attached to buildings may be permitted under the following rules: \na.\tEvery fixed awning, marquee, or structure and sign extending from and attached to buildings erected after March 8, 1992, shall be at its lowest point at least nine (9) feet, excluding a flexible balance which may extend one additional foot, above a sidewalk or the ground when projecting over public rights-of-way and shall not extend or occupy more than two-thirds of the width of the sidewalk when measured from the building. When proposed fixed awnings, marquees, or signs are at least fourteen (14) feet above a sidewalk or the ground, the Council may permit such fixed awnings, marquees, or other structures and signs to extend or occupy more than two-thirds the width of the sidewalk, provided that such encroachments shall not extend closer than eighteen (18) inches from the back of the curb. \nb.\tMetal or canvas movable awnings may extend over public rights-of-way for a distance of not more than five (5) feet provided such awnings or any part thereof maintain a clear height of eight (8) feet, excluding a flexible balance which may extend one additional foot, above the sidewalk. All movable awnings shall be supported on metal frames attached to the building. \nc.\tInside the primary fire districts, all awnings (fixed and movable) and marquees shall be entirely made of noncombustible material or in the use of canvas, cloth of similar synthetic fabric-like materials, such coverings shall be treated so as to produce a flame spread no greater than twenty-five (25). \nd.\tThe design and construction of marquees shall comply with the requirements of the North Carolina State Building Code. \ne.\tThe director of transportation shall advise the Council as to whether the proposed awning (fixed or movable), marquee, structure, or sign will obstruct the view of motorists using any street, private driveway, or approach to any street intersection. \n","type":"section","prefixes":["(a)","(2)"],"prefix":"(2)","entire_prefix":"(a)(2)","prefix_anchor":"(a)(2)","level":2},"3":{"id":"1511","text":"\tCanopies. \nWhere supports are to be placed on the public rights-of-way, all canopies may be permitted under the following rules: \na.\tPlans for such canopies shall be submitted to the Council. \nb.\tAll canopies on streets other than the first four (4) blocks from the State Capitol of Fayetteville Street, shall be constructed of concrete or metal in such a manner as to be substantially permanent in nature and in compliance with the North Carolina State Building Code. \nc.\tThe minimum underside clearance including signs or other appurtenances below the structure shall be fourteen (14) feet above the sidewalk. \nd.\tThe center line of the columns shall be three (3) feet behind the back of the existing street curb. No columns shall be more than two (2) feet in diameter (or other cross-section). Other improvements may be placed in the space between two (2) feet and four (4) feet from the face of the curb (the column area), upon Council approval of specific plans. \ne.\tNo part of the canopy shall project closer than eighteen (18) inches to a street parking or traffic lane. \nf.\tAll canopies must be equipped with underside lighting, provided and maintained by the abutting properties at a level of ten (10) footcandles at the sidewalk. \ng.\tAn identification sign on the underside of the canopy which conforms to §10-2065.2(a) is permitted. \nh.\tThe director of transportation shall advise the Council as to whether the proposed canopy will obstruct the view of motorists using any street, private driveway, or approach to any street intersection. \n","type":"section","prefixes":["(a)","(3)"],"prefix":"(3)","entire_prefix":"(a)(3)","prefix_anchor":"(a)(3)","level":2},"4":{"id":"1512","text":"\tFayetteville Street limitations. \nOn Fayetteville Street (first three (3) blocks from the State Capitol) no marquees shall be hereafter constructed and all canopies must conform to the design established by the mall committee, approved by the Council and on file in the Department of Planning. \n","type":"section","prefixes":["(a)","(4)"],"prefix":"(4)","entire_prefix":"(a)(4)","prefix_anchor":"(a)(4)","level":2},"5":{"id":"1513","text":"\tGasoline service stations. \nGasoline service stations having pumps constructed, erected, reconstructed, or reerected as provided in Code §10-6036 may have canopies which extend from the wall of the main service station building to a point four (4) feet beyond the pumps and pump islands; provided that the construction of such canopies shall meet all of the construction requirements of subsection (a)(3); provided that all permits which allow the construction of such canopies as are constructed nearer the street than the building setback line specified in the zoning ordinance shall be removed at any time at the cost of the property owner in the discretion of the Council; provided further, no permit shall be issued for the construction of a canopy closer to the public right-of-way than provided in the zoning ordinance unless and until an instrument, sufficient to give proper notice to subsequent owners of the conditions on which the permit is to be issued, shall be recorded in the office of the Register of Deeds. \n","type":"section","prefixes":["(a)","(5)"],"prefix":"(5)","entire_prefix":"(a)(5)","prefix_anchor":"(a)(5)","level":2},"6":{"id":"1514","text":"","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"7":{"id":"1515","text":"\tSign. \nAny identification, description, animation, illustration or device, illuminated or nonilluminated, which is visible from any right-of-way, which directs attention to any realty, product, service, place, activity, person, institution, performance, commodity, firm, business, or solicitation, including any permanently installed or situated merchandise; or any emblem, painting, banner, poster, bulletin board, pennant, placard, or temporary sign designed to identify or convey information, with the exception of state, municipal, or national flags. \n","type":"section","prefixes":["(b)","(1)"],"prefix":"(1)","entire_prefix":"(b)(1)","prefix_anchor":"(b)(1)","level":2},"8":{"id":"1516","text":"\tMarquee. \nA marquee shall include any hood or awning of permanent construction supported from the wall of a building above an entrance and extending into a street right-of-way without pillars or posts within a street right-of-way. \n","type":"section","prefixes":["(b)","(2)"],"prefix":"(2)","entire_prefix":"(b)(2)","prefix_anchor":"(b)(2)","level":2},"9":{"id":"1517","text":"\tAwning. \nAn awning shall include any structure made of cloth or metal with a metal frame attached to a building and projecting into a street right-of-way regardless of whether the same is supported by pillars or posts in the right-of-way and regardless of whether it can be raised to a position flat against the building when not in use. \n","type":"section","prefixes":["(b)","(3)"],"prefix":"(3)","entire_prefix":"(b)(3)","prefix_anchor":"(b)(3)","level":2},"10":{"id":"1518","text":"\tCanopy. \nA canopy shall include any structure, other than an awning, made of metal or other incombustible material attached to a building projecting into a street right-of-way and supported by pillars or posts within a street right-of-way. Canopies shall extend across the entire street frontage of a building. \n","type":"section","prefixes":["(b)","(4)"],"prefix":"(4)","entire_prefix":"(b)(4)","prefix_anchor":"(b)(4)","level":2},"11":{"id":"1519","text":"\tStructure. \nThe term structure shall mean a combination of material to form a construction that is safe and stable including among others, buildings, reviewing stands, platforms, stagings, observation towers, trestles, shelters, fences, and display signs; the term structure shall be construed as if followed by the words &#8220;or part thereof.&#8221; \n(Code 1959 , §19-2; Ord. No. 1977-579, 7-5-77; Ord. No. 1979-982-TC-96, §§35—37, 1-2-79; Ord. No. 1979-118, 6-19-79; Ord. No. 1980-503, 10-21-80; Ord. No. 1981-806, §§1, 2, 12-8-81; Ord. No. 1985-598, §1, 6-18-85; Ord. No. 1985-645, §§1—3, 10-1-85; Ord. No. 1987-946-TC-286, §52, 4-7-87; Ord. No. 1992-930, §§1—5, 3-3-92; Ord. No. 1999-482, §1, 1-5-99; Ord. No. 2000-800, §1, 5-16-00) \nCross reference: Sign regulations generally, §10-2065 \n","type":"section","prefixes":["(b)","(5)"],"prefix":"(5)","entire_prefix":"(b)(5)","prefix_anchor":"(b)(5)","level":2}},"ancestry":{"1":{"id":"171","name":"ARTICLE A. - STREET OBSTRUCTIONS AND ENCROACHMENTS","identifier":"A","label":"article","url":"\/II\/12\/1\/A\/"},"2":{"id":"170","name":"CHAPTER 1. - STREETS AND PUBLIC WAYS","identifier":"1","label":"chapter","url":"\/II\/12\/1\/"},"3":{"id":"169","name":"PART 12 - LICENSING AND REGULATION","identifier":"12","label":"part","url":"\/II\/12\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"554","structure_id":"171","section_number":"12-1001","catch_line":"AWNINGS, CANOPIES, MARQUEES, SIGNS AND OTHER PROJECTIONS OVER SIDEWALKS.","url":"\/12-1001\/","token":"12-1001"},"1":{"id":"555","structure_id":"171","section_number":"12-1002","catch_line":"BRIDGES OVER GUTTERS.","url":"\/12-1002\/","token":"12-1002"},"2":{"id":"556","structure_id":"171","section_number":"12-1003","catch_line":"CELLAR DOORS, GRATINGS AND MANHOLES IN SIDEWALKS.","url":"\/12-1003\/","token":"12-1003"},"3":{"id":"557","structure_id":"171","section_number":"12-1004","catch_line":"CELLARS AND VAULTS UNDER SIDEWALKS.","url":"\/12-1004\/","token":"12-1004"},"4":{"id":"559","structure_id":"171","section_number":"12-1005","catch_line":"PLACING ARTICLES ON SIDEWALKS SO AS TO OBSTRUCT.","url":"\/12-1005\/","token":"12-1005"},"5":{"id":"560","structure_id":"171","section_number":"12-1006","catch_line":"BICYCLES ON SIDEWALKS.","url":"\/12-1006\/","token":"12-1006"},"6":{"id":"561","structure_id":"171","section_number":"12-1007","catch_line":"RESERVED.","url":"\/12-1007\/","token":"12-1007"},"7":{"id":"562","structure_id":"171","section_number":"12-1007","catch_line":"RESERVED. ","url":"\/12-1007\/","token":"12-1007"}},"next_section":{"id":"555","structure_id":"171","section_number":"12-1002","catch_line":"BRIDGES OVER GUTTERS.","url":"\/12-1002\/","token":"12-1002"},"metadata":false,"references":false,"url":"\/12-1001\/","token":"12-1001","formats":{"txt":"\/12-1001.txt","json":"\/12-1001.xml"},"dublin_core":{"Title":"AWNINGS, CANOPIES, MARQUEES, SIGNS AND OTHER PROJECTIONS OVER SIDEWALKS.","Type":"Text","Format":"text\/html","Identifier":"§ 12-1001","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nAWNINGS, CANOPIES, MARQUEES, SIGNS AND OTHER PROJECTIONS OVER SIDEWALKS. (§\n12-1001)\n\n(a) \n\n   (1) \tExpress approval required. \n   It shall be unlawful except with the express approval of the Council, for any\n   person, firm, or corporation to construct or maintain any awning, (fixed or\n   movable) sign, canopy, marquee, structure, or any other encroachment on,\n   projecting into, overhanging, or with its supports on the public\n   rights-of-way, provided no express approval by the City Council is required\n   for mailboxes, lawn irrigation systems for single-family and duplex dwelling\n   units and plantings on street rights-of-way, for banners erected in accordance\n   with the banner display program policy. Before authorizing the construction of\n   any awning, (fixed or movable) sign, canopy, marquee, structure, or\n   encroachment, the Council shall find that such construction will not in any\n   way hinder, obstruct, delay, or in anywise endanger the free and safe use of\n   the public rights-of-way, and comply with the procedure set forth in\n   §12-1022. Permission for the use of the public rights-of-way for any use\n   permitted herein shall not relieve the petitioner from compliance with any\n   other requirement of this Code. In addition to the permission of the City\n   Council, encroachments over, under or in streets and alleys under the control\n   of the State Department of Transportation may be erected only if that\n   department consents thereto. Permission for the use of the public\n   rights-of-way for any use permitted herein shall be subject to revocation by\n   the Council at will. \n   Cross reference: City permit required for the planting of plant material in\n   any public street, §9-8005; banner display program policy, Resolution No.\n   (2000) 590. \n   \n\n   (2) \tAwnings, etc. \n   Awnings, marquees and other structures extending from and attached to\n   buildings may be permitted under the following rules: \n   a.\tEvery fixed awning, marquee, or structure and sign extending from and\n   attached to buildings erected after March 8, 1992, shall be at its lowest\n   point at least nine (9) feet, excluding a flexible balance which may extend\n   one additional foot, above a sidewalk or the ground when projecting over\n   public rights-of-way and shall not extend or occupy more than two-thirds of\n   the width of the sidewalk when measured from the building. When proposed fixed\n   awnings, marquees, or signs are at least fourteen (14) feet above a sidewalk\n   or the ground, the Council may permit such fixed awnings, marquees, or other\n   structures and signs to extend or occupy more than two-thirds the width of the\n   sidewalk, provided that such encroachments shall not extend closer than\n   eighteen (18) inches from the back of the curb. \n   b.\tMetal or canvas movable awnings may extend over public rights-of-way for a\n   distance of not more than five (5) feet provided such awnings or any part\n   thereof maintain a clear height of eight (8) feet, excluding a flexible\n   balance which may extend one additional foot, above the sidewalk. All movable\n   awnings shall be supported on metal frames attached to the building. \n   c.\tInside the primary fire districts, all awnings (fixed and movable) and\n   marquees shall be entirely made of noncombustible material or in the use of\n   canvas, cloth of similar synthetic fabric-like materials, such coverings shall\n   be treated so as to produce a flame spread no greater than twenty-five (25). \n   d.\tThe design and construction of marquees shall comply with the requirements\n   of the North Carolina State Building Code. \n   e.\tThe director of transportation shall advise the Council as to whether the\n   proposed awning (fixed or movable), marquee, structure, or sign will obstruct\n   the view of motorists using any street, private driveway, or approach to any\n   street intersection. \n   \n\n   (3) \tCanopies. \n   Where supports are to be placed on the public rights-of-way, all canopies may\n   be permitted under the following rules: \n   a.\tPlans for such canopies shall be submitted to the Council. \n   b.\tAll canopies on streets other than the first four (4) blocks from the State\n   Capitol of Fayetteville Street, shall be constructed of concrete or metal in\n   such a manner as to be substantially permanent in nature and in compliance\n   with the North Carolina State Building Code. \n   c.\tThe minimum underside clearance including signs or other appurtenances\n   below the structure shall be fourteen (14) feet above the sidewalk. \n   d.\tThe center line of the columns shall be three (3) feet behind the back of\n   the existing street curb. No columns shall be more than two (2) feet in\n   diameter (or other cross-section). Other improvements may be placed in the\n   space between two (2) feet and four (4) feet from the face of the curb (the\n   column area), upon Council approval of specific plans. \n   e.\tNo part of the canopy shall project closer than eighteen (18) inches to a\n   street parking or traffic lane. \n   f.\tAll canopies must be equipped with underside lighting, provided and\n   maintained by the abutting properties at a level of ten (10) footcandles at\n   the sidewalk. \n   g.\tAn identification sign on the underside of the canopy which conforms to\n   §10-2065.2(a) is permitted. \n   h.\tThe director of transportation shall advise the Council as to whether the\n   proposed canopy will obstruct the view of motorists using any street, private\n   driveway, or approach to any street intersection. \n   \n\n   (4) \tFayetteville Street limitations. \n   On Fayetteville Street (first three (3) blocks from the State Capitol) no\n   marquees shall be hereafter constructed and all canopies must conform to the\n   design established by the mall committee, approved by the Council and on file\n   in the Department of Planning. \n   \n\n   (5) \tGasoline service stations. \n   Gasoline service stations having pumps constructed, erected, reconstructed, or\n   reerected as provided in Code §10-6036 may have canopies which extend from\n   the wall of the main service station building to a point four (4) feet beyond\n   the pumps and pump islands; provided that the construction of such canopies\n   shall meet all of the construction requirements of subsection (a)(3); provided\n   that all permits which allow the construction of such canopies as are\n   constructed nearer the street than the building setback line specified in the\n   zoning ordinance shall be removed at any time at the cost of the property\n   owner in the discretion of the Council; provided further, no permit shall be\n   issued for the construction of a canopy closer to the public right-of-way than\n   provided in the zoning ordinance unless and until an instrument, sufficient to\n   give proper notice to subsequent owners of the conditions on which the permit\n   is to be issued, shall be recorded in the office of the Register of Deeds. \n   \n\n(b) \n\n   (1) \tSign. \n   Any identification, description, animation, illustration or device,\n   illuminated or nonilluminated, which is visible from any right-of-way, which\n   directs attention to any realty, product, service, place, activity, person,\n   institution, performance, commodity, firm, business, or solicitation,\n   including any permanently installed or situated merchandise; or any emblem,\n   painting, banner, poster, bulletin board, pennant, placard, or temporary sign\n   designed to identify or convey information, with the exception of state,\n   municipal, or national flags. \n   \n\n   (2) \tMarquee. \n   A marquee shall include any hood or awning of permanent construction supported\n   from the wall of a building above an entrance and extending into a street\n   right-of-way without pillars or posts within a street right-of-way. \n   \n\n   (3) \tAwning. \n   An awning shall include any structure made of cloth or metal with a metal\n   frame attached to a building and projecting into a street right-of-way\n   regardless of whether the same is supported by pillars or posts in the\n   right-of-way and regardless of whether it can be raised to a position flat\n   against the building when not in use. \n   \n\n   (4) \tCanopy. \n   A canopy shall include any structure, other than an awning, made of metal or\n   other incombustible material attached to a building projecting into a street\n   right-of-way and supported by pillars or posts within a street right-of-way.\n   Canopies shall extend across the entire street frontage of a building. \n   \n\n   (5) \tStructure. \n   The term structure shall mean a combination of material to form a construction\n   that is safe and stable including among others, buildings, reviewing stands,\n   platforms, stagings, observation towers, trestles, shelters, fences, and\n   display signs; the term structure shall be construed as if followed by the\n   words &#8220;or part thereof.&#8221; \n   (Code 1959 , §19-2; Ord. No. 1977-579, 7-5-77; Ord. No. 1979-982-TC-96,\n   §§35—37, 1-2-79; Ord. No. 1979-118, 6-19-79; Ord. No. 1980-503, 10-21-80;\n   Ord. No. 1981-806, §§1, 2, 12-8-81; Ord. No. 1985-598, §1, 6-18-85; Ord.\n   No. 1985-645, §§1—3, 10-1-85; Ord. No. 1987-946-TC-286, §52, 4-7-87; Ord.\n   No. 1992-930, §§1—5, 3-3-92; Ord. No. 1999-482, §1, 1-5-99; Ord. No.\n   2000-800, §1, 5-16-00) \n   Cross reference: Sign regulations generally, §10-2065\n"}