{"law_id":"564","section_number":"12-1022","catch_line":"USE OF SIDEWALKS FOR PRIVATE PURPOSES; PERMIT REQUIRED; INSURANCE.","history":"","order_by":"12-1022","metadata":false,"url":"\/12-1022\/","token":"12-1022","structure":{"1":{"id":"172","name":"ARTICLE B. - STREET USE AND CLEANLINESS","identifier":"B","label":"article","url":"\/II\/12\/1\/B\/"},"2":{"id":"170","name":"CHAPTER 1. - STREETS AND PUBLIC WAYS","identifier":"1","label":"chapter","url":"\/II\/12\/1\/"},"3":{"id":"169","name":"PART 12 - LICENSING AND REGULATION","identifier":"12","label":"part","url":"\/II\/12\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"referred_to_by":false,"edition_id":"1","section_id":"564","structure_id":"172","full_text":"(a) No use of the surface of public sidewalks or public right-of-way for private purposes shall be permitted or continued unless the person, partnership, firm, or corporation desiring to use or continue the use of a sidewalk or public right-of-way shall procure a permit from the Director of Transportation of the City, after the approval of such use by the City Council. Such permit shall be issued only upon condition that the user of the sidewalk or public right-of-way for private purpose shall first assume in writing, responsibility for any injury or death of persons or damage sustained as a result of such use. \nUsers of the sidewalk or public right-of-way shall post indemnity with a surety or liability insurance in accordance with §11-6001(b)(1). The indemnity or insurance so provided shall be maintained throughout the period of such use and it shall be unlawful to continue such use without continuing such indemnity or insurance. Encroachments for transmission devices of any type shall pay a fee at the rate of four cents ($0.04) per linear foot per month of use, except that Wake County, the State of North Carolina, any educational institution of Wake County or the State of North Carolina, and companies holding approved franchise agreements with the City shall be exempt from this fee; said fee shall be collected prospectively on an annual basis. All users of the sidewalk or public right-of-way shall pay an administrative charge of seventy dollars ($70.00) which partially defrays the City&#8217;s expense in keeping records and processing these requests. Notwithstanding any other provision of this section, no neighborhood identification sign funded all or in part by a loan or grant from the City of Raleigh and approved by the Director of Public Works shall be subject to the insurance requirement set out in this section. \nUpon construction of the encroachment the user shall submit to the City as built drawings showing the precise location of the encroachment, and in the case of encroachments for transmission devices the drawing shall also show the location of other utilities in the public right-of-way or sidewalk. As-built plans shall not be required for underground lawn irrigation systems when used specifically for single-family or duplex dwelling units. Permission for the use of the public rights-of-way or sidewalks shall not relieve the petitioner from compliance with any other requirement of this Code. Permission for the use of the sidewalk or public rights-of-way for any use permitted herein shall be subject to revocation by the Council at will. Newsracks and public utility companies authorized to use the streets under the franchise from the City shall be exempt from the provisions of this section. Handicapped ramps installed to serve government buildings built prior to March 20, 1979, shall be exempt from the provisions of this section, provided such ramps shall not extend or occupy more than three-fifths the width of the sidewalk and shall not extend closer than three (3) feet to the curb. \nAny person, partnership, firm, corporation or any other entity who shall use a sidewalk or public right-of-way without first obtaining the approval of the City Council shall be guilty of a misdemeanor and shall upon conviction be punished as in such cases provided by statute. In addition to this criminal remedy and any other authorized remedy, any person, partnership, firm, corporation or any other entity who excavates or excavated in a sidewalk or public right-of-way without first obtaining the approval of the City Council shall be subject in the sole discretion of the Council to a civil penalty of not more than two hundred dollars ($200.00) plus ten dollars ($10.00) for each continuous day of use. No penalty shall be assessed until the alleged violator has been notified of the violation. The Council shall determine the amount of the civil penalty to be assessed and shall make a written demand for payment upon the person, partnership, firm, corporation or entity responsible for the violation and shall set forth in detail the violation for which the penalty has been invoked. If payment is not received or equitable settlement reached within thirty (30) days after demand for payment is made, the matter shall be referred to the City Attorney for institution of a civil action in the name of the City in the appropriate division of the General Court of Justice of Wake County for recovery of the penalty. \nCross reference: Permit and regulations for working in, upon, over, under or adjacent to the streets and sidewalks, §11-6001\r\r","text":{"0":{"id":"1536","text":"No use of the surface of public sidewalks or public right-of-way for private purposes shall be permitted or continued unless the person, partnership, firm, or corporation desiring to use or continue the use of a sidewalk or public right-of-way shall procure a permit from the Director of Transportation of the City, after the approval of such use by the City Council. Such permit shall be issued only upon condition that the user of the sidewalk or public right-of-way for private purpose shall first assume in writing, responsibility for any injury or death of persons or damage sustained as a result of such use. \nUsers of the sidewalk or public right-of-way shall post indemnity with a surety or liability insurance in accordance with §11-6001(b)(1). The indemnity or insurance so provided shall be maintained throughout the period of such use and it shall be unlawful to continue such use without continuing such indemnity or insurance. Encroachments for transmission devices of any type shall pay a fee at the rate of four cents ($0.04) per linear foot per month of use, except that Wake County, the State of North Carolina, any educational institution of Wake County or the State of North Carolina, and companies holding approved franchise agreements with the City shall be exempt from this fee; said fee shall be collected prospectively on an annual basis. All users of the sidewalk or public right-of-way shall pay an administrative charge of seventy dollars ($70.00) which partially defrays the City&#8217;s expense in keeping records and processing these requests. Notwithstanding any other provision of this section, no neighborhood identification sign funded all or in part by a loan or grant from the City of Raleigh and approved by the Director of Public Works shall be subject to the insurance requirement set out in this section. \nUpon construction of the encroachment the user shall submit to the City as built drawings showing the precise location of the encroachment, and in the case of encroachments for transmission devices the drawing shall also show the location of other utilities in the public right-of-way or sidewalk. As-built plans shall not be required for underground lawn irrigation systems when used specifically for single-family or duplex dwelling units. Permission for the use of the public rights-of-way or sidewalks shall not relieve the petitioner from compliance with any other requirement of this Code. Permission for the use of the sidewalk or public rights-of-way for any use permitted herein shall be subject to revocation by the Council at will. Newsracks and public utility companies authorized to use the streets under the franchise from the City shall be exempt from the provisions of this section. Handicapped ramps installed to serve government buildings built prior to March 20, 1979, shall be exempt from the provisions of this section, provided such ramps shall not extend or occupy more than three-fifths the width of the sidewalk and shall not extend closer than three (3) feet to the curb. \nAny person, partnership, firm, corporation or any other entity who shall use a sidewalk or public right-of-way without first obtaining the approval of the City Council shall be guilty of a misdemeanor and shall upon conviction be punished as in such cases provided by statute. In addition to this criminal remedy and any other authorized remedy, any person, partnership, firm, corporation or any other entity who excavates or excavated in a sidewalk or public right-of-way without first obtaining the approval of the City Council shall be subject in the sole discretion of the Council to a civil penalty of not more than two hundred dollars ($200.00) plus ten dollars ($10.00) for each continuous day of use. No penalty shall be assessed until the alleged violator has been notified of the violation. The Council shall determine the amount of the civil penalty to be assessed and shall make a written demand for payment upon the person, partnership, firm, corporation or entity responsible for the violation and shall set forth in detail the violation for which the penalty has been invoked. If payment is not received or equitable settlement reached within thirty (30) days after demand for payment is made, the matter shall be referred to the City Attorney for institution of a civil action in the name of the City in the appropriate division of the General Court of Justice of Wake County for recovery of the penalty. \nCross reference: Permit and regulations for working in, upon, over, under or adjacent to the streets and sidewalks, §11-6001","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"1537","text":"","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"2":{"id":"1538","text":"\tNo individual newsrack shall exceed fifty (50) inches in height, twenty-four (24) inches in width and twenty-four (24) inches in thickness. This includes all signs and any other permanent attachments necessary for the operation of the newsrack. \n","type":"section","prefixes":["(b)","(1)"],"prefix":"(1)","entire_prefix":"(b)(1)","prefix_anchor":"(b)(1)","level":2},"3":{"id":"1539","text":"\tNewsracks may be placed no closer than five (5) feet from the edge of the street curb and shall be placed parallel to and no more than six (6) inches from the sidewalk edge farthest away from the street curb, or the wall of a building which is adjacent to the sidewalk edge. \n","type":"section","prefixes":["(b)","(2)"],"prefix":"(2)","entire_prefix":"(b)(2)","prefix_anchor":"(b)(2)","level":2},"4":{"id":"1540","text":"\tNo newsrack shall be affixed or attached to any fixture or other property owned or maintained by the City of Raleigh. All newsracks shall be enclosed so as to prevent the unintended escape therefrom of the printed material being dispensed from the rack. If a vendor cannot provide an enclosed rack, it may use an open rack if that rack has a latch or other device to prevent the contents of the rack from being removed by the wind or other accidental means. Any newsracks not meeting these standards shall be removed from the public right-of-way no later than July 15, 1995. \n","type":"section","prefixes":["(b)","(3)"],"prefix":"(3)","entire_prefix":"(b)(3)","prefix_anchor":"(b)(3)","level":2},"5":{"id":"1541","text":"\tNo newsracks shall be placed, installed, used or maintained: \na.\tWithin fifteen (15) feet of any fire hydrant, standpipe or siamese connector.\nb.\tWithin five (5) feet of any emergency call box or other emergency telecommunications equipment or any other emergency facility.\nc.\tWithin five (5) feet of any driveway or cross-walk.\nd.\tWithin five (5) feet of any public transit benches or other public benches and trash containers.\ne.\tWithin five (5) feet of any area within the public right-of-way improved with lawn, flowers, shrubs, or trees.\nf.\tAt any location where the clear space for the passageway of pedestrians is reduced to less than five (5) feet.\ng.\tWithin a ten-foot radius of the points of intersection of the right-of-way of two (2) intersecting streets. \nh.\tWithin five (5) feet of any underground utility access points, ventilation areas or meters.\ni.\tWithin five (5) feet of any handicapped ramps or other facilities provided for handicapped persons. \nj.\tWithin five (5) feet of any building access, exits or any emergency access or exit ways.\n","type":"section","prefixes":["(b)","(4)"],"prefix":"(4)","entire_prefix":"(b)(4)","prefix_anchor":"(b)(4)","level":2},"6":{"id":"1542","text":"\tNo newsrack shall be used for advertising signs or publicity purposes other than an identification sign dealing with the display, sale or purchase of the newspaper or news periodical sold therein. Within ninety (90) days after this section becomes effective, every person or other entity which places or maintains a newsrack on the streets of the City of Raleigh shall have the vendor&#8217;s name, address and telephone number affixed thereto in a place where such information may be easily seen. A uniform sticker shall be supplied by the Inspections Department for this purpose. Any newsrack installed, used or maintained in violation of the provisions of this section shall be tagged with a &#8220;notice of violation&#8221; stating the violation, date of tagging, notice of intention to remove the newsrack if the violation is not corrected within ten (10) days or procedure for obtaining a hearing before the Inspections Department is made giving the owner of the newsrack opportunity to be heard regarding the violation. The Inspections Department or its designate may, as an alternative to tagging said newsrack, move, align, or otherwise reposition such rack or racks in order to restore them to a legal condition. Any newsrack which has been tagged and remains in violation of the provisions stated on the tag past the ten-day correction period, and for which no hearing has been requested, shall be removed by the Inspections Department or its designate and stored in a secure location. The Inspections Department or its designate shall notify the owner thereof by mailing a &#8220;notice of removal&#8221; to the last known address of the owner. Such notice shall state the date the newsrack was removed, the reasons therefor, the procedure for obtaining a post-removal hearing before the Inspections Department, if desired. Any such newsrack removed and stored pursuant to these provisions shall be released to the owner thereof if claimed within forty-five (45) days after such removal and upon the payment of reasonable charges of removal and storage. Upon failure of the owner to claim such newsrack and pay the reasonable charges within forty-five (45) days after the mailing of written notice of removal, such newsrack shall be deemed to be unclaimed property in possession of the Police Department and may be disposed of pursuant to the provisions outlined in the Code of the City of Raleigh. Any newsrack in violation of the provisions of this section, which violation creates an immediate danger to the health, safety or welfare of the public, which violation cannot be corrected by moving or otherwise repositioning the newsrack, may be summarily removed and stored in a secure location so as to eliminate the danger to the health, safety and welfare of the public. The Inspections Department or its designate shall notify the owner as outlined in this section. Every person or other entity which places or maintains a newsrack on a public sidewalk or right-of-way in the City of Raleigh shall file a written statement with the Inspections Department satisfactory to the City Attorney whereby he or it agrees to indemnify and hold harmless the City, its officers, councilmen and employees, from any loss or liability or damage, including expenses and costs, for bodily or personal injury, and for property damage sustained by any person as a result of the installation, use, or maintenance of a newsrack within the City of Raleigh. \n(Code 1959 , §19-5.1; Ord. No. 1977-472, 3-15-77; Ord. No. 1979-46, 3-20-79; Ord. No. 1984-415, §§1—3, 9-18-84; Ord. No. 1985-639A, §§7—9, 9-17-85; Ord. No. 1987-36, §1, 9-1-87; Ord. No. 1994-521, §1, 12-13-94; Ord. No. 1998-454, §19, 11-4-98; Ord. No. 1999-482, §2, 1-5-99; Ord. No. 2006-83, §2, 9-5-06; Ord. No. 2009-641, §§2, 3, 9-1-09) \n","type":"section","prefixes":["(b)","(5)"],"prefix":"(5)","entire_prefix":"(b)(5)","prefix_anchor":"(b)(5)","level":2}},"ancestry":{"1":{"id":"172","name":"ARTICLE B. - STREET USE AND CLEANLINESS","identifier":"B","label":"article","url":"\/II\/12\/1\/B\/"},"2":{"id":"170","name":"CHAPTER 1. - STREETS AND PUBLIC WAYS","identifier":"1","label":"chapter","url":"\/II\/12\/1\/"},"3":{"id":"169","name":"PART 12 - LICENSING AND REGULATION","identifier":"12","label":"part","url":"\/II\/12\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"563","structure_id":"172","section_number":"12-1021","catch_line":"AUCTION SALES IN STREETS; ATTRACTING CROWDS.","url":"\/12-1021\/","token":"12-1021"},"1":{"id":"564","structure_id":"172","section_number":"12-1022","catch_line":"USE OF SIDEWALKS FOR PRIVATE PURPOSES; PERMIT REQUIRED; INSURANCE.","url":"\/12-1022\/","token":"12-1022"},"2":{"id":"565","structure_id":"172","section_number":"12-1023","catch_line":"PRESENT USES; REPAIRS; COSTS.","url":"\/12-1023\/","token":"12-1023"},"3":{"id":"566","structure_id":"172","section_number":"12-1024","catch_line":"PEDDLERS' TIME ON STREET LIMITED; PRESENCE RESTRICTED IN CERTAIN AREA; IMPEDING PEDESTRIANS PROHIBITED; WASTE RECEPTACLE REQUIRED ON STAND, CART, ETC.","url":"\/12-1024\/","token":"12-1024"},"4":{"id":"567","structure_id":"172","section_number":"12-1025","catch_line":"SALE OF MERCHANDISE ON SIDEWALKS.","url":"\/12-1025\/","token":"12-1025"},"5":{"id":"568","structure_id":"172","section_number":"12-1026","catch_line":"SOLICITING BUSINESS OR EMPLOYMENT.","url":"\/12-1026\/","token":"12-1026"},"6":{"id":"570","structure_id":"172","section_number":"12-1027","catch_line":"SUBSCRIPTIONS OF PUBLICATIONS.","url":"\/12-1027\/","token":"12-1027"},"7":{"id":"571","structure_id":"172","section_number":"12-1028","catch_line":"TREES, PLANTING, INJURING, DESTROYING.","url":"\/12-1028\/","token":"12-1028"},"8":{"id":"572","structure_id":"172","section_number":"12-1029","catch_line":"UNLOADING COAL ON SIDEWALKS.","url":"\/12-1029\/","token":"12-1029"},"9":{"id":"573","structure_id":"172","section_number":"12-1030","catch_line":"VEHICLES AND ANIMALS ON SIDEWALKS.","url":"\/12-1030\/","token":"12-1030"},"10":{"id":"574","structure_id":"172","section_number":"12-1031","catch_line":"PLAYING GAMES OR THROWING MISSILES ON STREETS, SIDEWALKS, PRIVATE LOTS OR OTHER PUBLIC PROPERTY.","url":"\/12-1031\/","token":"12-1031"},"11":{"id":"575","structure_id":"172","section_number":"12-1032","catch_line":"DISCHARGING NOXIOUS FLUIDS.","url":"\/12-1032\/","token":"12-1032"},"12":{"id":"576","structure_id":"172","section_number":"12-1033","catch_line":"DRAINS UNDER SIDEWALKS.","url":"\/12-1033\/","token":"12-1033"},"13":{"id":"577","structure_id":"172","section_number":"12-1034","catch_line":"FILTHY MATTER IN WASTE RECEPTACLES.","url":"\/12-1034\/","token":"12-1034"},"14":{"id":"578","structure_id":"172","section_number":"12-1035","catch_line":"HAULING REFUSE; TRACKING MUD.","url":"\/12-1035\/","token":"12-1035"},"15":{"id":"579","structure_id":"172","section_number":"12-1036","catch_line":"PAINTING STREETS, CURBS, ETC.; AUTHORIZED CITY EMPLOYEES.","url":"\/12-1036\/","token":"12-1036"},"16":{"id":"582","structure_id":"172","section_number":"12-1037","catch_line":"CLEANING SIDEWALKS AND GUTTERS.","url":"\/12-1037\/","token":"12-1037"},"17":{"id":"583","structure_id":"172","section_number":"12-1037","catch_line":"REPAIR OF SIDEWALKS AND DRIVEWAYS BY PROPERTY OWNERS.","url":"\/12-1037\/","token":"12-1037"},"18":{"id":"584","structure_id":"172","section_number":"12-1038","catch_line":"JUNK, ETC., ON RIGHTS-OF-WAY PROHIBITED.","url":"\/12-1038\/","token":"12-1038"},"19":{"id":"585","structure_id":"172","section_number":"12-1039","catch_line":"REMOVING MATERIAL FROM STREETS.","url":"\/12-1039\/","token":"12-1039"},"20":{"id":"586","structure_id":"172","section_number":"12-1040","catch_line":"DEPOSITING TRASH ON STREET.","url":"\/12-1040\/","token":"12-1040"},"21":{"id":"587","structure_id":"172","section_number":"12-1041","catch_line":"RESERVED.","url":"\/12-1041\/","token":"12-1041"},"22":{"id":"588","structure_id":"172","section_number":"12-1041","catch_line":"RESERVED. ","url":"\/12-1041\/","token":"12-1041"}},"previous_section":{"id":"563","structure_id":"172","section_number":"12-1021","catch_line":"AUCTION SALES IN STREETS; ATTRACTING CROWDS.","url":"\/12-1021\/","token":"12-1021"},"next_section":{"id":"565","structure_id":"172","section_number":"12-1023","catch_line":"PRESENT USES; REPAIRS; COSTS.","url":"\/12-1023\/","token":"12-1023"},"references":false,"formats":{"txt":"\/12-1022.txt","json":"\/12-1022.xml"},"dublin_core":{"Title":"USE OF SIDEWALKS FOR PRIVATE PURPOSES; PERMIT REQUIRED; INSURANCE.","Type":"Text","Format":"text\/html","Identifier":"§ 12-1022","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nUSE OF SIDEWALKS FOR PRIVATE PURPOSES; PERMIT REQUIRED; INSURANCE. (§ 12-1022)\n\n(a) No use of the surface of public sidewalks or public right-of-way for private\npurposes shall be permitted or continued unless the person, partnership, firm,\nor corporation desiring to use or continue the use of a sidewalk or public\nright-of-way shall procure a permit from the Director of Transportation of the\nCity, after the approval of such use by the City Council. Such permit shall be\nissued only upon condition that the user of the sidewalk or public right-of-way\nfor private purpose shall first assume in writing, responsibility for any injury\nor death of persons or damage sustained as a result of such use. \nUsers of the sidewalk or public right-of-way shall post indemnity with a surety\nor liability insurance in accordance with §11-6001(b)(1). The indemnity or\ninsurance so provided shall be maintained throughout the period of such use and\nit shall be unlawful to continue such use without continuing such indemnity or\ninsurance. Encroachments for transmission devices of any type shall pay a fee at\nthe rate of four cents ($0.04) per linear foot per month of use, except that\nWake County, the State of North Carolina, any educational institution of Wake\nCounty or the State of North Carolina, and companies holding approved franchise\nagreements with the City shall be exempt from this fee; said fee shall be\ncollected prospectively on an annual basis. All users of the sidewalk or public\nright-of-way shall pay an administrative charge of seventy dollars ($70.00)\nwhich partially defrays the City&#8217;s expense in keeping records and\nprocessing these requests. Notwithstanding any other provision of this section,\nno neighborhood identification sign funded all or in part by a loan or grant\nfrom the City of Raleigh and approved by the Director of Public Works shall be\nsubject to the insurance requirement set out in this section. \nUpon construction of the encroachment the user shall submit to the City as built\ndrawings showing the precise location of the encroachment, and in the case of\nencroachments for transmission devices the drawing shall also show the location\nof other utilities in the public right-of-way or sidewalk. As-built plans shall\nnot be required for underground lawn irrigation systems when used specifically\nfor single-family or duplex dwelling units. Permission for the use of the public\nrights-of-way or sidewalks shall not relieve the petitioner from compliance with\nany other requirement of this Code. Permission for the use of the sidewalk or\npublic rights-of-way for any use permitted herein shall be subject to revocation\nby the Council at will. Newsracks and public utility companies authorized to use\nthe streets under the franchise from the City shall be exempt from the\nprovisions of this section. Handicapped ramps installed to serve government\nbuildings built prior to March 20, 1979, shall be exempt from the provisions of\nthis section, provided such ramps shall not extend or occupy more than\nthree-fifths the width of the sidewalk and shall not extend closer than three\n(3) feet to the curb. \nAny person, partnership, firm, corporation or any other entity who shall use a\nsidewalk or public right-of-way without first obtaining the approval of the City\nCouncil shall be guilty of a misdemeanor and shall upon conviction be punished\nas in such cases provided by statute. In addition to this criminal remedy and\nany other authorized remedy, any person, partnership, firm, corporation or any\nother entity who excavates or excavated in a sidewalk or public right-of-way\nwithout first obtaining the approval of the City Council shall be subject in the\nsole discretion of the Council to a civil penalty of not more than two hundred\ndollars ($200.00) plus ten dollars ($10.00) for each continuous day of use. No\npenalty shall be assessed until the alleged violator has been notified of the\nviolation. The Council shall determine the amount of the civil penalty to be\nassessed and shall make a written demand for payment upon the person,\npartnership, firm, corporation or entity responsible for the violation and shall\nset forth in detail the violation for which the penalty has been invoked. If\npayment is not received or equitable settlement reached within thirty (30) days\nafter demand for payment is made, the matter shall be referred to the City\nAttorney for institution of a civil action in the name of the City in the\nappropriate division of the General Court of Justice of Wake County for recovery\nof the penalty. \nCross reference: Permit and regulations for working in, upon, over, under or\nadjacent to the streets and sidewalks, §11-6001\n\n(b) \n\n   (1) \tNo individual newsrack shall exceed fifty (50) inches in height,\n   twenty-four (24) inches in width and twenty-four (24) inches in thickness.\n   This includes all signs and any other permanent attachments necessary for the\n   operation of the newsrack. \n   \n\n   (2) \tNewsracks may be placed no closer than five (5) feet from the edge of the\n   street curb and shall be placed parallel to and no more than six (6) inches\n   from the sidewalk edge farthest away from the street curb, or the wall of a\n   building which is adjacent to the sidewalk edge. \n   \n\n   (3) \tNo newsrack shall be affixed or attached to any fixture or other property\n   owned or maintained by the City of Raleigh. All newsracks shall be enclosed so\n   as to prevent the unintended escape therefrom of the printed material being\n   dispensed from the rack. If a vendor cannot provide an enclosed rack, it may\n   use an open rack if that rack has a latch or other device to prevent the\n   contents of the rack from being removed by the wind or other accidental means.\n   Any newsracks not meeting these standards shall be removed from the public\n   right-of-way no later than July 15, 1995. \n   \n\n   (4) \tNo newsracks shall be placed, installed, used or maintained: \n   a.\tWithin fifteen (15) feet of any fire hydrant, standpipe or siamese\n   connector.\n   b.\tWithin five (5) feet of any emergency call box or other emergency\n   telecommunications equipment or any other emergency facility.\n   c.\tWithin five (5) feet of any driveway or cross-walk.\n   d.\tWithin five (5) feet of any public transit benches or other public benches\n   and trash containers.\n   e.\tWithin five (5) feet of any area within the public right-of-way improved\n   with lawn, flowers, shrubs, or trees.\n   f.\tAt any location where the clear space for the passageway of pedestrians is\n   reduced to less than five (5) feet.\n   g.\tWithin a ten-foot radius of the points of intersection of the right-of-way\n   of two (2) intersecting streets. \n   h.\tWithin five (5) feet of any underground utility access points, ventilation\n   areas or meters.\n   i.\tWithin five (5) feet of any handicapped ramps or other facilities provided\n   for handicapped persons. \n   j.\tWithin five (5) feet of any building access, exits or any emergency access\n   or exit ways.\n   \n\n   (5) \tNo newsrack shall be used for advertising signs or publicity purposes\n   other than an identification sign dealing with the display, sale or purchase\n   of the newspaper or news periodical sold therein. Within ninety (90) days\n   after this section becomes effective, every person or other entity which\n   places or maintains a newsrack on the streets of the City of Raleigh shall\n   have the vendor&#8217;s name, address and telephone number affixed thereto in\n   a place where such information may be easily seen. A uniform sticker shall be\n   supplied by the Inspections Department for this purpose. Any newsrack\n   installed, used or maintained in violation of the provisions of this section\n   shall be tagged with a &#8220;notice of violation&#8221; stating the\n   violation, date of tagging, notice of intention to remove the newsrack if the\n   violation is not corrected within ten (10) days or procedure for obtaining a\n   hearing before the Inspections Department is made giving the owner of the\n   newsrack opportunity to be heard regarding the violation. The Inspections\n   Department or its designate may, as an alternative to tagging said newsrack,\n   move, align, or otherwise reposition such rack or racks in order to restore\n   them to a legal condition. Any newsrack which has been tagged and remains in\n   violation of the provisions stated on the tag past the ten-day correction\n   period, and for which no hearing has been requested, shall be removed by the\n   Inspections Department or its designate and stored in a secure location. The\n   Inspections Department or its designate shall notify the owner thereof by\n   mailing a &#8220;notice of removal&#8221; to the last known address of the\n   owner. Such notice shall state the date the newsrack was removed, the reasons\n   therefor, the procedure for obtaining a post-removal hearing before the\n   Inspections Department, if desired. Any such newsrack removed and stored\n   pursuant to these provisions shall be released to the owner thereof if claimed\n   within forty-five (45) days after such removal and upon the payment of\n   reasonable charges of removal and storage. Upon failure of the owner to claim\n   such newsrack and pay the reasonable charges within forty-five (45) days after\n   the mailing of written notice of removal, such newsrack shall be deemed to be\n   unclaimed property in possession of the Police Department and may be disposed\n   of pursuant to the provisions outlined in the Code of the City of Raleigh. Any\n   newsrack in violation of the provisions of this section, which violation\n   creates an immediate danger to the health, safety or welfare of the public,\n   which violation cannot be corrected by moving or otherwise repositioning the\n   newsrack, may be summarily removed and stored in a secure location so as to\n   eliminate the danger to the health, safety and welfare of the public. The\n   Inspections Department or its designate shall notify the owner as outlined in\n   this section. Every person or other entity which places or maintains a\n   newsrack on a public sidewalk or right-of-way in the City of Raleigh shall\n   file a written statement with the Inspections Department satisfactory to the\n   City Attorney whereby he or it agrees to indemnify and hold harmless the City,\n   its officers, councilmen and employees, from any loss or liability or damage,\n   including expenses and costs, for bodily or personal injury, and for property\n   damage sustained by any person as a result of the installation, use, or\n   maintenance of a newsrack within the City of Raleigh. \n   (Code 1959 , §19-5.1; Ord. No. 1977-472, 3-15-77; Ord. No. 1979-46, 3-20-79;\n   Ord. No. 1984-415, §§1—3, 9-18-84; Ord. No. 1985-639A, §§7—9, 9-17-85;\n   Ord. No. 1987-36, §1, 9-1-87; Ord. No. 1994-521, §1, 12-13-94; Ord. No.\n   1998-454, §19, 11-4-98; Ord. No. 1999-482, §2, 1-5-99; Ord. No. 2006-83,\n   §2, 9-5-06; Ord. No. 2009-641, §§2, 3, 9-1-09)\n"}