{"law_id":"609","section_number":"12-2028","catch_line":"EQUIPMENT; ITEMS REQUIRED.","history":"","order_by":"12-2028","metadata":false,"url":"\/12-2028\/","token":"12-2028","structure":{"1":{"id":"176","name":"ARTICLE B. - VEHICLES FOR HIRE","identifier":"B","label":"article","url":"\/II\/12\/2\/B\/"},"2":{"id":"174","name":"CHAPTER 2. - BUSINESSES AND TRADES","identifier":"2","label":"chapter","url":"\/II\/12\/2\/"},"3":{"id":"169","name":"PART 12 - LICENSING AND REGULATION","identifier":"12","label":"part","url":"\/II\/12\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"referred_to_by":{"0":{"id":"605","section_number":"12-2024","catch_line":"COMPLIANCE WITH ARTICLE; ENFORCEMENT SANCTIONS.","url":"http:\/\/localhost:8888\/12-2024\/"}},"edition_id":"1","section_id":"609","structure_id":"176","full_text":"(a) Shall be equipped with a tell-tale light on top of the taxicab so designed that when the meter is engaged and the parking lights are on, the light goes out and when the vehicle is not engaged the light is burning. The size of the light shall be no less than ten (10) inches across, four (4) inches deep, and four (4) inches high. It is strictly prohibited for any non-metered vehicle for hire to have any form of tell-tale light anywhere on or inside the vehicle. Notwithstanding this restriction, limousines may have a tell-tale light that reads &#8220;Limo&#8221; or &#8220;Limousine.&#8221;\r\r(b) Shall be equipped with a standard speedometer properly installed, maintained in good working order and exposed to view. No taxicab shall be operated in taxicab service while such speedometer is out of repair or disconnected.\r\r(c) Shall be equipped with a heater with a shutoff appliance thereon, sufficient to heat the interior of the cab adequately in cold weather and shall be equipped with an air conditioner with a shutoff appliance thereon, sufficient to cool the interior of the cab adequately in warm weather.\r\r(d) Shall be equipped with a card frame or frames for the proper display of the owner&#8217;s permit and the taxicab driver&#8217;s permit. No vehicle shall be operated without a vehicle decal affixed thereto and issued pursuant to this subsection unless, pursuant to this division, the vehicle is being used as an authorized passenger for hire vehicle.\r\r(e) Shall be equipped with a single-tariff taximeter of a type approved by the Council, inspected for accuracy and installed according to the requirements of the taxicab inspector unless the taxicab is to be used exclusively to provide shared taxi service; provided, no taxicab shall be operated while occupied by a person in addition to the driver with the taximeter not engaged, except when the taxicab is being used to provide shared taxi service. The taximeter shall be attached to and located within the taxicab so as to be in front of the passengers, visible to them at all times, day and night; the face of the taximeter shall be illuminated. The taximeter shall be operated mechanically by a mechanism of standard design and construction, operated either from the transmission or from one of the front wheels of the taxicab by a flexible and permanently attached driving mechanism. \nThe taximeter shall be sealed at all points and connections which, if manipulated, would affect its correct reading and recording. The taximeter on each taxicab shall be subject to inspection from time to time by the taxicab inspector. Any inspector or other officer of the Police Department is hereby authorized, either on complaint of any person or without such complaint, to inspect any taximeter, and upon discovery of any inaccuracy, to notify the owner and person operating the taxicab to cease operation on premium service; thereupon, such taxicab shall not be operated on premium service until the taximeter has been repaired and is in the required working condition, approved by the proper inspecting officer of the City.\r\r(f) Handivans shall be equipped in the same manner as taxicabs as described in items (a) through (e) above. In addition, handivans shall be inspected by a mechanic certified to inspect the handivan equipment to ensure the van is equipped with a wheelchair lift or ramp, properly installed and in good working order, designed to safely move a person confined to a wheelchair into and out of the handivan. The interior of the handivan shall be arranged and outfitted so that a wheelchair can be quickly, easily and safely secured in place without having to remove the chair&#8217;s occupant. Upon semi-annual\/annual inspection, written proof of mechanic&#8217;s inspection is mandatory.\r\r(g) All taxicabs shall be equipped with an amber safety warning light system for driver safety. The safety warning lights shall be approved by the taxicab inspector; and used by the driver only to summon assistance in the event that he\/she has reason to believe that he\/she is being threatened with harm.\r\r(i) Door handles and locks. All doors shall operate easily, shall close securely from both the outside and inside of the vehicle, and shall be accessible to passengers. No devices that restrict the ability of a passenger from readily exiting the vehicle in an emergency are allowed.\r\r(j) No person shall equip, mark, paint, or display marking lights or windshield lights or in any way cause a motor vehicle to resemble a duly licensed taxicab or create a public impression that a motor vehicle is a duly licensed public vehicle approved by the taxicab inspector under the authority of Chapter 12 of the City of Raleigh Taxicab Ordinance.\r\r(k) North Carolina State law requires that all children who are under age eight (8) and under eighty (80) pounds ride in a properly used car seat or booster seat. Children may be moved into a seat belt when they reach age eight (8) or eighty (80) pounds, whichever comes first. If a lap\/shoulder belt is not available for a child who weighs more than forty (40) pounds, a properly fitted lap belt may be used, since booster seats should not be used with lap-only belts. North Carolina State law also requires that car seats be installed in the rear seat if the child is less than five (5) years old and weighs less than forty (40) pounds, and if vehicle has a passenger side airbag and a rear seat, unless the car seat is specifically designed for use with air bags. Children though age sixteen (16) who are not required to be in car seats by weight must wear a seatbelt. No taxicab\/vehicle for hire may transport any passenger(s) eight (8) years old and younger without a car seat or a booster seat per N.C. State law.\r\r(l) No person shall use a public vehicle for an unlawful or immoral purpose. \nWhen such unlawful or immoral use has occurred with the knowledge of the person owning the taxicab or when, within any period of five (5) years, two (2) such convictions have occurred involving the vehicle\/vehicles covered by a given taxicab license, the taxicab inspector shall revoke the taxicab license for the vehicle involved. \nWhen such unlawful or immoral use has occurred with the knowledge of the person driving the taxicab, the taxicab inspector, upon recommendation by the inspector&#8217;s immediate supervisor, after a hearing, shall revoke the taxi driver&#8217;s permit of such person.\r\r(m) Drivers of taxicabs shall not receive or discharge passengers in the roadway, but shall pull up to the sidewalk on the right-hand side of the roadway and there receive or discharge passengers. Drivers may discharge passengers from either side of the roadway on one-way streets. \nNo driver shall park or stop or operate his taxicab in such a manner as to unduly obstruct traffic or to constitute a nuisance to other vehicles and pedestrians. \n(Code 1959 , §22-8; Ord. No. 1980-487, §§10, 11, 10-7-80; Ord. No. 1990-674, §3, 11-6-90; Ord. No. 2009-671, §§11—15, 11-3-09) \nState law reference: Requirements for motor vehicles generally, G.S. 20-115 et seq.\r\r","text":{"0":{"id":"1736","text":"Shall be equipped with a tell-tale light on top of the taxicab so designed that when the meter is engaged and the parking lights are on, the light goes out and when the vehicle is not engaged the light is burning. The size of the light shall be no less than ten (10) inches across, four (4) inches deep, and four (4) inches high. It is strictly prohibited for any non-metered vehicle for hire to have any form of tell-tale light anywhere on or inside the vehicle. Notwithstanding this restriction, limousines may have a tell-tale light that reads &#8220;Limo&#8221; or &#8220;Limousine.&#8221;","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"1737","text":"Shall be equipped with a standard speedometer properly installed, maintained in good working order and exposed to view. No taxicab shall be operated in taxicab service while such speedometer is out of repair or disconnected.","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"2":{"id":"1738","text":"Shall be equipped with a heater with a shutoff appliance thereon, sufficient to heat the interior of the cab adequately in cold weather and shall be equipped with an air conditioner with a shutoff appliance thereon, sufficient to cool the interior of the cab adequately in warm weather.","type":"section","prefixes":["(c)"],"prefix":"(c)","entire_prefix":"(c)","prefix_anchor":"(c)","level":1},"3":{"id":"1739","text":"Shall be equipped with a card frame or frames for the proper display of the owner&#8217;s permit and the taxicab driver&#8217;s permit. No vehicle shall be operated without a vehicle decal affixed thereto and issued pursuant to this subsection unless, pursuant to this division, the vehicle is being used as an authorized passenger for hire vehicle.","type":"section","prefixes":["(d)"],"prefix":"(d)","entire_prefix":"(d)","prefix_anchor":"(d)","level":1},"4":{"id":"1740","text":"Shall be equipped with a single-tariff taximeter of a type approved by the Council, inspected for accuracy and installed according to the requirements of the taxicab inspector unless the taxicab is to be used exclusively to provide shared taxi service; provided, no taxicab shall be operated while occupied by a person in addition to the driver with the taximeter not engaged, except when the taxicab is being used to provide shared taxi service. The taximeter shall be attached to and located within the taxicab so as to be in front of the passengers, visible to them at all times, day and night; the face of the taximeter shall be illuminated. The taximeter shall be operated mechanically by a mechanism of standard design and construction, operated either from the transmission or from one of the front wheels of the taxicab by a flexible and permanently attached driving mechanism. \nThe taximeter shall be sealed at all points and connections which, if manipulated, would affect its correct reading and recording. The taximeter on each taxicab shall be subject to inspection from time to time by the taxicab inspector. Any inspector or other officer of the Police Department is hereby authorized, either on complaint of any person or without such complaint, to inspect any taximeter, and upon discovery of any inaccuracy, to notify the owner and person operating the taxicab to cease operation on premium service; thereupon, such taxicab shall not be operated on premium service until the taximeter has been repaired and is in the required working condition, approved by the proper inspecting officer of the City.","type":"section","prefixes":["(e)"],"prefix":"(e)","entire_prefix":"(e)","prefix_anchor":"(e)","level":1},"5":{"id":"1741","text":"Handivans shall be equipped in the same manner as taxicabs as described in items (a) through (e) above. In addition, handivans shall be inspected by a mechanic certified to inspect the handivan equipment to ensure the van is equipped with a wheelchair lift or ramp, properly installed and in good working order, designed to safely move a person confined to a wheelchair into and out of the handivan. The interior of the handivan shall be arranged and outfitted so that a wheelchair can be quickly, easily and safely secured in place without having to remove the chair&#8217;s occupant. Upon semi-annual\/annual inspection, written proof of mechanic&#8217;s inspection is mandatory.","type":"section","prefixes":["(f)"],"prefix":"(f)","entire_prefix":"(f)","prefix_anchor":"(f)","level":1},"6":{"id":"1742","text":"All taxicabs shall be equipped with an amber safety warning light system for driver safety. The safety warning lights shall be approved by the taxicab inspector; and used by the driver only to summon assistance in the event that he\/she has reason to believe that he\/she is being threatened with harm.","type":"section","prefixes":["(g)"],"prefix":"(g)","entire_prefix":"(g)","prefix_anchor":"(g)","level":1},"7":{"id":"1743","text":"","type":"section","prefixes":["(h)"],"prefix":"(h)","entire_prefix":"(h)","prefix_anchor":"(h)","level":1},"8":{"id":"1744","text":"\tThe taxicab inspector is satisfied with the condition of the passenger vehicle for hire;\n","type":"section","prefixes":["(h)","(1)"],"prefix":"(1)","entire_prefix":"(h)(1)","prefix_anchor":"(h)(1)","level":2},"9":{"id":"1745","text":"\tNo taxicab will be placed into service that is ten (10) years old or older and\/or the mileage exceeds 250,000 unless the vehicle is declared a unique vehicle. Vehicles currently in service that exceed ten (10) years in age and\/or 250,000 in mileage must be approved on an annual basis by the taxicab inspector. A taxicab driver\/owner can appeal the taxi inspector&#8217;s decision about acceptable conditions of a car older than ten (10) years and\/or 250,000 in mileage; \n","type":"section","prefixes":["(h)","(2)"],"prefix":"(2)","entire_prefix":"(h)(2)","prefix_anchor":"(h)(2)","level":2},"10":{"id":"1746","text":"\tIf the taxicab owner\/driver does not agree with the taxicab inspector&#8217;s decision as to not waive the age limit and\/or the mileage on their vehicle, then that owner\/driver has ten (10) days from the date of the decision to file a written appeal to the taxicab inspector&#8217;s immediate supervisor; \n","type":"section","prefixes":["(h)","(3)"],"prefix":"(3)","entire_prefix":"(h)(3)","prefix_anchor":"(h)(3)","level":2},"11":{"id":"1747","text":"\tAll taxicabs shall be clean, operable and in good repair. Trunks in all taxicabs shall be clean and empty except for one spare tire and necessary emergency equipment. \n","type":"section","prefixes":["(h)","(4)"],"prefix":"(4)","entire_prefix":"(h)(4)","prefix_anchor":"(h)(4)","level":2},"12":{"id":"1748","text":"Door handles and locks. All doors shall operate easily, shall close securely from both the outside and inside of the vehicle, and shall be accessible to passengers. No devices that restrict the ability of a passenger from readily exiting the vehicle in an emergency are allowed.","type":"section","prefixes":["(i)"],"prefix":"(i)","entire_prefix":"(i)","prefix_anchor":"(i)","level":1},"13":{"id":"1749","text":"No person shall equip, mark, paint, or display marking lights or windshield lights or in any way cause a motor vehicle to resemble a duly licensed taxicab or create a public impression that a motor vehicle is a duly licensed public vehicle approved by the taxicab inspector under the authority of Chapter 12 of the City of Raleigh Taxicab Ordinance.","type":"section","prefixes":["(j)"],"prefix":"(j)","entire_prefix":"(j)","prefix_anchor":"(j)","level":1},"14":{"id":"1750","text":"North Carolina State law requires that all children who are under age eight (8) and under eighty (80) pounds ride in a properly used car seat or booster seat. Children may be moved into a seat belt when they reach age eight (8) or eighty (80) pounds, whichever comes first. If a lap\/shoulder belt is not available for a child who weighs more than forty (40) pounds, a properly fitted lap belt may be used, since booster seats should not be used with lap-only belts. North Carolina State law also requires that car seats be installed in the rear seat if the child is less than five (5) years old and weighs less than forty (40) pounds, and if vehicle has a passenger side airbag and a rear seat, unless the car seat is specifically designed for use with air bags. Children though age sixteen (16) who are not required to be in car seats by weight must wear a seatbelt. No taxicab\/vehicle for hire may transport any passenger(s) eight (8) years old and younger without a car seat or a booster seat per N.C. State law.","type":"section","prefixes":["(k)"],"prefix":"(k)","entire_prefix":"(k)","prefix_anchor":"(k)","level":1},"15":{"id":"1751","text":"No person shall use a public vehicle for an unlawful or immoral purpose. \nWhen such unlawful or immoral use has occurred with the knowledge of the person owning the taxicab or when, within any period of five (5) years, two (2) such convictions have occurred involving the vehicle\/vehicles covered by a given taxicab license, the taxicab inspector shall revoke the taxicab license for the vehicle involved. \nWhen such unlawful or immoral use has occurred with the knowledge of the person driving the taxicab, the taxicab inspector, upon recommendation by the inspector&#8217;s immediate supervisor, after a hearing, shall revoke the taxi driver&#8217;s permit of such person.","type":"section","prefixes":["(l)"],"prefix":"(l)","entire_prefix":"(l)","prefix_anchor":"(l)","level":1},"16":{"id":"1752","text":"Drivers of taxicabs shall not receive or discharge passengers in the roadway, but shall pull up to the sidewalk on the right-hand side of the roadway and there receive or discharge passengers. Drivers may discharge passengers from either side of the roadway on one-way streets. \nNo driver shall park or stop or operate his taxicab in such a manner as to unduly obstruct traffic or to constitute a nuisance to other vehicles and pedestrians. \n(Code 1959 , §22-8; Ord. No. 1980-487, §§10, 11, 10-7-80; Ord. No. 1990-674, §3, 11-6-90; Ord. No. 2009-671, §§11—15, 11-3-09) \nState law reference: Requirements for motor vehicles generally, G.S. 20-115 et seq.","type":"section","prefixes":["(m)"],"prefix":"(m)","entire_prefix":"(m)","prefix_anchor":"(m)","level":1}},"ancestry":{"1":{"id":"176","name":"ARTICLE B. - VEHICLES FOR HIRE","identifier":"B","label":"article","url":"\/II\/12\/2\/B\/"},"2":{"id":"174","name":"CHAPTER 2. - BUSINESSES AND TRADES","identifier":"2","label":"chapter","url":"\/II\/12\/2\/"},"3":{"id":"169","name":"PART 12 - LICENSING AND REGULATION","identifier":"12","label":"part","url":"\/II\/12\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"601","structure_id":"176","section_number":"12-2021","catch_line":"SHORT TITLE.","url":"\/12-2021\/","token":"12-2021"},"1":{"id":"602","structure_id":"176","section_number":"12-2022","catch_line":"DEFINITIONS.","url":"\/12-2022\/","token":"12-2022"},"2":{"id":"604","structure_id":"176","section_number":"12-2023","catch_line":"TAXICAB INSPECTOR; OFFICE CREATED; DUTIES GENERALLY.","url":"\/12-2023\/","token":"12-2023"},"3":{"id":"605","structure_id":"176","section_number":"12-2024","catch_line":"COMPLIANCE WITH ARTICLE; ENFORCEMENT SANCTIONS.","url":"\/12-2024\/","token":"12-2024"},"4":{"id":"606","structure_id":"176","section_number":"12-2025","catch_line":"INSURANCE.","url":"\/12-2025\/","token":"12-2025"},"5":{"id":"607","structure_id":"176","section_number":"12-2026","catch_line":"OWNER INFORMATION FILE.","url":"\/12-2026\/","token":"12-2026"},"6":{"id":"608","structure_id":"176","section_number":"12-2027","catch_line":"TYPE OF TAXICAB.","url":"\/12-2027\/","token":"12-2027"},"7":{"id":"609","structure_id":"176","section_number":"12-2028","catch_line":"EQUIPMENT; ITEMS REQUIRED.","url":"\/12-2028\/","token":"12-2028"},"8":{"id":"610","structure_id":"176","section_number":"12-2029","catch_line":"FILING DESCRIPTION.","url":"\/12-2029\/","token":"12-2029"},"9":{"id":"611","structure_id":"176","section_number":"12-2030","catch_line":"IDENTIFICATION OF VEHICLES.","url":"\/12-2030\/","token":"12-2030"},"10":{"id":"612","structure_id":"176","section_number":"12-2031","catch_line":"CONDITION OF VEHICLE; INSPECTION.","url":"\/12-2031\/","token":"12-2031"},"11":{"id":"613","structure_id":"176","section_number":"12-2032","catch_line":"MAINTENANCE.","url":"\/12-2032\/","token":"12-2032"},"12":{"id":"615","structure_id":"176","section_number":"12-2033","catch_line":"SANITATION.","url":"\/12-2033\/","token":"12-2033"},"13":{"id":"616","structure_id":"176","section_number":"12-2034","catch_line":"DRIVERS' MANIFESTS.","url":"\/12-2034\/","token":"12-2034"},"14":{"id":"617","structure_id":"176","section_number":"12-2035","catch_line":"ACCEPTING ADDITIONAL PASSENGERS.","url":"\/12-2035\/","token":"12-2035"},"15":{"id":"618","structure_id":"176","section_number":"12-2036","catch_line":"RESTRICTION ON NUMBER OF PASSENGERS.","url":"\/12-2036\/","token":"12-2036"},"16":{"id":"619","structure_id":"176","section_number":"12-2037","catch_line":"REFUSAL TO CARRY ORDERLY PASSENGERS.","url":"\/12-2037\/","token":"12-2037"},"17":{"id":"620","structure_id":"176","section_number":"12-2038","catch_line":"DECEPTION OF PASSENGERS.","url":"\/12-2038\/","token":"12-2038"},"18":{"id":"621","structure_id":"176","section_number":"12-2039","catch_line":"COMPLIANCE WITH PASSENGERS' REQUESTS.","url":"\/12-2039\/","token":"12-2039"},"19":{"id":"622","structure_id":"176","section_number":"12-2040","catch_line":"USE OF TOBACCO.","url":"\/12-2040\/","token":"12-2040"},"20":{"id":"623","structure_id":"176","section_number":"12-2041","catch_line":"LOST ARTICLES.","url":"\/12-2041\/","token":"12-2041"},"21":{"id":"624","structure_id":"176","section_number":"12-2042","catch_line":"ATTENDING VEHICLE BY DRIVER.","url":"\/12-2042\/","token":"12-2042"},"22":{"id":"626","structure_id":"176","section_number":"12-2043","catch_line":"FARES; SCHEDULE.","url":"\/12-2043\/","token":"12-2043"},"23":{"id":"627","structure_id":"176","section_number":"12-2044","catch_line":"HIRING WITH INTENT NOT TO PAY.","url":"\/12-2044\/","token":"12-2044"},"24":{"id":"628","structure_id":"176","section_number":"12-2045","catch_line":"FURNISHING RECEIPT.","url":"\/12-2045\/","token":"12-2045"},"25":{"id":"629","structure_id":"176","section_number":"12-2046","catch_line":"RATE CARD; ISSUANCE, POSTING, COMPLYING WITH.","url":"\/12-2046\/","token":"12-2046"},"26":{"id":"630","structure_id":"176","section_number":"12-2047","catch_line":"TAXI INSPECTOR'S HOURS.","url":"\/12-2047\/","token":"12-2047"},"27":{"id":"631","structure_id":"176","section_number":"12-2048","catch_line":"RESERVED.","url":"\/12-2048\/","token":"12-2048"},"28":{"id":"632","structure_id":"176","section_number":"12-2048","catch_line":"RESERVED. ","url":"\/12-2048\/","token":"12-2048"},"29":{"id":"633","structure_id":"176","section_number":"12-2051","catch_line":"REQUIRED.","url":"\/12-2051\/","token":"12-2051"},"30":{"id":"634","structure_id":"176","section_number":"12-2052","catch_line":"APPLICATION.","url":"\/12-2052\/","token":"12-2052"},"31":{"id":"635","structure_id":"176","section_number":"12-2053","catch_line":"ISSUANCE.","url":"\/12-2053\/","token":"12-2053"},"32":{"id":"637","structure_id":"176","section_number":"12-2054","catch_line":"FORM.","url":"\/12-2054\/","token":"12-2054"},"33":{"id":"638","structure_id":"176","section_number":"12-2055","catch_line":"EXPIRATION.","url":"\/12-2055\/","token":"12-2055"},"34":{"id":"639","structure_id":"176","section_number":"12-2056","catch_line":"PERMIT ISSUANCE, RENEWAL REQUIREMENT; EXCEPTIONS.","url":"\/12-2056\/","token":"12-2056"},"35":{"id":"640","structure_id":"176","section_number":"12-2057","catch_line":"ASSIGNMENT OR TRANSFER.","url":"\/12-2057\/","token":"12-2057"},"36":{"id":"641","structure_id":"176","section_number":"12-2058","catch_line":"ISSUANCE OF MEMORANDUM PERMIT.","url":"\/12-2058\/","token":"12-2058"},"37":{"id":"642","structure_id":"176","section_number":"12-2059","catch_line":"REVOCATION UPON CHANGE OF OWNERSHIP; ISSUANCE TO NEW OWNER.","url":"\/12-2059\/","token":"12-2059"},"38":{"id":"643","structure_id":"176","section_number":"12-2060","catch_line":"SUSPENSION AND REVOCATION; CAUSES, HEARING.","url":"\/12-2060\/","token":"12-2060"},"39":{"id":"644","structure_id":"176","section_number":"12-2061","catch_line":"SURRENDER OF PERMIT; RETIRING VEHICLES FROM SERVICE.","url":"\/12-2061\/","token":"12-2061"},"40":{"id":"645","structure_id":"176","section_number":"12-2062","catch_line":"RESERVED.","url":"\/12-2062\/","token":"12-2062"},"41":{"id":"646","structure_id":"176","section_number":"12-2062","catch_line":"RESERVED. ","url":"\/12-2062\/","token":"12-2062"},"42":{"id":"648","structure_id":"176","section_number":"12-2071","catch_line":"PARTICIPATION REQUIREMENTS.","url":"\/12-2071\/","token":"12-2071"},"43":{"id":"649","structure_id":"176","section_number":"12-2072","catch_line":"DETERMINATION OF ELIGIBILITY.","url":"\/12-2072\/","token":"12-2072"},"44":{"id":"650","structure_id":"176","section_number":"12-2073","catch_line":"REDEMPTION OF SCRIP.","url":"\/12-2073\/","token":"12-2073"},"45":{"id":"651","structure_id":"176","section_number":"12-2074","catch_line":"PENALTIES.","url":"\/12-2074\/","token":"12-2074"},"46":{"id":"652","structure_id":"176","section_number":"12-2075","catch_line":"RESERVED.","url":"\/12-2075\/","token":"12-2075"},"47":{"id":"653","structure_id":"176","section_number":"12-2081","catch_line":"REQUIRED.","url":"\/12-2081\/","token":"12-2081"},"48":{"id":"654","structure_id":"176","section_number":"12-2082","catch_line":"APPLICATION.","url":"\/12-2082\/","token":"12-2082"},"49":{"id":"655","structure_id":"176","section_number":"12-2083","catch_line":"PROBATIONARY DRIVER'S PERMIT.","url":"\/12-2083\/","token":"12-2083"},"50":{"id":"656","structure_id":"176","section_number":"12-2084","catch_line":"EXAMINATION AND INVESTIGATION.","url":"\/12-2084\/","token":"12-2084"},"51":{"id":"657","structure_id":"176","section_number":"12-2085","catch_line":"QUALIFICATIONS.","url":"\/12-2085\/","token":"12-2085"},"52":{"id":"659","structure_id":"176","section_number":"12-2086","catch_line":"REFUSAL TO ISSUE.","url":"\/12-2086\/","token":"12-2086"},"53":{"id":"660","structure_id":"176","section_number":"12-2087","catch_line":"APPEAL FROM REFUSAL.","url":"\/12-2087\/","token":"12-2087"},"54":{"id":"661","structure_id":"176","section_number":"12-2088","catch_line":"GRANTING.","url":"\/12-2088\/","token":"12-2088"},"55":{"id":"662","structure_id":"176","section_number":"12-2089","catch_line":"CONTENTS AND EFFECT.","url":"\/12-2089\/","token":"12-2089"},"56":{"id":"663","structure_id":"176","section_number":"12-2090","catch_line":"SAFETY PERMIT.","url":"\/12-2090\/","token":"12-2090"},"57":{"id":"664","structure_id":"176","section_number":"12-2091","catch_line":"REVOCATION.","url":"\/12-2091\/","token":"12-2091"},"58":{"id":"665","structure_id":"176","section_number":"12-2092","catch_line":"SURRENDER, DISPLAY, LOSS, ETC., OF DRIVER'S PERMIT.","url":"\/12-2092\/","token":"12-2092"},"59":{"id":"666","structure_id":"176","section_number":"12-2093","catch_line":"EXPIRATION, RENEWAL.","url":"\/12-2093\/","token":"12-2093"},"60":{"id":"667","structure_id":"176","section_number":"12-2094","catch_line":"RESERVED.","url":"\/12-2094\/","token":"12-2094"},"61":{"id":"668","structure_id":"176","section_number":"12-2094","catch_line":"RESERVED. ","url":"\/12-2094\/","token":"12-2094"}},"previous_section":{"id":"608","structure_id":"176","section_number":"12-2027","catch_line":"TYPE OF TAXICAB.","url":"\/12-2027\/","token":"12-2027"},"next_section":{"id":"610","structure_id":"176","section_number":"12-2029","catch_line":"FILING DESCRIPTION.","url":"\/12-2029\/","token":"12-2029"},"references":false,"formats":{"txt":"\/12-2028.txt","json":"\/12-2028.xml"},"dublin_core":{"Title":"EQUIPMENT; ITEMS REQUIRED.","Type":"Text","Format":"text\/html","Identifier":"§ 12-2028","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nEQUIPMENT; ITEMS REQUIRED. (§ 12-2028)\n\n(a) Shall be equipped with a tell-tale light on top of the taxicab so designed\nthat when the meter is engaged and the parking lights are on, the light goes out\nand when the vehicle is not engaged the light is burning. The size of the light\nshall be no less than ten (10) inches across, four (4) inches deep, and four (4)\ninches high. It is strictly prohibited for any non-metered vehicle for hire to\nhave any form of tell-tale light anywhere on or inside the vehicle.\nNotwithstanding this restriction, limousines may have a tell-tale light that\nreads &#8220;Limo&#8221; or &#8220;Limousine.&#8221;\n\n(b) Shall be equipped with a standard speedometer properly installed, maintained\nin good working order and exposed to view. No taxicab shall be operated in\ntaxicab service while such speedometer is out of repair or disconnected.\n\n(c) Shall be equipped with a heater with a shutoff appliance thereon, sufficient\nto heat the interior of the cab adequately in cold weather and shall be equipped\nwith an air conditioner with a shutoff appliance thereon, sufficient to cool the\ninterior of the cab adequately in warm weather.\n\n(d) Shall be equipped with a card frame or frames for the proper display of the\nowner&#8217;s permit and the taxicab driver&#8217;s permit. No vehicle shall be\noperated without a vehicle decal affixed thereto and issued pursuant to this\nsubsection unless, pursuant to this division, the vehicle is being used as an\nauthorized passenger for hire vehicle.\n\n(e) Shall be equipped with a single-tariff taximeter of a type approved by the\nCouncil, inspected for accuracy and installed according to the requirements of\nthe taxicab inspector unless the taxicab is to be used exclusively to provide\nshared taxi service; provided, no taxicab shall be operated while occupied by a\nperson in addition to the driver with the taximeter not engaged, except when the\ntaxicab is being used to provide shared taxi service. The taximeter shall be\nattached to and located within the taxicab so as to be in front of the\npassengers, visible to them at all times, day and night; the face of the\ntaximeter shall be illuminated. The taximeter shall be operated mechanically by\na mechanism of standard design and construction, operated either from the\ntransmission or from one of the front wheels of the taxicab by a flexible and\npermanently attached driving mechanism. \nThe taximeter shall be sealed at all points and connections which, if\nmanipulated, would affect its correct reading and recording. The taximeter on\neach taxicab shall be subject to inspection from time to time by the taxicab\ninspector. Any inspector or other officer of the Police Department is hereby\nauthorized, either on complaint of any person or without such complaint, to\ninspect any taximeter, and upon discovery of any inaccuracy, to notify the owner\nand person operating the taxicab to cease operation on premium service;\nthereupon, such taxicab shall not be operated on premium service until the\ntaximeter has been repaired and is in the required working condition, approved\nby the proper inspecting officer of the City.\n\n(f) Handivans shall be equipped in the same manner as taxicabs as described in\nitems (a) through (e) above. In addition, handivans shall be inspected by a\nmechanic certified to inspect the handivan equipment to ensure the van is\nequipped with a wheelchair lift or ramp, properly installed and in good working\norder, designed to safely move a person confined to a wheelchair into and out of\nthe handivan. The interior of the handivan shall be arranged and outfitted so\nthat a wheelchair can be quickly, easily and safely secured in place without\nhaving to remove the chair&#8217;s occupant. Upon semi-annual\/annual inspection,\nwritten proof of mechanic&#8217;s inspection is mandatory.\n\n(g) All taxicabs shall be equipped with an amber safety warning light system for\ndriver safety. The safety warning lights shall be approved by the taxicab\ninspector; and used by the driver only to summon assistance in the event that\nhe\/she has reason to believe that he\/she is being threatened with harm.\n\n(h) \n\n   (1) \tThe taxicab inspector is satisfied with the condition of the passenger\n   vehicle for hire;\n   \n\n   (2) \tNo taxicab will be placed into service that is ten (10) years old or\n   older and\/or the mileage exceeds 250,000 unless the vehicle is declared a\n   unique vehicle. Vehicles currently in service that exceed ten (10) years in\n   age and\/or 250,000 in mileage must be approved on an annual basis by the\n   taxicab inspector. A taxicab driver\/owner can appeal the taxi\n   inspector&#8217;s decision about acceptable conditions of a car older than ten\n   (10) years and\/or 250,000 in mileage; \n   \n\n   (3) \tIf the taxicab owner\/driver does not agree with the taxicab\n   inspector&#8217;s decision as to not waive the age limit and\/or the mileage on\n   their vehicle, then that owner\/driver has ten (10) days from the date of the\n   decision to file a written appeal to the taxicab inspector&#8217;s immediate\n   supervisor; \n   \n\n   (4) \tAll taxicabs shall be clean, operable and in good repair. Trunks in all\n   taxicabs shall be clean and empty except for one spare tire and necessary\n   emergency equipment. \n   \n\n(i) Door handles and locks. All doors shall operate easily, shall close securely\nfrom both the outside and inside of the vehicle, and shall be accessible to\npassengers. No devices that restrict the ability of a passenger from readily\nexiting the vehicle in an emergency are allowed.\n\n(j) No person shall equip, mark, paint, or display marking lights or windshield\nlights or in any way cause a motor vehicle to resemble a duly licensed taxicab\nor create a public impression that a motor vehicle is a duly licensed public\nvehicle approved by the taxicab inspector under the authority of Chapter 12 of\nthe City of Raleigh Taxicab Ordinance.\n\n(k) North Carolina State law requires that all children who are under age eight\n(8) and under eighty (80) pounds ride in a properly used car seat or booster\nseat. Children may be moved into a seat belt when they reach age eight (8) or\neighty (80) pounds, whichever comes first. If a lap\/shoulder belt is not\navailable for a child who weighs more than forty (40) pounds, a properly fitted\nlap belt may be used, since booster seats should not be used with lap-only\nbelts. North Carolina State law also requires that car seats be installed in the\nrear seat if the child is less than five (5) years old and weighs less than\nforty (40) pounds, and if vehicle has a passenger side airbag and a rear seat,\nunless the car seat is specifically designed for use with air bags. Children\nthough age sixteen (16) who are not required to be in car seats by weight must\nwear a seatbelt. No taxicab\/vehicle for hire may transport any passenger(s)\neight (8) years old and younger without a car seat or a booster seat per N.C.\nState law.\n\n(l) No person shall use a public vehicle for an unlawful or immoral purpose. \nWhen such unlawful or immoral use has occurred with the knowledge of the person\nowning the taxicab or when, within any period of five (5) years, two (2) such\nconvictions have occurred involving the vehicle\/vehicles covered by a given\ntaxicab license, the taxicab inspector shall revoke the taxicab license for the\nvehicle involved. \nWhen such unlawful or immoral use has occurred with the knowledge of the person\ndriving the taxicab, the taxicab inspector, upon recommendation by the\ninspector&#8217;s immediate supervisor, after a hearing, shall revoke the taxi\ndriver&#8217;s permit of such person.\n\n(m) Drivers of taxicabs shall not receive or discharge passengers in the\nroadway, but shall pull up to the sidewalk on the right-hand side of the roadway\nand there receive or discharge passengers. Drivers may discharge passengers from\neither side of the roadway on one-way streets. \nNo driver shall park or stop or operate his taxicab in such a manner as to\nunduly obstruct traffic or to constitute a nuisance to other vehicles and\npedestrians. \n(Code 1959 , §22-8; Ord. No. 1980-487, §§10, 11, 10-7-80; Ord. No. 1990-674,\n§3, 11-6-90; Ord. No. 2009-671, §§11—15, 11-3-09) \nState law reference: Requirements for motor vehicles generally, G.S. 20-115 et\nseq.\n"}