{"law_id":"720","section_number":"12-2166","catch_line":"COMPLIANCE WITH PROVISIONS.","history":"","order_by":"12-2166","metadata":false,"url":"\/12-2166\/","token":"12-2166","structure":{"1":{"id":"181","name":"ARTICLE G. - PROBATIONARY RENTAL OCCUPANCY PERMIT [8]","identifier":"G","label":"article","url":"\/II\/12\/2\/G\/"},"2":{"id":"174","name":"CHAPTER 2. - BUSINESSES AND TRADES","identifier":"2","label":"chapter","url":"\/II\/12\/2\/"},"3":{"id":"169","name":"PART 12 - LICENSING AND REGULATION","identifier":"12","label":"part","url":"\/II\/12\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"referred_to_by":{"0":{"id":"718","section_number":"12-2164","catch_line":"PERMITTING OF PROBATIONARY RENTAL RESIDENTIAL DWELLINGS.","url":"http:\/\/localhost:8888\/12-2164\/"},"1":{"id":"721","section_number":"12-2167","catch_line":"ENFORCEMENT.","url":"http:\/\/localhost:8888\/12-2167\/"}},"edition_id":"1","section_id":"720","structure_id":"181","full_text":"(a) Any person required by this article to have a permit for a probationary rental residential dwelling who files a complete application for any required permit within ten (10) days following notice from the Inspections Department that this article applies to the dwelling shall be deemed compliant with this article unless and until the application is denied.\r\r(b) It shall be unlawful to rent, to receive rental income from, or to offer for rent a dwelling subject to the permit requirements of this article beginning ten (10) days after service of notice by the Inspections Department that a permit is required under this part unless a complete application for a §12-2164(a) permit has been submitted for the dwelling.\r\r(c) Any person who holds a N.C. Gen. Stat. 105-41(a)(8) or (9) privilege license as a rental agency and is not the record owner of the probationary rental residential dwelling shall be deemed compliant with this article upon filing with the Inspections Department an affidavit or other notarized statement that the agency relationship has been terminated and that the failure to comply with the noticed violations was caused by the record owner&#8217;s refusal to comply with the article.\r\r(d) Any person who has been designated as a process service agent and is not the record owner of the probationary rental residential dwelling shall be deemed compliant with this article upon promptly notifying the Inspections Department that the notice or order delivered for service cannot be delivered to the owner and upon filing with the Inspections Department an affidavit or other notarized statement that the agency relationship has been terminated and that all prior notices and orders were delivered to the owner.\r\r(e) If the activities, violations or abatements which individually or cumulatively could cause a property or dwelling to be deemed a probationary rental residential dwelling under §12-2163(l) are the result of tenant behavior or actions, an owner shall be entitled to relief from any such violation(s) [i.e. the violation(s) shall not be counted as a strike against the owner] by evicting or removing the tenant, so long as the owner can show that the tenant behavior or action is the basis of the eviction or removal of the tenant. No owner may obtain relief for more than two (2) violations in any three (3) year period per dwelling under this subsection. Any owner who evicted or removed the tenant as a result of the tenant causing such violation(s), whether such removal is the result of a tenant voluntarily vacating the dwelling or as a result of court action, shall be deemed compliant with this Article upon filing with the Inspections Department an affidavit or other notarized statement stating that (1) the tenant cited for the violation no longer resides at the dwelling, or (2) the attached complaint was filed to evict the tenant and listing the actions showing diligence in effecting the eviction and attaching a copy of the signed lease with the required right to evict. An owner shall also be entitled to relief from any subsequent violation(s) that occur while the action to evict the tenant is pending upon a similar showing to the Inspections Department. \nIf the court has denied the owner&#8217;s diligent pursuit to evict the tenant, it shall be sufficient if the owner does not renew the tenant&#8217;s lease at the end of the then current term and instead terminates the lease. \nWhen an owner shows an inability to access to dwelling for purposes of effecting remedial activity as ordered by the Inspections Department pursuant to §10-6058 or §10-6137 due to a court order in an eviction proceeding, the failure to complete the required remedial activity as previously ordered by the Inspections Department is not a violation for purposes of determining whether the dwelling is a probationary rental residential dwelling until thirty (30) days after the expiration of the court order barring access or within such additional time for compliance as is provided by the Inspections Department.\r\r(f) Any mortgagee of record, not otherwise defined as an owner, shall be deemed compliant with this article unless and until the other owners of the probationary rental residential dwelling fail to comply with notices of violations or orders, including for the payment of civil penalties. A mortgagee of record, not otherwise defined as an owner, shall not be liable for civil penalties or administrative fees in excess of the liability of the other owners. \n(Ord. No. 2004-720, §1, 10-19-04; Ord. No. 2006-54, §§10, 14, 15, 7-11-06)\r\r","text":{"0":{"id":"2160","text":"Any person required by this article to have a permit for a probationary rental residential dwelling who files a complete application for any required permit within ten (10) days following notice from the Inspections Department that this article applies to the dwelling shall be deemed compliant with this article unless and until the application is denied.","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"2161","text":"It shall be unlawful to rent, to receive rental income from, or to offer for rent a dwelling subject to the permit requirements of this article beginning ten (10) days after service of notice by the Inspections Department that a permit is required under this part unless a complete application for a §12-2164(a) permit has been submitted for the dwelling.","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"2":{"id":"2162","text":"Any person who holds a N.C. Gen. Stat. 105-41(a)(8) or (9) privilege license as a rental agency and is not the record owner of the probationary rental residential dwelling shall be deemed compliant with this article upon filing with the Inspections Department an affidavit or other notarized statement that the agency relationship has been terminated and that the failure to comply with the noticed violations was caused by the record owner&#8217;s refusal to comply with the article.","type":"section","prefixes":["(c)"],"prefix":"(c)","entire_prefix":"(c)","prefix_anchor":"(c)","level":1},"3":{"id":"2163","text":"Any person who has been designated as a process service agent and is not the record owner of the probationary rental residential dwelling shall be deemed compliant with this article upon promptly notifying the Inspections Department that the notice or order delivered for service cannot be delivered to the owner and upon filing with the Inspections Department an affidavit or other notarized statement that the agency relationship has been terminated and that all prior notices and orders were delivered to the owner.","type":"section","prefixes":["(d)"],"prefix":"(d)","entire_prefix":"(d)","prefix_anchor":"(d)","level":1},"4":{"id":"2164","text":"If the activities, violations or abatements which individually or cumulatively could cause a property or dwelling to be deemed a probationary rental residential dwelling under §12-2163(l) are the result of tenant behavior or actions, an owner shall be entitled to relief from any such violation(s) [i.e. the violation(s) shall not be counted as a strike against the owner] by evicting or removing the tenant, so long as the owner can show that the tenant behavior or action is the basis of the eviction or removal of the tenant. No owner may obtain relief for more than two (2) violations in any three (3) year period per dwelling under this subsection. Any owner who evicted or removed the tenant as a result of the tenant causing such violation(s), whether such removal is the result of a tenant voluntarily vacating the dwelling or as a result of court action, shall be deemed compliant with this Article upon filing with the Inspections Department an affidavit or other notarized statement stating that (1) the tenant cited for the violation no longer resides at the dwelling, or (2) the attached complaint was filed to evict the tenant and listing the actions showing diligence in effecting the eviction and attaching a copy of the signed lease with the required right to evict. An owner shall also be entitled to relief from any subsequent violation(s) that occur while the action to evict the tenant is pending upon a similar showing to the Inspections Department. \nIf the court has denied the owner&#8217;s diligent pursuit to evict the tenant, it shall be sufficient if the owner does not renew the tenant&#8217;s lease at the end of the then current term and instead terminates the lease. \nWhen an owner shows an inability to access to dwelling for purposes of effecting remedial activity as ordered by the Inspections Department pursuant to §10-6058 or §10-6137 due to a court order in an eviction proceeding, the failure to complete the required remedial activity as previously ordered by the Inspections Department is not a violation for purposes of determining whether the dwelling is a probationary rental residential dwelling until thirty (30) days after the expiration of the court order barring access or within such additional time for compliance as is provided by the Inspections Department.","type":"section","prefixes":["(e)"],"prefix":"(e)","entire_prefix":"(e)","prefix_anchor":"(e)","level":1},"5":{"id":"2165","text":"Any mortgagee of record, not otherwise defined as an owner, shall be deemed compliant with this article unless and until the other owners of the probationary rental residential dwelling fail to comply with notices of violations or orders, including for the payment of civil penalties. A mortgagee of record, not otherwise defined as an owner, shall not be liable for civil penalties or administrative fees in excess of the liability of the other owners. \n(Ord. No. 2004-720, §1, 10-19-04; Ord. No. 2006-54, §§10, 14, 15, 7-11-06)","type":"section","prefixes":["(f)"],"prefix":"(f)","entire_prefix":"(f)","prefix_anchor":"(f)","level":1}},"ancestry":{"1":{"id":"181","name":"ARTICLE G. - PROBATIONARY RENTAL OCCUPANCY PERMIT [8]","identifier":"G","label":"article","url":"\/II\/12\/2\/G\/"},"2":{"id":"174","name":"CHAPTER 2. - BUSINESSES AND TRADES","identifier":"2","label":"chapter","url":"\/II\/12\/2\/"},"3":{"id":"169","name":"PART 12 - LICENSING AND REGULATION","identifier":"12","label":"part","url":"\/II\/12\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"716","structure_id":"181","section_number":"12-2162","catch_line":"FINDINGS AND DECLARATION OF NECESSITY.","url":"\/12-2162\/","token":"12-2162"},"1":{"id":"717","structure_id":"181","section_number":"12-2163","catch_line":"DEFINITIONS.","url":"\/12-2163\/","token":"12-2163"},"2":{"id":"718","structure_id":"181","section_number":"12-2164","catch_line":"PERMITTING OF PROBATIONARY RENTAL RESIDENTIAL DWELLINGS.","url":"\/12-2164\/","token":"12-2164"},"3":{"id":"719","structure_id":"181","section_number":"12-2165","catch_line":"STANDARDS.","url":"\/12-2165\/","token":"12-2165"},"4":{"id":"720","structure_id":"181","section_number":"12-2166","catch_line":"COMPLIANCE WITH PROVISIONS.","url":"\/12-2166\/","token":"12-2166"},"5":{"id":"721","structure_id":"181","section_number":"12-2167","catch_line":"ENFORCEMENT.","url":"\/12-2167\/","token":"12-2167"},"6":{"id":"722","structure_id":"181","section_number":"12-2168","catch_line":"APPEAL.","url":"\/12-2168\/","token":"12-2168"},"7":{"id":"723","structure_id":"181","section_number":"12-2169","catch_line":"ADMINISTRATIVE FEE AND ARBITRATION FEE.","url":"\/12-2169\/","token":"12-2169"},"8":{"id":"724","structure_id":"181","section_number":"12-2170","catch_line":"METHODS OF SERVICE.","url":"\/12-2170\/","token":"12-2170"},"9":{"id":"726","structure_id":"181","section_number":"12-2171","catch_line":"RELATION TO OTHER LAWS.","url":"\/12-2171\/","token":"12-2171"},"10":{"id":"727","structure_id":"181","section_number":"12-2172","catch_line":"RESERVED.","url":"\/12-2172\/","token":"12-2172"}},"previous_section":{"id":"719","structure_id":"181","section_number":"12-2165","catch_line":"STANDARDS.","url":"\/12-2165\/","token":"12-2165"},"next_section":{"id":"721","structure_id":"181","section_number":"12-2167","catch_line":"ENFORCEMENT.","url":"\/12-2167\/","token":"12-2167"},"references":{"0":{"id":"718","section_number":"12-2164","catch_line":"PERMITTING OF PROBATIONARY RENTAL RESIDENTIAL DWELLINGS.","url":"http:\/\/localhost:8888\/12-2164\/"}},"formats":{"txt":"\/12-2166.txt","json":"\/12-2166.xml"},"dublin_core":{"Title":"COMPLIANCE WITH PROVISIONS.","Type":"Text","Format":"text\/html","Identifier":"§ 12-2166","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nCOMPLIANCE WITH PROVISIONS. (§ 12-2166)\n\n(a) Any person required by this article to have a permit for a probationary\nrental residential dwelling who files a complete application for any required\npermit within ten (10) days following notice from the Inspections Department\nthat this article applies to the dwelling shall be deemed compliant with this\narticle unless and until the application is denied.\n\n(b) It shall be unlawful to rent, to receive rental income from, or to offer for\nrent a dwelling subject to the permit requirements of this article beginning ten\n(10) days after service of notice by the Inspections Department that a permit is\nrequired under this part unless a complete application for a §12-2164(a) permit\nhas been submitted for the dwelling.\n\n(c) Any person who holds a N.C. Gen. Stat. 105-41(a)(8) or (9) privilege license\nas a rental agency and is not the record owner of the probationary rental\nresidential dwelling shall be deemed compliant with this article upon filing\nwith the Inspections Department an affidavit or other notarized statement that\nthe agency relationship has been terminated and that the failure to comply with\nthe noticed violations was caused by the record owner&#8217;s refusal to comply\nwith the article.\n\n(d) Any person who has been designated as a process service agent and is not the\nrecord owner of the probationary rental residential dwelling shall be deemed\ncompliant with this article upon promptly notifying the Inspections Department\nthat the notice or order delivered for service cannot be delivered to the owner\nand upon filing with the Inspections Department an affidavit or other notarized\nstatement that the agency relationship has been terminated and that all prior\nnotices and orders were delivered to the owner.\n\n(e) If the activities, violations or abatements which individually or\ncumulatively could cause a property or dwelling to be deemed a probationary\nrental residential dwelling under §12-2163(l) are the result of tenant behavior\nor actions, an owner shall be entitled to relief from any such violation(s)\n[i.e. the violation(s) shall not be counted as a strike against the owner] by\nevicting or removing the tenant, so long as the owner can show that the tenant\nbehavior or action is the basis of the eviction or removal of the tenant. No\nowner may obtain relief for more than two (2) violations in any three (3) year\nperiod per dwelling under this subsection. Any owner who evicted or removed the\ntenant as a result of the tenant causing such violation(s), whether such removal\nis the result of a tenant voluntarily vacating the dwelling or as a result of\ncourt action, shall be deemed compliant with this Article upon filing with the\nInspections Department an affidavit or other notarized statement stating that\n(1) the tenant cited for the violation no longer resides at the dwelling, or (2)\nthe attached complaint was filed to evict the tenant and listing the actions\nshowing diligence in effecting the eviction and attaching a copy of the signed\nlease with the required right to evict. An owner shall also be entitled to\nrelief from any subsequent violation(s) that occur while the action to evict the\ntenant is pending upon a similar showing to the Inspections Department. \nIf the court has denied the owner&#8217;s diligent pursuit to evict the tenant,\nit shall be sufficient if the owner does not renew the tenant&#8217;s lease at\nthe end of the then current term and instead terminates the lease. \nWhen an owner shows an inability to access to dwelling for purposes of effecting\nremedial activity as ordered by the Inspections Department pursuant to §10-6058\nor §10-6137 due to a court order in an eviction proceeding, the failure to\ncomplete the required remedial activity as previously ordered by the Inspections\nDepartment is not a violation for purposes of determining whether the dwelling\nis a probationary rental residential dwelling until thirty (30) days after the\nexpiration of the court order barring access or within such additional time for\ncompliance as is provided by the Inspections Department.\n\n(f) Any mortgagee of record, not otherwise defined as an owner, shall be deemed\ncompliant with this article unless and until the other owners of the\nprobationary rental residential dwelling fail to comply with notices of\nviolations or orders, including for the payment of civil penalties. A mortgagee\nof record, not otherwise defined as an owner, shall not be liable for civil\npenalties or administrative fees in excess of the liability of the other owners.\n\n(Ord. No. 2004-720, §1, 10-19-04; Ord. No. 2006-54, §§10, 14, 15, 7-11-06)\n"}