{"law_id":"87","section_number":"5-2040","catch_line":"KEY BOX SYSTEM.","history":"","order_by":"5-2040","metadata":false,"url":"\/5-2040\/","token":"5-2040","structure":{"1":{"id":"43","name":"ARTICLE B. - FIRE PREVENTION [1]","identifier":"B","label":"article","url":"\/II\/5\/2\/B\/"},"2":{"id":"41","name":"CHAPTER 2. - FIRE PROTECTION AND PREVENTION","identifier":"2","label":"chapter","url":"\/II\/5\/2\/"},"3":{"id":"34","name":"PART 5 - PUBLIC SAFETY","identifier":"5","label":"part","url":"\/II\/5\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"referred_to_by":{"0":{"id":"88","section_number":"5-2041","catch_line":"INSPECTIONS FOR EXISTING BUILDINGS.","url":"http:\/\/localhost:8888\/5-2041\/"}},"edition_id":"1","section_id":"87","structure_id":"43","full_text":"(a) Requirements. \nAll commercial enterprises or industries in the City of Raleigh which use, store or manufacture on-site toxic or hazardous materials that must be reported with regulated materials under Title III of the Federal Superfund Amendments and Reauthorization Act (SARA), 42 USC 11001 et seq., Clean Air Act Amendment 112, Chapter 95 Article 18 of the North Carolina General Statutes and the regulations promulgated there under, must have an approved on-site hazardous materials data storage\/key box system at each facility where hazardous materials may be found. This requirement shall ensure consistency at all facilities storing hazardous materials so that responders can quickly locate, access, and utilize information located in the data storage\/key box system. \nAll facilities having a system that transmits an off-site alarm for fire detection and\/or fire suppression systems shall have an approved on-site key box system (consisting of a data storage box and when required a Hazardous Material Data Storage Cabinet) which contains keys to provide fire department access in an emergency or alarm activation.\r\r","text":{"0":{"id":"166","text":"Requirements. \nAll commercial enterprises or industries in the City of Raleigh which use, store or manufacture on-site toxic or hazardous materials that must be reported with regulated materials under Title III of the Federal Superfund Amendments and Reauthorization Act (SARA), 42 USC 11001 et seq., Clean Air Act Amendment 112, Chapter 95 Article 18 of the North Carolina General Statutes and the regulations promulgated there under, must have an approved on-site hazardous materials data storage\/key box system at each facility where hazardous materials may be found. This requirement shall ensure consistency at all facilities storing hazardous materials so that responders can quickly locate, access, and utilize information located in the data storage\/key box system. \nAll facilities having a system that transmits an off-site alarm for fire detection and\/or fire suppression systems shall have an approved on-site key box system (consisting of a data storage box and when required a Hazardous Material Data Storage Cabinet) which contains keys to provide fire department access in an emergency or alarm activation.","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"167","text":"","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"2":{"id":"168","text":"\tThe data storage box shall contain keys providing access to all secured areas of the facility and may also serve as the required facility key box required by state and local fire codes. The data storage box shall contain current, specific information needed to assist fire departments and hazardous materials teams responding to emergencies at the facility. This information includes but is not limited to, facility maps or plans showing the type, name and location of hazardous materials, SARA Tier II forms, lists of chemicals, with Chemical Abstracts Service (CAS) numbers that are required to be reported on SARA Tier II forms, 24 hour emergency telephone numbers for essential facility employees and other persons to be contacted in case of emergencies. \n","type":"section","prefixes":["(b)","(1)"],"prefix":"(1)","entire_prefix":"(b)(1)","prefix_anchor":"(b)(1)","level":2},"3":{"id":"169","text":"\tThe data storage box shall contain the Site Specific Hazardous Chemical Plan\/Hazardous Materials Management Plan, specifically in the Wake County and City of Raleigh format. This form shall be updated annually, or more often as necessary, to ensure accuracy. \n","type":"section","prefixes":["(b)","(2)"],"prefix":"(2)","entire_prefix":"(b)(2)","prefix_anchor":"(b)(2)","level":2},"4":{"id":"170","text":"\tThe data storage box itself shall be of the type designated and approved by an Office of the Fire Marshal staff member and the Wake County Local Emergency Planning Committee and shall be located at the primary vehicular entrance, outside any security fence that may be surrounding the facility and visible and accessible to emergency responders. If the facility staffs a security control checkpoint, the data storage box may be located at the security checkpoint, but located outside any surrounding security fence, and shall be visible and accessible to all emergency responders. The data storage box may be mounted to a post or other stand alone structure, so long as the above criteria are met. The data storage box may be mounted to a structure that is located outside the secured perimeter, but shall not be mounted to the exterior wall of the facility or inside the facility housing the hazardous materials. \n","type":"section","prefixes":["(b)","(3)"],"prefix":"(3)","entire_prefix":"(b)(3)","prefix_anchor":"(b)(3)","level":2},"5":{"id":"171","text":"\tFacilities may apply for a site specific variance for the location of the Hazardous Materials Data Storage Cabinet to Wake County Emergency Management, Hazardous Material Planner. It is at the discretion of Wake County Emergency Management whether to approve or deny the request. If an alternated location is approved, the Wake County Emergency Management, Hazardous Material Planner will notify the Fire Marshal as to its location. \n","type":"section","prefixes":["(b)","(4)"],"prefix":"(4)","entire_prefix":"(b)(4)","prefix_anchor":"(b)(4)","level":2},"6":{"id":"172","text":"\tThe type and model key box system required shall be The Knox Company and based on the criteria listed below: \na.\tBuildings with less than five stories: Model 3200.\nb.\tHazardous Materials Facility with site specific plans per Wake County LEPC: Data Storage Cabinet.\nc.\tBuildings of five or more stories: Data Storage Cabinet.\nThe Fire Marshal may approve other data storage boxes and Hazardous Material Data Cabinets which are equivalent to those listed herein. \n(Ord. No. 2011-873-TC-344, §1, TC-6-11, 5-3-11) \nState law references: Identification of Toxic or Hazardous Substances, Chapter 95 Article 18 of the North Carolina General Statutes; Fire Prevention Code; Civil preparedness functions under State Department of Crime Control and Public Safety, G.S. §143B-475; Continuity of local government in emergency, G.S. Chapter 162B; Emergency management, G.S. Chapter 166A. \n","type":"section","prefixes":["(b)","(5)"],"prefix":"(5)","entire_prefix":"(b)(5)","prefix_anchor":"(b)(5)","level":2}},"ancestry":{"1":{"id":"43","name":"ARTICLE B. - FIRE PREVENTION [1]","identifier":"B","label":"article","url":"\/II\/5\/2\/B\/"},"2":{"id":"41","name":"CHAPTER 2. - FIRE PROTECTION AND PREVENTION","identifier":"2","label":"chapter","url":"\/II\/5\/2\/"},"3":{"id":"34","name":"PART 5 - PUBLIC SAFETY","identifier":"5","label":"part","url":"\/II\/5\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"77","structure_id":"43","section_number":"5-2031","catch_line":"TITLE AND INTENT.","url":"\/5-2031\/","token":"5-2031"},"1":{"id":"78","structure_id":"43","section_number":"5-2032","catch_line":"FIRE PREVENTION CODE ADOPTED.","url":"\/5-2032\/","token":"5-2032"},"2":{"id":"79","structure_id":"43","section_number":"5-2033","catch_line":"JURISDICTION.","url":"\/5-2033\/","token":"5-2033"},"3":{"id":"80","structure_id":"43","section_number":"5-2034","catch_line":"RESPONSIBILITY FOR ENFORCEMENT; FIRE PREVENTION BUREAU.","url":"\/5-2034\/","token":"5-2034"},"4":{"id":"82","structure_id":"43","section_number":"5-2035","catch_line":"PRIMARY AND SECONDARY FIRE DISTRICTS.","url":"\/5-2035\/","token":"5-2035"},"5":{"id":"83","structure_id":"43","section_number":"5-2036","catch_line":"ELECTRIC SERVICE ENTRANCES IN FIRE DISTRICTS.","url":"\/5-2036\/","token":"5-2036"},"6":{"id":"84","structure_id":"43","section_number":"5-2037","catch_line":"FLAMMABLE LIQUIDS STORAGE; RESTRICTIONS ON LOCATION.","url":"\/5-2037\/","token":"5-2037"},"7":{"id":"85","structure_id":"43","section_number":"5-2038","catch_line":"REGULATION OF LIQUID PROPANE GAS TANKS.","url":"\/5-2038\/","token":"5-2038"},"8":{"id":"86","structure_id":"43","section_number":"5-2039","catch_line":"ISSUANCE OF BLASTING PERMITS; REQUIREMENTS.","url":"\/5-2039\/","token":"5-2039"},"9":{"id":"87","structure_id":"43","section_number":"5-2040","catch_line":"KEY BOX SYSTEM.","url":"\/5-2040\/","token":"5-2040"},"10":{"id":"88","structure_id":"43","section_number":"5-2041","catch_line":"INSPECTIONS FOR EXISTING BUILDINGS.","url":"\/5-2041\/","token":"5-2041"},"11":{"id":"89","structure_id":"43","section_number":"5-2042","catch_line":"OPERATIONAL PERMITS AND FEES.","url":"\/5-2042\/","token":"5-2042"},"12":{"id":"90","structure_id":"43","section_number":"5-2043","catch_line":"NEW CONSTRUCTION INSPECTION, PERMITS AND FEES.","url":"\/5-2043\/","token":"5-2043"},"13":{"id":"91","structure_id":"43","section_number":"5-2044","catch_line":"FIRE FINAL INSPECTIONS.","url":"\/5-2044\/","token":"5-2044"},"14":{"id":"93","structure_id":"43","section_number":"5-2045","catch_line":"SMOKE DETECTORS REQUIRED.","url":"\/5-2045\/","token":"5-2045"},"15":{"id":"94","structure_id":"43","section_number":"5-2046","catch_line":"NEW MATERIALS; TESTING AND APPROVAL.","url":"\/5-2046\/","token":"5-2046"},"16":{"id":"95","structure_id":"43","section_number":"5-2047","catch_line":"OVERSIGHT NOT TO LEGALIZE VIOLATION.","url":"\/5-2047\/","token":"5-2047"},"17":{"id":"96","structure_id":"43","section_number":"5-2048","catch_line":"PENALTIES FOR VIOLATIONS OF FIRE PREVENTION CODE.","url":"\/5-2048\/","token":"5-2048"}},"previous_section":{"id":"86","structure_id":"43","section_number":"5-2039","catch_line":"ISSUANCE OF BLASTING PERMITS; REQUIREMENTS.","url":"\/5-2039\/","token":"5-2039"},"next_section":{"id":"88","structure_id":"43","section_number":"5-2041","catch_line":"INSPECTIONS FOR EXISTING BUILDINGS.","url":"\/5-2041\/","token":"5-2041"},"references":false,"formats":{"txt":"\/5-2040.txt","json":"\/5-2040.xml"},"dublin_core":{"Title":"KEY BOX SYSTEM.","Type":"Text","Format":"text\/html","Identifier":"§ 5-2040","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nKEY BOX SYSTEM. (§ 5-2040)\n\n(a) Requirements. \nAll commercial enterprises or industries in the City of Raleigh which use, store\nor manufacture on-site toxic or hazardous materials that must be reported with\nregulated materials under Title III of the Federal Superfund Amendments and\nReauthorization Act (SARA), 42 USC 11001 et seq., Clean Air Act Amendment 112,\nChapter 95 Article 18 of the North Carolina General Statutes and the regulations\npromulgated there under, must have an approved on-site hazardous materials data\nstorage\/key box system at each facility where hazardous materials may be found.\nThis requirement shall ensure consistency at all facilities storing hazardous\nmaterials so that responders can quickly locate, access, and utilize information\nlocated in the data storage\/key box system. \nAll facilities having a system that transmits an off-site alarm for fire\ndetection and\/or fire suppression systems shall have an approved on-site key box\nsystem (consisting of a data storage box and when required a Hazardous Material\nData Storage Cabinet) which contains keys to provide fire department access in\nan emergency or alarm activation.\n\n(b) \n\n   (1) \tThe data storage box shall contain keys providing access to all secured\n   areas of the facility and may also serve as the required facility key box\n   required by state and local fire codes. The data storage box shall contain\n   current, specific information needed to assist fire departments and hazardous\n   materials teams responding to emergencies at the facility. This information\n   includes but is not limited to, facility maps or plans showing the type, name\n   and location of hazardous materials, SARA Tier II forms, lists of chemicals,\n   with Chemical Abstracts Service (CAS) numbers that are required to be reported\n   on SARA Tier II forms, 24 hour emergency telephone numbers for essential\n   facility employees and other persons to be contacted in case of emergencies. \n   \n\n   (2) \tThe data storage box shall contain the Site Specific Hazardous Chemical\n   Plan\/Hazardous Materials Management Plan, specifically in the Wake County and\n   City of Raleigh format. This form shall be updated annually, or more often as\n   necessary, to ensure accuracy. \n   \n\n   (3) \tThe data storage box itself shall be of the type designated and approved\n   by an Office of the Fire Marshal staff member and the Wake County Local\n   Emergency Planning Committee and shall be located at the primary vehicular\n   entrance, outside any security fence that may be surrounding the facility and\n   visible and accessible to emergency responders. If the facility staffs a\n   security control checkpoint, the data storage box may be located at the\n   security checkpoint, but located outside any surrounding security fence, and\n   shall be visible and accessible to all emergency responders. The data storage\n   box may be mounted to a post or other stand alone structure, so long as the\n   above criteria are met. The data storage box may be mounted to a structure\n   that is located outside the secured perimeter, but shall not be mounted to the\n   exterior wall of the facility or inside the facility housing the hazardous\n   materials. \n   \n\n   (4) \tFacilities may apply for a site specific variance for the location of the\n   Hazardous Materials Data Storage Cabinet to Wake County Emergency Management,\n   Hazardous Material Planner. It is at the discretion of Wake County Emergency\n   Management whether to approve or deny the request. If an alternated location\n   is approved, the Wake County Emergency Management, Hazardous Material Planner\n   will notify the Fire Marshal as to its location. \n   \n\n   (5) \tThe type and model key box system required shall be The Knox Company and\n   based on the criteria listed below: \n   a.\tBuildings with less than five stories: Model 3200.\n   b.\tHazardous Materials Facility with site specific plans per Wake County LEPC:\n   Data Storage Cabinet.\n   c.\tBuildings of five or more stories: Data Storage Cabinet.\n   The Fire Marshal may approve other data storage boxes and Hazardous Material\n   Data Cabinets which are equivalent to those listed herein. \n   (Ord. No. 2011-873-TC-344, §1, TC-6-11, 5-3-11) \n   State law references: Identification of Toxic or Hazardous Substances, Chapter\n   95 Article 18 of the North Carolina General Statutes; Fire Prevention Code;\n   Civil preparedness functions under State Department of Crime Control and\n   Public Safety, G.S. §143B-475; Continuity of local government in emergency,\n   G.S. Chapter 162B; Emergency management, G.S. Chapter 166A.\n"}