{"law_id":"139","edition_id":"1","section_id":"139","structure_id":"70","section_number":"6-2021","catch_line":"STREET ASSESSMENT CHARGES.","history":"","full_text":"","order_by":"6-2021","text":{"0":{"id":"441","text":"","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"442","text":"\tGrading. \nThe entire cost of grading up to and including the width required for an improvement thirty-one (31) feet (9.45 meters) or less in width shall be paid for by the abutting property. The cost of grading in excess of street widths greater than thirty-one (31) feet (9.45 meters) shall be paid for by the City. \n","type":"section","prefixes":["(a)","(1)"],"prefix":"(1)","entire_prefix":"(a)(1)","prefix_anchor":"(a)(1)","level":2},"2":{"id":"443","text":"\tStreet widths. \nThe entire cost of the base and surface course up to and including the width required for an improvement thirty-one (31) feet (9.45 meters) or less in width shall be paid for by the abutting property. The cost of the base and surface course in excess of street widths greater than thirty-one (31) feet (9.45 meters) shall be paid for by the City. \n","type":"section","prefixes":["(a)","(2)"],"prefix":"(2)","entire_prefix":"(a)(2)","prefix_anchor":"(a)(2)","level":2},"3":{"id":"444","text":"\tSurface thickness. \nThe entire cost of the surface thickness up to and including the width required for an improvement thirty-one (31) feet (9.45 meters) or less shall be paid for by the abutting property. The cost of surface thickness in excess of street widths greater than thirty-one (31) feet (9.45 meters) shall be paid for by the City. \n","type":"section","prefixes":["(a)","(3)"],"prefix":"(3)","entire_prefix":"(a)(3)","prefix_anchor":"(a)(3)","level":2},"4":{"id":"445","text":"\tBase thickness. \nThe entire cost of the base thickness up to and including the width required for an improvement thirty-one (31) feet (9.45 meters) or less in width shall be paid for by the abutting property. The cost of base thickness in excess of street widths greater than thirty-one (31) feet (9.45 meters) shall be paid for by the City. \n","type":"section","prefixes":["(a)","(4)"],"prefix":"(4)","entire_prefix":"(a)(4)","prefix_anchor":"(a)(4)","level":2},"5":{"id":"446","text":"\tNotwithstanding the provisions of subsections (a)(1) through (a)(4) above, the maximum total cost of improvements to be paid for by any abutting property which is zoned a residential district by the zoning ordinances of the City shall be thirty-two dollars ($32.00) per abutting property front foot. The maximum unit costs stated herein do not include sidewalk improvements or other particular items of cost ordinarily assessed against the property such as utility improvements, removal of encroachments, driveway improvements in excess of one sixteen-foot driveway, and other incidentals applicable to a particular piece of property and not to the project as a whole. \n","type":"section","prefixes":["(a)","(5)"],"prefix":"(5)","entire_prefix":"(a)(5)","prefix_anchor":"(a)(5)","level":2},"6":{"id":"447","text":"","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"7":{"id":"448","text":"\tGrading. \nThe entire cost of grading up to and including the width required for an improvement forty-one (41) feet (12.50 meters) in width shall be paid for by the abutting property. The cost of grading in excess of street widths greater than forty-one (41) feet (12.50 meters) shall be paid for by the City. \n","type":"section","prefixes":["(b)","(1)"],"prefix":"(1)","entire_prefix":"(b)(1)","prefix_anchor":"(b)(1)","level":2},"8":{"id":"449","text":"\tStreet widths. \nThe entire cost of the base and surface course up to and including the width required for an improvement forty-one (41) feet (12.50 meters) in width shall be paid for by the abutting property. The cost of base and surface course in excess of street widths greater than forty-one (41) feet (12.50 meters) shall be paid for by the City. \n","type":"section","prefixes":["(b)","(2)"],"prefix":"(2)","entire_prefix":"(b)(2)","prefix_anchor":"(b)(2)","level":2},"9":{"id":"450","text":"\tSurface thickness. \nThe entire cost of the surface thickness up to and including the width required for an improvement forty-one (41) feet (12.50 meters) in width shall be paid for by the abutting property. The cost of surface thickness in excess of street widths greater than forty-one (41) feet (12.50 meters) shall be paid for by the City. \n","type":"section","prefixes":["(b)","(3)"],"prefix":"(3)","entire_prefix":"(b)(3)","prefix_anchor":"(b)(3)","level":2},"10":{"id":"451","text":"\tBase thickness. \nThe entire cost of the base thickness up to and including the width required for an improvement forty-one (41) feet (12.50 meters) in width shall be paid for by the abutting property. The cost of base thickness in excess of street widths greater than forty-one (41) feet (12.50 meters) shall be paid for by the City. \n","type":"section","prefixes":["(b)","(4)"],"prefix":"(4)","entire_prefix":"(b)(4)","prefix_anchor":"(b)(4)","level":2},"11":{"id":"452","text":"\tNotwithstanding the provisions of subsections (b)(1) through (b)(4) above, the maximum total cost of improvements to be paid for by any abutting property which is zoned for a district other than a residential district by the zoning ordinances of the City shall be sixty-four dollars ($64.00) per abutting property front foot. The maximum unit cost stated herein does not include the sidewalk improvements or other particular items of cost ordinarily assessed against the property such as utility improvements, removal of encroachments, driveway improvements in excess of one sixteen-foot driveway, and other incidentals applicable to a particular piece of property and not to the project as a whole. \n","type":"section","prefixes":["(b)","(5)"],"prefix":"(5)","entire_prefix":"(b)(5)","prefix_anchor":"(b)(5)","level":2},"12":{"id":"453","text":"","type":"section","prefixes":["(c)"],"prefix":"(c)","entire_prefix":"(c)","prefix_anchor":"(c)","level":1},"13":{"id":"454","text":"\tThe maximum total cost of residential street improvements to be paid for any abutting property shall be thirty-two dollars ($32.00) per abutting property front foot. The maximum unit costs stated herein do not include sidewalk improvements or other particular items of cost ordinarily assessed against the property such as utility improvements, removal of encroachments, driveway improvements in excess of one twelve-foot driveway, and other incidentals applicable to a particular piece of property and not to the project as a whole. \n","type":"section","prefixes":["(c)","(1)"],"prefix":"(1)","entire_prefix":"(c)(1)","prefix_anchor":"(c)(1)","level":2},"14":{"id":"455","text":"\tIn addition to any other costs borne by the City, the City shall bear the following costs: \na.\tThe cost of regrading an already improved residential street, when the City has determined that regrading of an already improved residential street is necessary or desirable; or \nb.\tThe cost of replacing that portion of a residential street, already improved, when in widening a residential street, it becomes necessary to replace the existing improved portion of the street. \n","type":"section","prefixes":["(c)","(2)"],"prefix":"(2)","entire_prefix":"(c)(2)","prefix_anchor":"(c)(2)","level":2},"15":{"id":"456","text":"","type":"section","prefixes":["(d)"],"prefix":"(d)","entire_prefix":"(d)","prefix_anchor":"(d)","level":1},"16":{"id":"457","text":"\tIf street improvements are made simultaneously to both streets on which a lot abuts, assessment of the costs of the installations shall be based upon the entire frontage of one street (short side) plus the frontage of the other street in excess of one hundred fifty (150) feet. \n","type":"section","prefixes":["(d)","(1)"],"prefix":"(1)","entire_prefix":"(d)(1)","prefix_anchor":"(d)(1)","level":2},"17":{"id":"458","text":"\tIf the lot is already served by a street which meets all City standards, any improvements to another abutting street shall be assessed against the lot owner to the extent that the frontage to be assessed exceeds one hundred fifty (150) feet in length. \n","type":"section","prefixes":["(d)","(2)"],"prefix":"(2)","entire_prefix":"(d)(2)","prefix_anchor":"(d)(2)","level":2},"18":{"id":"459","text":"\tIf a lot fronts on an existing street which meets City standards and abuts at the rear on another street to be built or improved, no assessment shall be made if it shall appear that no reasonable subdivision of the lot can be made by which the new arrangement of lots will benefit from the new or improved street. \n","type":"section","prefixes":["(d)","(3)"],"prefix":"(3)","entire_prefix":"(d)(3)","prefix_anchor":"(d)(3)","level":2},"19":{"id":"460","text":"\tIf a lot abuts on a street or road to be built or improved but physical or topographic restrictions prevent reasonable access thereto from the lot, then no assessment shall be made. In the event that such a lot later gains access formerly thought impossible to the street which was improved, no driveway permit shall be issued until the lot owner has paid a fee equivalent to the amount the lot would have been previously assessed. \n","type":"section","prefixes":["(d)","(4)"],"prefix":"(4)","entire_prefix":"(d)(4)","prefix_anchor":"(d)(4)","level":2},"20":{"id":"461","text":"\tStreet improvements within redevelopment areas as delineated pursuant to G.S. 160A-500 et seq. provided the cost of such work is exclusively paid from community development funds. \n(Ord. No. 1982-5, §§2—4, 10-19-82; Ord. No. 1986-855, §1, 9-16-86; Ord. No. 1987-54A, §1, 9-15-87; Ord. No. 1989-293A, §1, 12-3-88; Ord. No. 1992-999, §§1, 2, 6-16-92; Ord. No. 1995-660, §§1, 2, 6-20-95; Ord. No. 1995-760-TC-122, §§7—9, TC-20C-95, 11-21-95; Ord. No. 2000-905, §§1—3, 12-5-00; Ord. No. 2001-67, §§1, 2, 9-4-01) \nEditor&#8217;s note: Section 4 of Ord. No. 1987-54A, adopted Sept. 15, 1987, provided that &#8220;All petitions for street improvements which are received by the City of Raleigh prior to the first day of October, and which are determined to be sufficient as required by 6-2003(b), shall be assessed at the assessment rate prevailing on the date the petition is received by the engineering department. For City Council initiated street improvements, the assessment rate prevailing on the date the City Council adopted a resolution of intent shall be the assessment rate for that street improvement.&#8221; \n","type":"section","prefixes":["(d)","(5)"],"prefix":"(5)","entire_prefix":"(d)(5)","prefix_anchor":"(d)(5)","level":2}},"ancestry":{"1":{"id":"70","name":"ARTICLE C. - ASSESSMENT CHARGES","identifier":"C","label":"article","url":"\/II\/6\/2\/C\/"},"2":{"id":"67","name":"CHAPTER 2. - STREET AND SIDEWALK IMPROVEMENTS [1]","identifier":"2","label":"chapter","url":"\/II\/6\/2\/"},"3":{"id":"63","name":"PART 6 - CENTRAL ENGINEERING","identifier":"6","label":"part","url":"\/II\/6\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"139","structure_id":"70","section_number":"6-2021","catch_line":"STREET ASSESSMENT CHARGES.","url":"\/6-2021\/","token":"6-2021"},"1":{"id":"140","structure_id":"70","section_number":"6-2022","catch_line":"SIDEWALK ASSESSMENTS FOR CONSTRUCTING OR EXTENDING NEW SIDEWALKS.","url":"\/6-2022\/","token":"6-2022"},"2":{"id":"141","structure_id":"70","section_number":"6-2023","catch_line":"ASSESSMENT FOR REPAIRING, RECONSTRUCTING, AND OTHERWISE IMPROVING EXISTING SIDEWALKS, DRIVEWAYS, CURBS, GUTTERS, OR DRAINS.","url":"\/6-2023\/","token":"6-2023"},"3":{"id":"142","structure_id":"70","section_number":"6-2024","catch_line":"ASSESSMENT FOR RESURFACING EXISTING PAVED STREETS.","url":"\/6-2024\/","token":"6-2024"},"4":{"id":"143","structure_id":"70","section_number":"6-2025","catch_line":"PAYMENT OF ASSESSMENTS.","url":"\/6-2025\/","token":"6-2025"},"5":{"id":"144","structure_id":"70","section_number":"6-2026","catch_line":"RESERVED.","url":"\/6-2026\/","token":"6-2026"},"6":{"id":"145","structure_id":"70","section_number":"6-2026","catch_line":"RESERVED. ","url":"\/6-2026\/","token":"6-2026"}},"next_section":{"id":"140","structure_id":"70","section_number":"6-2022","catch_line":"SIDEWALK ASSESSMENTS FOR CONSTRUCTING OR EXTENDING NEW SIDEWALKS.","url":"\/6-2022\/","token":"6-2022"},"metadata":false,"references":{"0":{"id":"124","section_number":"6-2004","catch_line":"LIMITATION OF PETITIONS.","url":"http:\/\/localhost:8888\/6-2004\/"}},"url":"\/6-2021\/","token":"6-2021","formats":{"txt":"\/6-2021.txt","json":"\/6-2021.xml"},"dublin_core":{"Title":"STREET ASSESSMENT CHARGES.","Type":"Text","Format":"text\/html","Identifier":"§ 6-2021","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nSTREET ASSESSMENT CHARGES. (§ 6-2021)\n\n(a) \n\n   (1) \tGrading. \n   The entire cost of grading up to and including the width required for an\n   improvement thirty-one (31) feet (9.45 meters) or less in width shall be paid\n   for by the abutting property. The cost of grading in excess of street widths\n   greater than thirty-one (31) feet (9.45 meters) shall be paid for by the City.\n   \n   \n\n   (2) \tStreet widths. \n   The entire cost of the base and surface course up to and including the width\n   required for an improvement thirty-one (31) feet (9.45 meters) or less in\n   width shall be paid for by the abutting property. The cost of the base and\n   surface course in excess of street widths greater than thirty-one (31) feet\n   (9.45 meters) shall be paid for by the City. \n   \n\n   (3) \tSurface thickness. \n   The entire cost of the surface thickness up to and including the width\n   required for an improvement thirty-one (31) feet (9.45 meters) or less shall\n   be paid for by the abutting property. The cost of surface thickness in excess\n   of street widths greater than thirty-one (31) feet (9.45 meters) shall be paid\n   for by the City. \n   \n\n   (4) \tBase thickness. \n   The entire cost of the base thickness up to and including the width required\n   for an improvement thirty-one (31) feet (9.45 meters) or less in width shall\n   be paid for by the abutting property. The cost of base thickness in excess of\n   street widths greater than thirty-one (31) feet (9.45 meters) shall be paid\n   for by the City. \n   \n\n   (5) \tNotwithstanding the provisions of subsections (a)(1) through (a)(4)\n   above, the maximum total cost of improvements to be paid for by any abutting\n   property which is zoned a residential district by the zoning ordinances of the\n   City shall be thirty-two dollars ($32.00) per abutting property front foot.\n   The maximum unit costs stated herein do not include sidewalk improvements or\n   other particular items of cost ordinarily assessed against the property such\n   as utility improvements, removal of encroachments, driveway improvements in\n   excess of one sixteen-foot driveway, and other incidentals applicable to a\n   particular piece of property and not to the project as a whole. \n   \n\n(b) \n\n   (1) \tGrading. \n   The entire cost of grading up to and including the width required for an\n   improvement forty-one (41) feet (12.50 meters) in width shall be paid for by\n   the abutting property. The cost of grading in excess of street widths greater\n   than forty-one (41) feet (12.50 meters) shall be paid for by the City. \n   \n\n   (2) \tStreet widths. \n   The entire cost of the base and surface course up to and including the width\n   required for an improvement forty-one (41) feet (12.50 meters) in width shall\n   be paid for by the abutting property. The cost of base and surface course in\n   excess of street widths greater than forty-one (41) feet (12.50 meters) shall\n   be paid for by the City. \n   \n\n   (3) \tSurface thickness. \n   The entire cost of the surface thickness up to and including the width\n   required for an improvement forty-one (41) feet (12.50 meters) in width shall\n   be paid for by the abutting property. The cost of surface thickness in excess\n   of street widths greater than forty-one (41) feet (12.50 meters) shall be paid\n   for by the City. \n   \n\n   (4) \tBase thickness. \n   The entire cost of the base thickness up to and including the width required\n   for an improvement forty-one (41) feet (12.50 meters) in width shall be paid\n   for by the abutting property. The cost of base thickness in excess of street\n   widths greater than forty-one (41) feet (12.50 meters) shall be paid for by\n   the City. \n   \n\n   (5) \tNotwithstanding the provisions of subsections (b)(1) through (b)(4)\n   above, the maximum total cost of improvements to be paid for by any abutting\n   property which is zoned for a district other than a residential district by\n   the zoning ordinances of the City shall be sixty-four dollars ($64.00) per\n   abutting property front foot. The maximum unit cost stated herein does not\n   include the sidewalk improvements or other particular items of cost ordinarily\n   assessed against the property such as utility improvements, removal of\n   encroachments, driveway improvements in excess of one sixteen-foot driveway,\n   and other incidentals applicable to a particular piece of property and not to\n   the project as a whole. \n   \n\n(c) \n\n   (1) \tThe maximum total cost of residential street improvements to be paid for\n   any abutting property shall be thirty-two dollars ($32.00) per abutting\n   property front foot. The maximum unit costs stated herein do not include\n   sidewalk improvements or other particular items of cost ordinarily assessed\n   against the property such as utility improvements, removal of encroachments,\n   driveway improvements in excess of one twelve-foot driveway, and other\n   incidentals applicable to a particular piece of property and not to the\n   project as a whole. \n   \n\n   (2) \tIn addition to any other costs borne by the City, the City shall bear the\n   following costs: \n   a.\tThe cost of regrading an already improved residential street, when the City\n   has determined that regrading of an already improved residential street is\n   necessary or desirable; or \n   b.\tThe cost of replacing that portion of a residential street, already\n   improved, when in widening a residential street, it becomes necessary to\n   replace the existing improved portion of the street. \n   \n\n(d) \n\n   (1) \tIf street improvements are made simultaneously to both streets on which a\n   lot abuts, assessment of the costs of the installations shall be based upon\n   the entire frontage of one street (short side) plus the frontage of the other\n   street in excess of one hundred fifty (150) feet. \n   \n\n   (2) \tIf the lot is already served by a street which meets all City standards,\n   any improvements to another abutting street shall be assessed against the lot\n   owner to the extent that the frontage to be assessed exceeds one hundred fifty\n   (150) feet in length. \n   \n\n   (3) \tIf a lot fronts on an existing street which meets City standards and\n   abuts at the rear on another street to be built or improved, no assessment\n   shall be made if it shall appear that no reasonable subdivision of the lot can\n   be made by which the new arrangement of lots will benefit from the new or\n   improved street. \n   \n\n   (4) \tIf a lot abuts on a street or road to be built or improved but physical\n   or topographic restrictions prevent reasonable access thereto from the lot,\n   then no assessment shall be made. In the event that such a lot later gains\n   access formerly thought impossible to the street which was improved, no\n   driveway permit shall be issued until the lot owner has paid a fee equivalent\n   to the amount the lot would have been previously assessed. \n   \n\n   (5) \tStreet improvements within redevelopment areas as delineated pursuant to\n   G.S. 160A-500 et seq. provided the cost of such work is exclusively paid from\n   community development funds. \n   (Ord. No. 1982-5, §§2—4, 10-19-82; Ord. No. 1986-855, §1, 9-16-86; Ord.\n   No. 1987-54A, §1, 9-15-87; Ord. No. 1989-293A, §1, 12-3-88; Ord. No.\n   1992-999, §§1, 2, 6-16-92; Ord. No. 1995-660, §§1, 2, 6-20-95; Ord. No.\n   1995-760-TC-122, §§7—9, TC-20C-95, 11-21-95; Ord. No. 2000-905, §§1—3,\n   12-5-00; Ord. No. 2001-67, §§1, 2, 9-4-01) \n   Editor&#8217;s note: Section 4 of Ord. No. 1987-54A, adopted Sept. 15, 1987,\n   provided that &#8220;All petitions for street improvements which are received\n   by the City of Raleigh prior to the first day of October, and which are\n   determined to be sufficient as required by 6-2003(b), shall be assessed at the\n   assessment rate prevailing on the date the petition is received by the\n   engineering department. For City Council initiated street improvements, the\n   assessment rate prevailing on the date the City Council adopted a resolution\n   of intent shall be the assessment rate for that street improvement.&#8221;\n"}