{"law_id":"912","section_number":"7-2005","catch_line":"PRECOLLECTION PRACTICES; REMOVAL OF RUBBISH, WEEDS, AND OTHER REFUSE.","history":"","order_by":"7-2005","metadata":false,"url":"\/7-2005\/","token":"7-2005","structure":{"1":{"id":"295","name":"ARTICLE B. - ADMINISTRATION AND ENFORCEMENT","identifier":"B","label":"article","url":"\/II\/7\/2\/B\/"},"2":{"id":"293","name":"CHAPTER 2. - SOLID WASTE COLLECTION [2]","identifier":"2","label":"chapter","url":"\/II\/7\/2\/"},"3":{"id":"289","name":"PART 7 - SOLID WASTE SERVICES [1]","identifier":"7","label":"part","url":"\/II\/7\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"referred_to_by":false,"edition_id":"1","section_id":"912","structure_id":"295","full_text":"(e) Tree trimmings. \nTree trimmings, hedge cuttings, grass, hay or other similar materials not prepared and handled in conformity with the provisions of this section will be removed, at the request of the owner or occupant of property used for residential purposes, at a cost of forty dollars ($40.00) as of July 1, 2003. The Solid Waste Services Director will determine which type of service will be used to remove the materials.\r\r","text":{"0":{"id":"2691","text":"","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"2692","text":"\tGarbage shall be deposited promptly in refuse containers and must be stored within the container at all times. Garbage located outside the container will not be collected. \n","type":"section","prefixes":["(a)","(1)"],"prefix":"(1)","entire_prefix":"(a)(1)","prefix_anchor":"(a)(1)","level":2},"2":{"id":"2693","text":"\tAny person desiring to place tree trimmings, hedge cuttings, or similar materials for collection shall cause the same to be securely tied in bundles not heavier than seventy-five (75) pounds nor more than five (5) feet in length and eighteen (18) inches in diameter. He shall place the same for collection at the curb line at the street on the area between the sidewalk and the curb. Any number of such bundles may be so placed and collected during any collection period. All tree trimmings, hedge cuttings, or similar materials (yard waste), not prepared as described above, shall be placed in plastic permanent type containers no larger than fifty-five (55) gallons, other permanent type containers no larger than thirty-five (35) gallons, or clear plastic bags or biodegradable paper yard waste bags, each type of container not to exceed seventy-five (75) pounds in gross weight. \n","type":"section","prefixes":["(a)","(2)"],"prefix":"(2)","entire_prefix":"(a)(2)","prefix_anchor":"(a)(2)","level":2},"3":{"id":"2694","text":"\tNo person shall burn leaves, shrubs, tree limbs, and the like on the streets or sidewalks or on private property except upon special permission of the Chief of the Fire Department. \n","type":"section","prefixes":["(a)","(3)"],"prefix":"(3)","entire_prefix":"(a)(3)","prefix_anchor":"(a)(3)","level":2},"4":{"id":"2695","text":"\tBuilding rubbish shall be collected, removed, and disposed of by the contractor or builder, or in event of their failure by the owner of the property, in accordance with applicable provisions of this code and with regulations not in conflict therewith promulgated by the City Manager. \n","type":"section","prefixes":["(a)","(4)"],"prefix":"(4)","entire_prefix":"(a)(4)","prefix_anchor":"(a)(4)","level":2},"5":{"id":"2696","text":"","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"6":{"id":"2697","text":"\tAll refuse containers shall conform to the standards described in the Solid Waste Collection Design Manual, as amended, on file in the City Clerk&#8217;s Office and must be fully compatible with the City&#8217;s collection equipment. \n","type":"section","prefixes":["(b)","(1)"],"prefix":"(1)","entire_prefix":"(b)(1)","prefix_anchor":"(b)(1)","level":2},"7":{"id":"2698","text":"\tDwellings eligible for individual unit collection will be provided one (1) ninety-six (96) gallon or smaller roll-out container, dark green in color if possible. The size of the container shall be as determined by the Solid Waste Services Director or designee. In the event that one container is insufficient, a resident or property owner may purchase one additional ninety-six (96) gallon roll-out container from the City. Individual units may place no more than two roll-out garbage containers at the curb for garbage pick-up. \n","type":"section","prefixes":["(b)","(2)"],"prefix":"(2)","entire_prefix":"(b)(2)","prefix_anchor":"(b)(2)","level":2},"8":{"id":"2699","text":"\tAny refuse container that does not conform to the provisions of this chapter or that has ragged or sharp edges or any other defect liable to hamper or injure the persons collecting the contents thereof, shall not be used for holding refuse intended for collection, but must be promptly replaced by a proper receptacle. Upon notification to its Solid Waste Services Department, the City shall repair or replace any defective container provided by it. \n","type":"section","prefixes":["(b)","(3)"],"prefix":"(3)","entire_prefix":"(b)(3)","prefix_anchor":"(b)(3)","level":2},"9":{"id":"2700","text":"\tEvery person producing or having refuse shall provide and keep on the premises or property occupied or used by him sufficient refuse containers to handle all accumulation of refuse on such premises or property in the interval between collections by the Solid Waste Services Department. \n","type":"section","prefixes":["(b)","(4)"],"prefix":"(4)","entire_prefix":"(b)(4)","prefix_anchor":"(b)(4)","level":2},"10":{"id":"2701","text":"\tAny person may have leaves removed by the City if such leaves are placed in the parkway between the curb and the sidewalk, or, where there are no curbs and sidewalks, just by the roadside, so they may be easily handled by the collector. No tree limbs, shrubs or other material shall be mixed with leaves. \n","type":"section","prefixes":["(b)","(5)"],"prefix":"(5)","entire_prefix":"(b)(5)","prefix_anchor":"(b)(5)","level":2},"11":{"id":"2702","text":"\tNo person shall throw, drop or deposit any leaves, shrubs, or other debris into any catch basin or manhole in the City. \n","type":"section","prefixes":["(b)","(6)"],"prefix":"(6)","entire_prefix":"(b)(6)","prefix_anchor":"(b)(6)","level":2},"12":{"id":"2703","text":"\tEvery dwelling unit shall have adequate garbage and rubbish storage facilities the type and location of which are approved by the Solid Waste Services Director. \n","type":"section","prefixes":["(b)","(7)"],"prefix":"(7)","entire_prefix":"(b)(7)","prefix_anchor":"(b)(7)","level":2},"13":{"id":"2704","text":"","type":"section","prefixes":["(c)"],"prefix":"(c)","entire_prefix":"(c)","prefix_anchor":"(c)","level":1},"14":{"id":"2705","text":"\tEvery owner and every occupant or other person in control of any building or land in the City, including vacant property, shall keep the same in a clean and orderly condition and shall deposit refuse for collection by the Solid Waste Services Department in accordance with the provisions of this chapter and the regulations of the City Manager. Combustible and noncombustible refuse shall be stored in containers complying with this chapter. The owner of record and\/or tenant of any building or land in the City shall be given ten (10) days to correct the violation. Should any violation remain after the ten (10) day period, the owner and\/or tenant of any building or land in the City shall be subject to administrative fees and civil penalties pursuant to Raleigh City Code §7-2002.2 \n","type":"section","prefixes":["(c)","(1)"],"prefix":"(1)","entire_prefix":"(c)(1)","prefix_anchor":"(c)(1)","level":2},"15":{"id":"2706","text":"\tNo person shall throw, drop or deposit, or cause to be thrown, dropped or deposited on any land in the City (vacant or occupied) any waste (including but not limited to refuse, garbage, ashes, rubbish, building rubbish, dead animals, putrescible matter, and anything injurious to health); provided, however, the prohibition contained in this subsection shall not apply to the deposit of waste not injurious to health on a public dump where permission to make such deposit is granted by the Solid Waste Services Director nor to the filling in or grading of property with earth, mud, ashes and similar materials. \n","type":"section","prefixes":["(c)","(2)"],"prefix":"(2)","entire_prefix":"(c)(2)","prefix_anchor":"(c)(2)","level":2},"16":{"id":"2707","text":"","type":"section","prefixes":["(d)"],"prefix":"(d)","entire_prefix":"(d)","prefix_anchor":"(d)","level":1},"17":{"id":"2708","text":"\tRefuse to be collected by the Solid Waste Services Department shall be placed at the street, alley or other City approved location of the property from which it was generated by 7:00 a.m. on the designated day for collection. If the Solid Waste Director or his designee deems an alleyway passable for City Solid Waste equipment, roll-out containers may also be placed at rear alleyways. Containers shall be placed at least five (5) feet away from any obstruction (including mailboxes, transformers, parked cars, and light poles) and shall not be placed near low hanging branches or power lines. Containers shall be placed at the curb no earlier noon on the day before the designated collection day and shall be removed from the curb and placed in an inconspicuous location off the public right-of-way no later than 7:00 p.m. of the day after the designated collection day. \n","type":"section","prefixes":["(d)","(1)"],"prefix":"(1)","entire_prefix":"(d)(1)","prefix_anchor":"(d)(1)","level":2},"18":{"id":"2709","text":"\tUnder no circumstances, within a fire district, may refuse or refuse containers be placed upon the public street before the hour of 3:00 p.m. or after 5:30 p.m. nor shall a refuse container be permitted to remain on a public street after the hour of 9:30 a.m. \n","type":"section","prefixes":["(d)","(2)"],"prefix":"(2)","entire_prefix":"(d)(2)","prefix_anchor":"(d)(2)","level":2},"19":{"id":"2710","text":"\tAny owner of record and\/or tenant of any building, unit, or land in the City shall be responsible for the placement of refuse or refuse containers. Any person who places refuse or refuse containers upon a public street or in the public right-of-way before the time designated in this Code or leaves refuse or refuse containers in a public street or in the public right-of-way beyond the time allowed in this Code shall be in violation of the provisions of this Code and shall be subject to administrative fees and civil penalties pursuant to Raleigh City Code §7-2002.2. Each 24-hour period in which a violation occurs is a separate offense for which a separate civil penalty applies. Any violation of this subsection (d) shall be deemed a non-criminal violation and shall not be a misdemeanor or infraction pursuant to G.S. 14-4 or §14-1005(a) of this Code of Ordinances. Both the Inspections Director or his designees and the Solid Waste Services Director or his designees may enforce the provisions of this section. \n","type":"section","prefixes":["(d)","(3)"],"prefix":"(3)","entire_prefix":"(d)(3)","prefix_anchor":"(d)(3)","level":2},"20":{"id":"2711","text":"Tree trimmings. \nTree trimmings, hedge cuttings, grass, hay or other similar materials not prepared and handled in conformity with the provisions of this section will be removed, at the request of the owner or occupant of property used for residential purposes, at a cost of forty dollars ($40.00) as of July 1, 2003. The Solid Waste Services Director will determine which type of service will be used to remove the materials.","type":"section","prefixes":["(e)"],"prefix":"(e)","entire_prefix":"(e)","prefix_anchor":"(e)","level":1},"21":{"id":"2712","text":"","type":"section","prefixes":["(f)"],"prefix":"(f)","entire_prefix":"(f)","prefix_anchor":"(f)","level":1},"22":{"id":"2713","text":"\tCitizens who are sixty-five (65) years of age or older;\n","type":"section","prefixes":["(f)","(1)"],"prefix":"(1)","entire_prefix":"(f)(1)","prefix_anchor":"(f)(1)","level":2},"23":{"id":"2714","text":"\tCitizens who are disabled; and,\n","type":"section","prefixes":["(f)","(2)"],"prefix":"(2)","entire_prefix":"(f)(2)","prefix_anchor":"(f)(2)","level":2},"24":{"id":"2715","text":"\tProperties with steep topographies or steep driveways.\nThe Solid Waste Services Director or his designee shall confirm the eligibility of residents requesting back yard pickup prior to providing back yard service. \n(Code 1959 , §19-31; Ord. No. 1998-454, §9, 11-4-98; Ord. No. 2000-786-TC-194, TC-1-2000, §2, 5-2-00; Ord. No. 2004-628, §2, 5-4-04; Ord. No. 2007-161, §1, 1-23-07; Ord. No. 2011-822, §§4—6, 1-4-11; Ord. No. 2012-137, §2, 12-4-12, eff. 1-1-13) \n","type":"section","prefixes":["(f)","(3)"],"prefix":"(3)","entire_prefix":"(f)(3)","prefix_anchor":"(f)(3)","level":2}},"ancestry":{"1":{"id":"295","name":"ARTICLE B. - ADMINISTRATION AND ENFORCEMENT","identifier":"B","label":"article","url":"\/II\/7\/2\/B\/"},"2":{"id":"293","name":"CHAPTER 2. - SOLID WASTE COLLECTION [2]","identifier":"2","label":"chapter","url":"\/II\/7\/2\/"},"3":{"id":"289","name":"PART 7 - SOLID WASTE SERVICES [1]","identifier":"7","label":"part","url":"\/II\/7\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"906","structure_id":"295","section_number":"7-2002","catch_line":"ADMINISTRATION; ENFORCING OFFICER.","url":"\/7-2002\/","token":"7-2002"},"1":{"id":"907","structure_id":"295","section_number":"7-2002","catch_line":"ENFORCEMENT BY SOLID WASTE SERVICES DEPARTMENT.","url":"\/7-2002\/","token":"7-2002"},"2":{"id":"908","structure_id":"295","section_number":"7-2002","catch_line":"ADMINISTRATIVE FEES AND CIVIL PENALTIES.","url":"\/7-2002\/","token":"7-2002"},"3":{"id":"909","structure_id":"295","section_number":"7-2002","catch_line":"APPEAL OF CIVIL PENALTY ASSESSMENTS AND ADMINISTRATIVE FEES.","url":"\/7-2002\/","token":"7-2002"},"4":{"id":"910","structure_id":"295","section_number":"7-2003","catch_line":"REGULATIONS, PROMULGATING AND CHANGING.","url":"\/7-2003\/","token":"7-2003"},"5":{"id":"911","structure_id":"295","section_number":"7-2004","catch_line":"COLLECTION PRACTICES.","url":"\/7-2004\/","token":"7-2004"},"6":{"id":"912","structure_id":"295","section_number":"7-2005","catch_line":"PRECOLLECTION PRACTICES; REMOVAL OF RUBBISH, WEEDS, AND OTHER REFUSE.","url":"\/7-2005\/","token":"7-2005"},"7":{"id":"915","structure_id":"295","section_number":"7-2006","catch_line":"RATE SCHEDULES FOR SOLID WASTE COLLECTION AND DISPOSAL SERVICES.","url":"\/7-2006\/","token":"7-2006"},"8":{"id":"916","structure_id":"295","section_number":"7-2007","catch_line":"SANITARY LANDFILLS, DUMPING THEREON.","url":"\/7-2007\/","token":"7-2007"}},"previous_section":{"id":"911","structure_id":"295","section_number":"7-2004","catch_line":"COLLECTION PRACTICES.","url":"\/7-2004\/","token":"7-2004"},"next_section":{"id":"915","structure_id":"295","section_number":"7-2006","catch_line":"RATE SCHEDULES FOR SOLID WASTE COLLECTION AND DISPOSAL SERVICES.","url":"\/7-2006\/","token":"7-2006"},"references":false,"formats":{"txt":"\/7-2005.txt","json":"\/7-2005.xml"},"dublin_core":{"Title":"PRECOLLECTION PRACTICES; REMOVAL OF RUBBISH, WEEDS, AND OTHER REFUSE.","Type":"Text","Format":"text\/html","Identifier":"§ 7-2005","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nPRECOLLECTION PRACTICES; REMOVAL OF RUBBISH, WEEDS, AND OTHER REFUSE. (§\n7-2005)\n\n(a) \n\n   (1) \tGarbage shall be deposited promptly in refuse containers and must be\n   stored within the container at all times. Garbage located outside the\n   container will not be collected. \n   \n\n   (2) \tAny person desiring to place tree trimmings, hedge cuttings, or similar\n   materials for collection shall cause the same to be securely tied in bundles\n   not heavier than seventy-five (75) pounds nor more than five (5) feet in\n   length and eighteen (18) inches in diameter. He shall place the same for\n   collection at the curb line at the street on the area between the sidewalk and\n   the curb. Any number of such bundles may be so placed and collected during any\n   collection period. All tree trimmings, hedge cuttings, or similar materials\n   (yard waste), not prepared as described above, shall be placed in plastic\n   permanent type containers no larger than fifty-five (55) gallons, other\n   permanent type containers no larger than thirty-five (35) gallons, or clear\n   plastic bags or biodegradable paper yard waste bags, each type of container\n   not to exceed seventy-five (75) pounds in gross weight. \n   \n\n   (3) \tNo person shall burn leaves, shrubs, tree limbs, and the like on the\n   streets or sidewalks or on private property except upon special permission of\n   the Chief of the Fire Department. \n   \n\n   (4) \tBuilding rubbish shall be collected, removed, and disposed of by the\n   contractor or builder, or in event of their failure by the owner of the\n   property, in accordance with applicable provisions of this code and with\n   regulations not in conflict therewith promulgated by the City Manager. \n   \n\n(b) \n\n   (1) \tAll refuse containers shall conform to the standards described in the\n   Solid Waste Collection Design Manual, as amended, on file in the City\n   Clerk&#8217;s Office and must be fully compatible with the City&#8217;s\n   collection equipment. \n   \n\n   (2) \tDwellings eligible for individual unit collection will be provided one\n   (1) ninety-six (96) gallon or smaller roll-out container, dark green in color\n   if possible. The size of the container shall be as determined by the Solid\n   Waste Services Director or designee. In the event that one container is\n   insufficient, a resident or property owner may purchase one additional\n   ninety-six (96) gallon roll-out container from the City. Individual units may\n   place no more than two roll-out garbage containers at the curb for garbage\n   pick-up. \n   \n\n   (3) \tAny refuse container that does not conform to the provisions of this\n   chapter or that has ragged or sharp edges or any other defect liable to hamper\n   or injure the persons collecting the contents thereof, shall not be used for\n   holding refuse intended for collection, but must be promptly replaced by a\n   proper receptacle. Upon notification to its Solid Waste Services Department,\n   the City shall repair or replace any defective container provided by it. \n   \n\n   (4) \tEvery person producing or having refuse shall provide and keep on the\n   premises or property occupied or used by him sufficient refuse containers to\n   handle all accumulation of refuse on such premises or property in the interval\n   between collections by the Solid Waste Services Department. \n   \n\n   (5) \tAny person may have leaves removed by the City if such leaves are placed\n   in the parkway between the curb and the sidewalk, or, where there are no curbs\n   and sidewalks, just by the roadside, so they may be easily handled by the\n   collector. No tree limbs, shrubs or other material shall be mixed with leaves.\n   \n   \n\n   (6) \tNo person shall throw, drop or deposit any leaves, shrubs, or other\n   debris into any catch basin or manhole in the City. \n   \n\n   (7) \tEvery dwelling unit shall have adequate garbage and rubbish storage\n   facilities the type and location of which are approved by the Solid Waste\n   Services Director. \n   \n\n(c) \n\n   (1) \tEvery owner and every occupant or other person in control of any building\n   or land in the City, including vacant property, shall keep the same in a clean\n   and orderly condition and shall deposit refuse for collection by the Solid\n   Waste Services Department in accordance with the provisions of this chapter\n   and the regulations of the City Manager. Combustible and noncombustible refuse\n   shall be stored in containers complying with this chapter. The owner of record\n   and\/or tenant of any building or land in the City shall be given ten (10) days\n   to correct the violation. Should any violation remain after the ten (10) day\n   period, the owner and\/or tenant of any building or land in the City shall be\n   subject to administrative fees and civil penalties pursuant to Raleigh City\n   Code §7-2002.2 \n   \n\n   (2) \tNo person shall throw, drop or deposit, or cause to be thrown, dropped or\n   deposited on any land in the City (vacant or occupied) any waste (including\n   but not limited to refuse, garbage, ashes, rubbish, building rubbish, dead\n   animals, putrescible matter, and anything injurious to health); provided,\n   however, the prohibition contained in this subsection shall not apply to the\n   deposit of waste not injurious to health on a public dump where permission to\n   make such deposit is granted by the Solid Waste Services Director nor to the\n   filling in or grading of property with earth, mud, ashes and similar\n   materials. \n   \n\n(d) \n\n   (1) \tRefuse to be collected by the Solid Waste Services Department shall be\n   placed at the street, alley or other City approved location of the property\n   from which it was generated by 7:00 a.m. on the designated day for collection.\n   If the Solid Waste Director or his designee deems an alleyway passable for\n   City Solid Waste equipment, roll-out containers may also be placed at rear\n   alleyways. Containers shall be placed at least five (5) feet away from any\n   obstruction (including mailboxes, transformers, parked cars, and light poles)\n   and shall not be placed near low hanging branches or power lines. Containers\n   shall be placed at the curb no earlier noon on the day before the designated\n   collection day and shall be removed from the curb and placed in an\n   inconspicuous location off the public right-of-way no later than 7:00 p.m. of\n   the day after the designated collection day. \n   \n\n   (2) \tUnder no circumstances, within a fire district, may refuse or refuse\n   containers be placed upon the public street before the hour of 3:00 p.m. or\n   after 5:30 p.m. nor shall a refuse container be permitted to remain on a\n   public street after the hour of 9:30 a.m. \n   \n\n   (3) \tAny owner of record and\/or tenant of any building, unit, or land in the\n   City shall be responsible for the placement of refuse or refuse containers.\n   Any person who places refuse or refuse containers upon a public street or in\n   the public right-of-way before the time designated in this Code or leaves\n   refuse or refuse containers in a public street or in the public right-of-way\n   beyond the time allowed in this Code shall be in violation of the provisions\n   of this Code and shall be subject to administrative fees and civil penalties\n   pursuant to Raleigh City Code §7-2002.2. Each 24-hour period in which a\n   violation occurs is a separate offense for which a separate civil penalty\n   applies. Any violation of this subsection (d) shall be deemed a non-criminal\n   violation and shall not be a misdemeanor or infraction pursuant to G.S. 14-4\n   or §14-1005(a) of this Code of Ordinances. Both the Inspections Director or\n   his designees and the Solid Waste Services Director or his designees may\n   enforce the provisions of this section. \n   \n\n(e) Tree trimmings. \nTree trimmings, hedge cuttings, grass, hay or other similar materials not\nprepared and handled in conformity with the provisions of this section will be\nremoved, at the request of the owner or occupant of property used for\nresidential purposes, at a cost of forty dollars ($40.00) as of July 1, 2003.\nThe Solid Waste Services Director will determine which type of service will be\nused to remove the materials.\n\n(f) \n\n   (1) \tCitizens who are sixty-five (65) years of age or older;\n   \n\n   (2) \tCitizens who are disabled; and,\n   \n\n   (3) \tProperties with steep topographies or steep driveways.\n   The Solid Waste Services Director or his designee shall confirm the\n   eligibility of residents requesting back yard pickup prior to providing back\n   yard service. \n   (Code 1959 , §19-31; Ord. No. 1998-454, §9, 11-4-98; Ord. No.\n   2000-786-TC-194, TC-1-2000, §2, 5-2-00; Ord. No. 2004-628, §2, 5-4-04; Ord.\n   No. 2007-161, §1, 1-23-07; Ord. No. 2011-822, §§4—6, 1-4-11; Ord. No.\n   2012-137, §2, 12-4-12, eff. 1-1-13)\n"}