{"law_id":"911","section_number":"7-2004","catch_line":"COLLECTION PRACTICES.","history":"","order_by":"7-2004","metadata":false,"url":"\/7-2004\/","token":"7-2004","structure":{"1":{"id":"295","name":"ARTICLE B. - ADMINISTRATION AND ENFORCEMENT","identifier":"B","label":"article","url":"\/II\/7\/2\/B\/"},"2":{"id":"293","name":"CHAPTER 2. - SOLID WASTE COLLECTION [2]","identifier":"2","label":"chapter","url":"\/II\/7\/2\/"},"3":{"id":"289","name":"PART 7 - SOLID WASTE SERVICES [1]","identifier":"7","label":"part","url":"\/II\/7\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"referred_to_by":{"0":{"id":"583","section_number":"12-1037","catch_line":"REPAIR OF SIDEWALKS AND DRIVEWAYS BY PROPERTY OWNERS.","url":"http:\/\/localhost:8888\/12-1037\/"}},"edition_id":"1","section_id":"911","structure_id":"295","full_text":"","text":{"0":{"id":"2680","text":"","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"2681","text":"\tAny development consisting of detached single-family dwellings or attached single-family dwellings with a ground level individual entrance for each unit (townhouse buildings for example) of any number; or a development consisting of other multi-family dwellings up to six (6) units in any development with a ground level individual entrance for each unit are allowed curbside pickup of refuse from each individual unit utilizing containers meeting the size and weight specifications of the Solid Waste Collection Design Manual: once per week, if possible, with the following exception: \n","type":"section","prefixes":["(a)","(1)"],"prefix":"(1)","entire_prefix":"(a)(1)","prefix_anchor":"(a)(1)","level":2},"2":{"id":"2682","text":"\tAll developments consisting of more than five (5) attached dwellings with common entrances in each building or with units arranged one above the other in multiple stories (flats), must provide a common collection facility in accordance with the Solid Waste Collection Design Manual, as amended and refuse collection must be contracted with a private hauler: Twice per week, if possible. \n","type":"section","prefixes":["(a)","(2)"],"prefix":"(2)","entire_prefix":"(a)(2)","prefix_anchor":"(a)(2)","level":2},"3":{"id":"2683","text":"\tNon-residential properties must be served by common collection facilities as noted in the Solid Waste Collection Design Manual, as amended, and refuse collection must be contracted with a private refuse hauler: Twice per week, if possible. The following are exceptions to this requirement: \na.\tSmall businesses or offices located in an area that is primarily residential, may be allowed curbside collection service by the City, and curbside recycling service, provided that refuse generation for the building does not exceed two (2) individual ninety-six (96) gallon roll-out refuse containers meeting the standards in the Solid Waste Collection Design Manual, as amended, and that are purchased by the small business or office. Eligibility for this service will be determined on a case-by-case basis by the Solid Waste Services Director or designee. Businesses not meeting the above criteria will be required to locate or cooperate in locating a dumpster or roll-off compactor and cardboard recycling container as noted in the Solid Waste Collection Design Manual, as amended, and to contract with a private hauler to remove refuse: at least once per week, if possible. \nb.\tCentral Business District.\n1.\tCentral Business District residential, commercial, office, entertainment, institutional, medical, educational, charitable and other non-industrial uses located in an area bounded by Cabarrus Street, Blount Street, Edenton Street and McDowell Street may request curbside pickup of refuse by the City six (6) days per week, excluding certain City holidays, as determined by the Solid Waste Services Director. Approval by the Solid Waste Services Director or his designee is required for seven (7) day service requests. \nRefuse shall be deposited in bags and carts (restaurants shall be required to use carts) approved by the City and must be placed on the sidewalk by the curb between the hours of 3:00—5:30 p.m., or alternatively between the hours of 2:00 a.m. and 6:00 a.m., each day. All items to be collected must be removed from the curb by no later than 9:30 a.m. the following day. Charges and fees for the carts, bags and collection and disposal of refuse shall be fixed from time to time on schedules approved by the City Council and maintained on file in the office of the Solid Wastes Service Director. \n2.\tCentral Business District residential, commercial, office, entertainment, institutional, medical, educational, charitable and other non-industrial uses located in an area bounded by Peace Street, West Street, Hillsborough Street, and St. Mary&#8217;s Street may request pickup of refuse by the City six (6) days per week excluding certain City holidays as determined by the Solid Waste Services Director. Approval by the Solid Waste Services Director or his designee is required for seven (7) day service requests. \nRefuse shall be deposited in bags and carts (restaurants shall be required to use carts) approved by the City and must be placed on the sidewalk by the curb between the hours of 2:00 a.m. and 6:00 a.m. each day. All items to be collected must be removed from the curb by no later than 9:30 a.m. the following day. Charges and fees for the carts, bags and collection and disposal of refuse shall be fixed from time to time on schedules approved by the City Council and maintained on file in the office of the Solid Waste Service Director. \n3.\tExcept as otherwise stated, any owner of record and\/or tenant of any building, unit, or land in the City in violation of provisions in this chapter shall be subject administrative fees and civil penalties pursuant to Raleigh City Code §7-2002.2 \n","type":"section","prefixes":["(a)","(3)"],"prefix":"(3)","entire_prefix":"(a)(3)","prefix_anchor":"(a)(3)","level":2},"4":{"id":"2684","text":"\tIf the development is a Planned Development in accordance with City Code §10-2057, a solid waste collection plan can be approved by the City&#8217;s Solid Waste Services Department in lieu of the requirements noted herein, if the design of public streets or other alternate designs create limitations to standard waste collections. \n","type":"section","prefixes":["(a)","(4)"],"prefix":"(4)","entire_prefix":"(a)(4)","prefix_anchor":"(a)(4)","level":2},"5":{"id":"2685","text":"","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"6":{"id":"2686","text":"\tNotwithstanding the provisions of this chapter or other ordinances of this City, the City Manager is authorized to enter into a written contract, either privately or after public advertisement for bids, for the collection and removal of waste paper, paper boxes or cartons or other paper products deposited upon the streets of the City (or other place designated by the person desiring to have such products removed as waste) upon such terms and conditions as he may deem best for the benefit of the City; provided such contract shall define the area over which the collection of waste paper products shall be confined; provided further no such contract may be executed unless and until the person contracting to collect and remove such products shall have made a deposit with the City in the amount of five hundred dollars ($500.00) cash, conditioned upon the faithful performance of the contract and upon compliance with the requirements of this chapter and applicable ordinances of the City. No such contract may be made for a period exceeding one (1) year and shall be cancelable by either party upon thirty (30) days written notice. \n","type":"section","prefixes":["(b)","(1)"],"prefix":"(1)","entire_prefix":"(b)(1)","prefix_anchor":"(b)(1)","level":2},"7":{"id":"2687","text":"\tNo person shall engage in the business of collecting, hauling or transporting in the City any waste without first obtaining a permit from the City Manager to engage in such business. The City Manager shall not issue any permit for collections in the areas covered by contracts as provided for above. The holder of such permit shall conform to the applicable ordinances, regulations of the City Manager and the lawfully prescribed requirements of other departments of the City; and upon failure to so conform such permits shall be subject to revocation by the City Manager. \n","type":"section","prefixes":["(b)","(2)"],"prefix":"(2)","entire_prefix":"(b)(2)","prefix_anchor":"(b)(2)","level":2},"8":{"id":"2688","text":"","type":"section","prefixes":["(c)"],"prefix":"(c)","entire_prefix":"(c)","prefix_anchor":"(c)","level":1},"9":{"id":"2689","text":"\tBulky Load Program. Solid Waste Services provides free collection of enumerated items that do not fit into refuse containers. Bulky Load Collection is offered for the disposal of furniture, small appliances, mattresses, box springs, and similar household items. Yard waste, large appliances, odor-causing waste, or excess bags of garbage that would normally be placed in a refuse container will not be collected. \nA Bulky Load collection at a single address shall be limited to a maximum of four (4) cubic yards. Solid Waste Services shall not provide Bulky Load collection services for apartment complexes, businesses, or any other property that utilizes a dumpster, compactor or similar device for garbage collection purposes. All Bulky Load collections must be scheduled in advance. A collection for a specific address may be scheduled no more frequently than once every ninety (90) days. The Solid Waste Services Director or his designee shall determine whether the items to be collected qualify for the Bulky Load Program. \n","type":"section","prefixes":["(c)","(1)"],"prefix":"(1)","entire_prefix":"(c)(1)","prefix_anchor":"(c)(1)","level":2},"10":{"id":"2690","text":"\tSpecial Load Program. Collection of refuse unable to be collected by Solid Waste Services regularly scheduled collection and\/or the Solid Waste Services Bulky Load Program may be collected by the Solid Waste Services Special Load Program for a fee of fifty dollars ($50.00) per four (4) cubic yard load. Multiple Special Load collections may be purchased. The full amount due must be paid in advance; no items will be collected should the amount due exceed the amount paid. The Special Load Program is not available for rocks, dirt, building materials, loose leaves, tree limbs larger than five (5) feet long and six (6) inches in diameter, tree stumps, car parts, tires, chemicals or paints. Debris resulting from work performed by a contractor will not be collected. This service is a residential service and not available to businesses or commercial entities without special approval from the Solid Waste Services Director or his designee. \n(Code 1959 , §19-30; Ord. No. 1998-454, §9, 11-4-98; Ord. No. 2000-786-TC-194, TC-1-2000, §1, 5-2-00; Ord. No. 2002-290, §§1, 2, 9-17-02; Ord. No. 2004-628, §1, 5-4-04; Ord. No. 2006-55, §§1, 2, 6-20-06; Ord. No. 2011-820, §1, 1-4-11; Ord. No. 2011-821, §1, 1-4-11; Ord. No. 2012-137, §1, 12-4-12, eff. 1-1-13) \n","type":"section","prefixes":["(c)","(2)"],"prefix":"(2)","entire_prefix":"(c)(2)","prefix_anchor":"(c)(2)","level":2}},"ancestry":{"1":{"id":"295","name":"ARTICLE B. - ADMINISTRATION AND ENFORCEMENT","identifier":"B","label":"article","url":"\/II\/7\/2\/B\/"},"2":{"id":"293","name":"CHAPTER 2. - SOLID WASTE COLLECTION [2]","identifier":"2","label":"chapter","url":"\/II\/7\/2\/"},"3":{"id":"289","name":"PART 7 - SOLID WASTE SERVICES [1]","identifier":"7","label":"part","url":"\/II\/7\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"906","structure_id":"295","section_number":"7-2002","catch_line":"ADMINISTRATION; ENFORCING OFFICER.","url":"\/7-2002\/","token":"7-2002"},"1":{"id":"907","structure_id":"295","section_number":"7-2002","catch_line":"ENFORCEMENT BY SOLID WASTE SERVICES DEPARTMENT.","url":"\/7-2002\/","token":"7-2002"},"2":{"id":"908","structure_id":"295","section_number":"7-2002","catch_line":"ADMINISTRATIVE FEES AND CIVIL PENALTIES.","url":"\/7-2002\/","token":"7-2002"},"3":{"id":"909","structure_id":"295","section_number":"7-2002","catch_line":"APPEAL OF CIVIL PENALTY ASSESSMENTS AND ADMINISTRATIVE FEES.","url":"\/7-2002\/","token":"7-2002"},"4":{"id":"910","structure_id":"295","section_number":"7-2003","catch_line":"REGULATIONS, PROMULGATING AND CHANGING.","url":"\/7-2003\/","token":"7-2003"},"5":{"id":"911","structure_id":"295","section_number":"7-2004","catch_line":"COLLECTION PRACTICES.","url":"\/7-2004\/","token":"7-2004"},"6":{"id":"912","structure_id":"295","section_number":"7-2005","catch_line":"PRECOLLECTION PRACTICES; REMOVAL OF RUBBISH, WEEDS, AND OTHER REFUSE.","url":"\/7-2005\/","token":"7-2005"},"7":{"id":"915","structure_id":"295","section_number":"7-2006","catch_line":"RATE SCHEDULES FOR SOLID WASTE COLLECTION AND DISPOSAL SERVICES.","url":"\/7-2006\/","token":"7-2006"},"8":{"id":"916","structure_id":"295","section_number":"7-2007","catch_line":"SANITARY LANDFILLS, DUMPING THEREON.","url":"\/7-2007\/","token":"7-2007"}},"previous_section":{"id":"910","structure_id":"295","section_number":"7-2003","catch_line":"REGULATIONS, PROMULGATING AND CHANGING.","url":"\/7-2003\/","token":"7-2003"},"next_section":{"id":"912","structure_id":"295","section_number":"7-2005","catch_line":"PRECOLLECTION PRACTICES; REMOVAL OF RUBBISH, WEEDS, AND OTHER REFUSE.","url":"\/7-2005\/","token":"7-2005"},"references":false,"formats":{"txt":"\/7-2004.txt","json":"\/7-2004.xml"},"dublin_core":{"Title":"COLLECTION PRACTICES.","Type":"Text","Format":"text\/html","Identifier":"§ 7-2004","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nCOLLECTION PRACTICES. (§ 7-2004)\n\n(a) \n\n   (1) \tAny development consisting of detached single-family dwellings or\n   attached single-family dwellings with a ground level individual entrance for\n   each unit (townhouse buildings for example) of any number; or a development\n   consisting of other multi-family dwellings up to six (6) units in any\n   development with a ground level individual entrance for each unit are allowed\n   curbside pickup of refuse from each individual unit utilizing containers\n   meeting the size and weight specifications of the Solid Waste Collection\n   Design Manual: once per week, if possible, with the following exception: \n   \n\n   (2) \tAll developments consisting of more than five (5) attached dwellings with\n   common entrances in each building or with units arranged one above the other\n   in multiple stories (flats), must provide a common collection facility in\n   accordance with the Solid Waste Collection Design Manual, as amended and\n   refuse collection must be contracted with a private hauler: Twice per week, if\n   possible. \n   \n\n   (3) \tNon-residential properties must be served by common collection facilities\n   as noted in the Solid Waste Collection Design Manual, as amended, and refuse\n   collection must be contracted with a private refuse hauler: Twice per week, if\n   possible. The following are exceptions to this requirement: \n   a.\tSmall businesses or offices located in an area that is primarily\n   residential, may be allowed curbside collection service by the City, and\n   curbside recycling service, provided that refuse generation for the building\n   does not exceed two (2) individual ninety-six (96) gallon roll-out refuse\n   containers meeting the standards in the Solid Waste Collection Design Manual,\n   as amended, and that are purchased by the small business or office.\n   Eligibility for this service will be determined on a case-by-case basis by the\n   Solid Waste Services Director or designee. Businesses not meeting the above\n   criteria will be required to locate or cooperate in locating a dumpster or\n   roll-off compactor and cardboard recycling container as noted in the Solid\n   Waste Collection Design Manual, as amended, and to contract with a private\n   hauler to remove refuse: at least once per week, if possible. \n   b.\tCentral Business District.\n   1.\tCentral Business District residential, commercial, office, entertainment,\n   institutional, medical, educational, charitable and other non-industrial uses\n   located in an area bounded by Cabarrus Street, Blount Street, Edenton Street\n   and McDowell Street may request curbside pickup of refuse by the City six (6)\n   days per week, excluding certain City holidays, as determined by the Solid\n   Waste Services Director. Approval by the Solid Waste Services Director or his\n   designee is required for seven (7) day service requests. \n   Refuse shall be deposited in bags and carts (restaurants shall be required to\n   use carts) approved by the City and must be placed on the sidewalk by the curb\n   between the hours of 3:00—5:30 p.m., or alternatively between the hours of\n   2:00 a.m. and 6:00 a.m., each day. All items to be collected must be removed\n   from the curb by no later than 9:30 a.m. the following day. Charges and fees\n   for the carts, bags and collection and disposal of refuse shall be fixed from\n   time to time on schedules approved by the City Council and maintained on file\n   in the office of the Solid Wastes Service Director. \n   2.\tCentral Business District residential, commercial, office, entertainment,\n   institutional, medical, educational, charitable and other non-industrial uses\n   located in an area bounded by Peace Street, West Street, Hillsborough Street,\n   and St. Mary&#8217;s Street may request pickup of refuse by the City six (6)\n   days per week excluding certain City holidays as determined by the Solid Waste\n   Services Director. Approval by the Solid Waste Services Director or his\n   designee is required for seven (7) day service requests. \n   Refuse shall be deposited in bags and carts (restaurants shall be required to\n   use carts) approved by the City and must be placed on the sidewalk by the curb\n   between the hours of 2:00 a.m. and 6:00 a.m. each day. All items to be\n   collected must be removed from the curb by no later than 9:30 a.m. the\n   following day. Charges and fees for the carts, bags and collection and\n   disposal of refuse shall be fixed from time to time on schedules approved by\n   the City Council and maintained on file in the office of the Solid Waste\n   Service Director. \n   3.\tExcept as otherwise stated, any owner of record and\/or tenant of any\n   building, unit, or land in the City in violation of provisions in this chapter\n   shall be subject administrative fees and civil penalties pursuant to Raleigh\n   City Code §7-2002.2 \n   \n\n   (4) \tIf the development is a Planned Development in accordance with City Code\n   §10-2057, a solid waste collection plan can be approved by the City&#8217;s\n   Solid Waste Services Department in lieu of the requirements noted herein, if\n   the design of public streets or other alternate designs create limitations to\n   standard waste collections. \n   \n\n(b) \n\n   (1) \tNotwithstanding the provisions of this chapter or other ordinances of\n   this City, the City Manager is authorized to enter into a written contract,\n   either privately or after public advertisement for bids, for the collection\n   and removal of waste paper, paper boxes or cartons or other paper products\n   deposited upon the streets of the City (or other place designated by the\n   person desiring to have such products removed as waste) upon such terms and\n   conditions as he may deem best for the benefit of the City; provided such\n   contract shall define the area over which the collection of waste paper\n   products shall be confined; provided further no such contract may be executed\n   unless and until the person contracting to collect and remove such products\n   shall have made a deposit with the City in the amount of five hundred dollars\n   ($500.00) cash, conditioned upon the faithful performance of the contract and\n   upon compliance with the requirements of this chapter and applicable\n   ordinances of the City. No such contract may be made for a period exceeding\n   one (1) year and shall be cancelable by either party upon thirty (30) days\n   written notice. \n   \n\n   (2) \tNo person shall engage in the business of collecting, hauling or\n   transporting in the City any waste without first obtaining a permit from the\n   City Manager to engage in such business. The City Manager shall not issue any\n   permit for collections in the areas covered by contracts as provided for\n   above. The holder of such permit shall conform to the applicable ordinances,\n   regulations of the City Manager and the lawfully prescribed requirements of\n   other departments of the City; and upon failure to so conform such permits\n   shall be subject to revocation by the City Manager. \n   \n\n(c) \n\n   (1) \tBulky Load Program. Solid Waste Services provides free collection of\n   enumerated items that do not fit into refuse containers. Bulky Load Collection\n   is offered for the disposal of furniture, small appliances, mattresses, box\n   springs, and similar household items. Yard waste, large appliances,\n   odor-causing waste, or excess bags of garbage that would normally be placed in\n   a refuse container will not be collected. \n   A Bulky Load collection at a single address shall be limited to a maximum of\n   four (4) cubic yards. Solid Waste Services shall not provide Bulky Load\n   collection services for apartment complexes, businesses, or any other property\n   that utilizes a dumpster, compactor or similar device for garbage collection\n   purposes. All Bulky Load collections must be scheduled in advance. A\n   collection for a specific address may be scheduled no more frequently than\n   once every ninety (90) days. The Solid Waste Services Director or his designee\n   shall determine whether the items to be collected qualify for the Bulky Load\n   Program. \n   \n\n   (2) \tSpecial Load Program. Collection of refuse unable to be collected by\n   Solid Waste Services regularly scheduled collection and\/or the Solid Waste\n   Services Bulky Load Program may be collected by the Solid Waste Services\n   Special Load Program for a fee of fifty dollars ($50.00) per four (4) cubic\n   yard load. Multiple Special Load collections may be purchased. The full amount\n   due must be paid in advance; no items will be collected should the amount due\n   exceed the amount paid. The Special Load Program is not available for rocks,\n   dirt, building materials, loose leaves, tree limbs larger than five (5) feet\n   long and six (6) inches in diameter, tree stumps, car parts, tires, chemicals\n   or paints. Debris resulting from work performed by a contractor will not be\n   collected. This service is a residential service and not available to\n   businesses or commercial entities without special approval from the Solid\n   Waste Services Director or his designee. \n   (Code 1959 , §19-30; Ord. No. 1998-454, §9, 11-4-98; Ord. No.\n   2000-786-TC-194, TC-1-2000, §1, 5-2-00; Ord. No. 2002-290, §§1, 2, 9-17-02;\n   Ord. No. 2004-628, §1, 5-4-04; Ord. No. 2006-55, §§1, 2, 6-20-06; Ord. No.\n   2011-820, §1, 1-4-11; Ord. No. 2011-821, §1, 1-4-11; Ord. No. 2012-137, §1,\n   12-4-12, eff. 1-1-13)\n"}