{"law_id":"168","section_number":"8-2007","catch_line":"COMMON METERS AND CONNECTIONS; REQUIREMENTS.","history":"","order_by":"8-2007","metadata":false,"url":"\/8-2007\/","token":"8-2007","structure":{"1":{"id":"89","name":"ARTICLE A. - GENERAL PROVISIONS","identifier":"A","label":"article","url":"\/II\/8\/2\/A\/"},"2":{"id":"88","name":"CHAPTER 2. - WATER AND SEWER SERVICE","identifier":"2","label":"chapter","url":"\/II\/8\/2\/"},"3":{"id":"84","name":"PART 8 - PUBLIC UTILITIES","identifier":"8","label":"part","url":"\/II\/8\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"referred_to_by":false,"edition_id":"1","section_id":"168","structure_id":"89","full_text":"(a) The building or buildings to be served are in compliance with the City&#8217;s zoning and subdivision ordinances, if located within the jurisdiction of the City, or with the County zoning and subdivision ordinances, if located within the jurisdiction of the County.\r\r(b) The building permit and plat shows a single owner and indicates that the complex of buildings will be constructed on a single lot.\r\r(c) If one (1) common meter is used, such meter shall be located within the street right-of-way or in a two-foot easement adjacent to the street right-of-way at such locations approved by the Director of Public Utilities.\r\r(d) If a common water connection and\/or sewer connection and more than one (1) meter is used, the meters may be located on private property. In such cases the applicant shall be required to submit to the Department of Public Utilities a site plan showing the proposed water and sewer construction. The plans shall be prepared by a registered professional engineer who shall also provide periodic inspection of the work. When the work is complete, he shall furnish the owner and the City with a certification that the work has been done properly and has been approved by him. The plan shall be approved by the Department of Public Utilities to include size of water and sewer line, materials to be used for construction, valve locations, hydrant locations, manhole locations, meter locations and any other appurtenances that may be necessary as determined by the Director of Public Utilities. All construction from the property line to the water meter shall be in accordance with the City standards and specifications. Construction beyond the water meter may be with materials permitted in the City of Raleigh Plumbing Code. All sewer construction within easements shall be in accordance with City standards and specifications; all other sewer construction shall be in accordance with the City of Raleigh Plumbing Code. All construction shall be performed by either a licensed master plumber or a licensed utility contractor. The Director of Public Utilities or his designated representatives may enter the premises of any water or sewer user between the hours of 8:00 a.m. and 6:00 p.m. to examine the pipes and fixtures, the quantity of water being used and the manner of its use, to take meter readings and to make meter repairs.\r\r(e) Should a building within such a multiple constructed area be conveyed to a new owner, the City shall require a separate water and sewer connection from that building to the public main. Each development in any of the above categories shall have a fire protection plan approved by the Public Utilities Department and the Fire Department prior to the issuance of a building permit and prior to the installation of water connections or the extension of existing water installations.\r\r(f) The fire protection plans shall be submitted in triplicate to the Director of Public Utilities for approval. The City reserves the right to require proper size water lines, proper hydrants spacing and location, and the installation of metering devices where it shall be determined that water is being used for other than fire protection purposes exclusively. All water facilities constructed on private property for the purpose of fire fighting shall be in accordance with City standards and specifications. Construction beyond the water meter may be with material permitted in the City of Raleigh Plumbing Code. \n(Code 1959 , §23-17.1(c); Ord. No. 1985-543, §§7—10, 4-16-85) \nCross references: Water and sewer rates and connection fees, §§2-3001—2-3004; plumbing code, §10-6071 et seq.\r\r","text":{"0":{"id":"518","text":"The building or buildings to be served are in compliance with the City&#8217;s zoning and subdivision ordinances, if located within the jurisdiction of the City, or with the County zoning and subdivision ordinances, if located within the jurisdiction of the County.","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"519","text":"The building permit and plat shows a single owner and indicates that the complex of buildings will be constructed on a single lot.","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"2":{"id":"520","text":"If one (1) common meter is used, such meter shall be located within the street right-of-way or in a two-foot easement adjacent to the street right-of-way at such locations approved by the Director of Public Utilities.","type":"section","prefixes":["(c)"],"prefix":"(c)","entire_prefix":"(c)","prefix_anchor":"(c)","level":1},"3":{"id":"521","text":"If a common water connection and\/or sewer connection and more than one (1) meter is used, the meters may be located on private property. In such cases the applicant shall be required to submit to the Department of Public Utilities a site plan showing the proposed water and sewer construction. The plans shall be prepared by a registered professional engineer who shall also provide periodic inspection of the work. When the work is complete, he shall furnish the owner and the City with a certification that the work has been done properly and has been approved by him. The plan shall be approved by the Department of Public Utilities to include size of water and sewer line, materials to be used for construction, valve locations, hydrant locations, manhole locations, meter locations and any other appurtenances that may be necessary as determined by the Director of Public Utilities. All construction from the property line to the water meter shall be in accordance with the City standards and specifications. Construction beyond the water meter may be with materials permitted in the City of Raleigh Plumbing Code. All sewer construction within easements shall be in accordance with City standards and specifications; all other sewer construction shall be in accordance with the City of Raleigh Plumbing Code. All construction shall be performed by either a licensed master plumber or a licensed utility contractor. The Director of Public Utilities or his designated representatives may enter the premises of any water or sewer user between the hours of 8:00 a.m. and 6:00 p.m. to examine the pipes and fixtures, the quantity of water being used and the manner of its use, to take meter readings and to make meter repairs.","type":"section","prefixes":["(d)"],"prefix":"(d)","entire_prefix":"(d)","prefix_anchor":"(d)","level":1},"4":{"id":"522","text":"Should a building within such a multiple constructed area be conveyed to a new owner, the City shall require a separate water and sewer connection from that building to the public main. Each development in any of the above categories shall have a fire protection plan approved by the Public Utilities Department and the Fire Department prior to the issuance of a building permit and prior to the installation of water connections or the extension of existing water installations.","type":"section","prefixes":["(e)"],"prefix":"(e)","entire_prefix":"(e)","prefix_anchor":"(e)","level":1},"5":{"id":"523","text":"The fire protection plans shall be submitted in triplicate to the Director of Public Utilities for approval. The City reserves the right to require proper size water lines, proper hydrants spacing and location, and the installation of metering devices where it shall be determined that water is being used for other than fire protection purposes exclusively. All water facilities constructed on private property for the purpose of fire fighting shall be in accordance with City standards and specifications. Construction beyond the water meter may be with material permitted in the City of Raleigh Plumbing Code. \n(Code 1959 , §23-17.1(c); Ord. No. 1985-543, §§7—10, 4-16-85) \nCross references: Water and sewer rates and connection fees, §§2-3001—2-3004; plumbing code, §10-6071 et seq.","type":"section","prefixes":["(f)"],"prefix":"(f)","entire_prefix":"(f)","prefix_anchor":"(f)","level":1}},"ancestry":{"1":{"id":"89","name":"ARTICLE A. - GENERAL PROVISIONS","identifier":"A","label":"article","url":"\/II\/8\/2\/A\/"},"2":{"id":"88","name":"CHAPTER 2. - WATER AND SEWER SERVICE","identifier":"2","label":"chapter","url":"\/II\/8\/2\/"},"3":{"id":"84","name":"PART 8 - PUBLIC UTILITIES","identifier":"8","label":"part","url":"\/II\/8\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"162","structure_id":"89","section_number":"8-2001","catch_line":"DEFINITIONS.","url":"\/8-2001\/","token":"8-2001"},"1":{"id":"163","structure_id":"89","section_number":"8-2002","catch_line":"CONNECTING WITH WATER PIPES.","url":"\/8-2002\/","token":"8-2002"},"2":{"id":"164","structure_id":"89","section_number":"8-2003","catch_line":"REPLACEMENT OF WATER OR SEWER SERVICE STUBS.","url":"\/8-2003\/","token":"8-2003"},"3":{"id":"165","structure_id":"89","section_number":"8-2004","catch_line":"RESPONSIBILITY FOR MAKING CONNECTIONS.","url":"\/8-2004\/","token":"8-2004"},"4":{"id":"166","structure_id":"89","section_number":"8-2005","catch_line":"METER REQUIREMENTS; PLACEMENT OF METERS.","url":"\/8-2005\/","token":"8-2005"},"5":{"id":"167","structure_id":"89","section_number":"8-2006","catch_line":"ADDITIONAL METERS; COMMON CONNECTIONS; ALLOWED USES.","url":"\/8-2006\/","token":"8-2006"},"6":{"id":"168","structure_id":"89","section_number":"8-2007","catch_line":"COMMON METERS AND CONNECTIONS; REQUIREMENTS.","url":"\/8-2007\/","token":"8-2007"},"7":{"id":"169","structure_id":"89","section_number":"8-2008","catch_line":"WELLS; PERMIT REQUIRED.","url":"\/8-2008\/","token":"8-2008"},"8":{"id":"171","structure_id":"89","section_number":"8-2009","catch_line":"NEW OR REPLACEMENT WATER AND SEWER SYSTEMS TO BE FLOOD-RESISTANT.","url":"\/8-2009\/","token":"8-2009"},"9":{"id":"172","structure_id":"89","section_number":"8-2010","catch_line":"EMERGENCY DISCONTINUATION OF SERVICE AND REPAIRS.","url":"\/8-2010\/","token":"8-2010"},"10":{"id":"173","structure_id":"89","section_number":"8-2011","catch_line":"PAYMENT OF FEES AND CHARGES.","url":"\/8-2011\/","token":"8-2011"},"11":{"id":"174","structure_id":"89","section_number":"8-2012","catch_line":"ACCESS TO AND OBSTRUCTIONS OF MANHOLES AND EASEMENTS.","url":"\/8-2012\/","token":"8-2012"},"12":{"id":"175","structure_id":"89","section_number":"8-2013","catch_line":"INJURY TO SYSTEMS; REMOVING, DAMAGING, BREAKING, ETC.","url":"\/8-2013\/","token":"8-2013"},"13":{"id":"176","structure_id":"89","section_number":"8-2014","catch_line":"ENFORCEMENT PROCEDURE.","url":"\/8-2014\/","token":"8-2014"},"14":{"id":"177","structure_id":"89","section_number":"8-2015","catch_line":"DUTY TO REPORT DAMAGE.","url":"\/8-2015\/","token":"8-2015"},"15":{"id":"178","structure_id":"89","section_number":"8-2016","catch_line":"RALEIGH PUBLIC UTILITIES HANDBOOK.","url":"\/8-2016\/","token":"8-2016"},"16":{"id":"179","structure_id":"89","section_number":"8-2017","catch_line":"RESERVED.","url":"\/8-2017\/","token":"8-2017"},"17":{"id":"180","structure_id":"89","section_number":"8-2017","catch_line":"RESERVED. ","url":"\/8-2017\/","token":"8-2017"}},"previous_section":{"id":"167","structure_id":"89","section_number":"8-2006","catch_line":"ADDITIONAL METERS; COMMON CONNECTIONS; ALLOWED USES.","url":"\/8-2006\/","token":"8-2006"},"next_section":{"id":"169","structure_id":"89","section_number":"8-2008","catch_line":"WELLS; PERMIT REQUIRED.","url":"\/8-2008\/","token":"8-2008"},"references":{"0":{"id":"280","section_number":"8-2148","catch_line":"OTHER CONNECTIONS.","url":"http:\/\/localhost:8888\/8-2148\/"}},"formats":{"txt":"\/8-2007.txt","json":"\/8-2007.xml"},"dublin_core":{"Title":"COMMON METERS AND CONNECTIONS; REQUIREMENTS.","Type":"Text","Format":"text\/html","Identifier":"§ 8-2007","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nCOMMON METERS AND CONNECTIONS; REQUIREMENTS. (§ 8-2007)\n\n(a) The building or buildings to be served are in compliance with the\nCity&#8217;s zoning and subdivision ordinances, if located within the\njurisdiction of the City, or with the County zoning and subdivision ordinances,\nif located within the jurisdiction of the County.\n\n(b) The building permit and plat shows a single owner and indicates that the\ncomplex of buildings will be constructed on a single lot.\n\n(c) If one (1) common meter is used, such meter shall be located within the\nstreet right-of-way or in a two-foot easement adjacent to the street\nright-of-way at such locations approved by the Director of Public Utilities.\n\n(d) If a common water connection and\/or sewer connection and more than one (1)\nmeter is used, the meters may be located on private property. In such cases the\napplicant shall be required to submit to the Department of Public Utilities a\nsite plan showing the proposed water and sewer construction. The plans shall be\nprepared by a registered professional engineer who shall also provide periodic\ninspection of the work. When the work is complete, he shall furnish the owner\nand the City with a certification that the work has been done properly and has\nbeen approved by him. The plan shall be approved by the Department of Public\nUtilities to include size of water and sewer line, materials to be used for\nconstruction, valve locations, hydrant locations, manhole locations, meter\nlocations and any other appurtenances that may be necessary as determined by the\nDirector of Public Utilities. All construction from the property line to the\nwater meter shall be in accordance with the City standards and specifications.\nConstruction beyond the water meter may be with materials permitted in the City\nof Raleigh Plumbing Code. All sewer construction within easements shall be in\naccordance with City standards and specifications; all other sewer construction\nshall be in accordance with the City of Raleigh Plumbing Code. All construction\nshall be performed by either a licensed master plumber or a licensed utility\ncontractor. The Director of Public Utilities or his designated representatives\nmay enter the premises of any water or sewer user between the hours of 8:00 a.m.\nand 6:00 p.m. to examine the pipes and fixtures, the quantity of water being\nused and the manner of its use, to take meter readings and to make meter\nrepairs.\n\n(e) Should a building within such a multiple constructed area be conveyed to a\nnew owner, the City shall require a separate water and sewer connection from\nthat building to the public main. Each development in any of the above\ncategories shall have a fire protection plan approved by the Public Utilities\nDepartment and the Fire Department prior to the issuance of a building permit\nand prior to the installation of water connections or the extension of existing\nwater installations.\n\n(f) The fire protection plans shall be submitted in triplicate to the Director\nof Public Utilities for approval. The City reserves the right to require proper\nsize water lines, proper hydrants spacing and location, and the installation of\nmetering devices where it shall be determined that water is being used for other\nthan fire protection purposes exclusively. All water facilities constructed on\nprivate property for the purpose of fire fighting shall be in accordance with\nCity standards and specifications. Construction beyond the water meter may be\nwith material permitted in the City of Raleigh Plumbing Code. \n(Code 1959 , §23-17.1(c); Ord. No. 1985-543, §§7—10, 4-16-85) \nCross references: Water and sewer rates and connection fees,\n§§2-3001—2-3004; plumbing code, §10-6071 et seq.\n"}