{"law_id":"294","section_number":"8-2163","catch_line":"DEFINITIONS.","history":"","order_by":"8-2163","metadata":false,"url":"\/8-2163\/","token":"8-2163","structure":{"1":{"id":"97","name":"ARTICLE E. - WATER CONSERVATION PLAN [6]","identifier":"E","label":"article","url":"\/II\/8\/2\/E\/"},"2":{"id":"88","name":"CHAPTER 2. - WATER AND SEWER SERVICE","identifier":"2","label":"chapter","url":"\/II\/8\/2\/"},"3":{"id":"84","name":"PART 8 - PUBLIC UTILITIES","identifier":"8","label":"part","url":"\/II\/8\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"referred_to_by":false,"edition_id":"1","section_id":"294","structure_id":"97","full_text":"As used in this article, the following terms shall have the meanings provided in this section unless the context clearly indicates otherwise. \nAdd-on device. A device utilized in combination with a programmable timer to measure local weather conditions such as rain, temperature, soil conditions and\/or evapotranspiration, and will have the capability, at a minimum, to be installed as an interrupt-type device on the common and\/or control wires for the controller. Such device will serve as a secondary shut-off device to assist in optimal watering conditions due to current climate conditions. \nApproved (or approval). Approved or approval means certified in writing by the Public Utilities Director as an acceptable water conservation device, program or methodology for the purpose of water conservation. \nAudit results. Licensed irrigation contractors will use the Landscape Worksheet provided by the Irrigation Association and submit this documentation to the City of Raleigh within two weeks of the irrigation audit&#8217;s completion. \nAvailable water supply. The total amount of water that is available to the City in the water supply pool(s). The U.S. Army Corps of Engineers will determine this amount for Falls Lake once the water level in Falls Lake drops below two hundred fifty-one and one-half (251.5) feet Mean Sea Level. \nAutomatic spray irrigation system. Any installed irrigation system that can be programmed to operate during certain times and\/or conditions and which is connect to the City&#8217;s public water supply system. \nBest Management Practice (BMP). A management practice that is designed to reduce water usage and protect water quality. \nCertified conservation user. A certified conservation user is a consumer who complies with the City of Raleigh Water Conservation Program. \nCity. City in this article means the City of Raleigh. \nCity reuse water. Effluent water from City facilities, including the City E.M. Johnson Water Treatment Plant, Smith Creek Wastewater Treatment Plant, Little Creek Wastewater Treatment Plant and\/or Neuse River Wastewater Treatment Plant, which meets or exceeds the minimum quality requirements of the current North Carolina Reuse and Reclaimed Water Quality Standards. \nConservation (or conserve). Conservation or conserve means any beneficial reduction in water loss, waste, or use. \nConservation device. An approved water conservation device, properly installed within a private plumbing or distribution system, to improve water use efficiency within the City water supply system. \nConservation program. A program that identifies the uses of water within residential users, industry groups, commercial and\/or industrial applications, which focuses on BMPs to reduce the consumption of water. The program will be submitted to Public Utilities for review and approval. Each conservation program should be updated as required by the Public Utilities Director. All certified conservation users should be publicly recognized as water savers. \nConsumer. Any person, business, corporation, institution, resident or industry responsible for any property at which water from the City of Raleigh public water supply is received. In the absence of other parties or the failure of other parties to accept the responsibilities herein set forth, the owner of record of the real property shall be ultimately responsible. \nDistribution Uniformity (DU). A measurement to determine the performance of installed irrigation systems; expresses the uniformity of applied irrigation water over an irrigated zone; expressed as a ratio of the average of the lowest twenty-five (25) per cent of measurements to the overall average measurement, gathered through the use of catch cans, commonly used to evaluate the coverage of one or more sprinklers or drip systems. The equation is expressed by that of DULQ:  \nVLQ = average of the lowest twenty-five (25) per cent (lower quarter) of catch cans measurements, ml. \nVavg = average all catch cans, ml. \nDistribution uniformity as measured by the low quarter distribution (DULQ) is a common measurement of efficiency. This distribution uniformity is determined by the following: \nEvapotranspiration (ET) sensor. A sensor that reads current, local ET data from a server and then adjusts the irrigation system&#8217;s run-times accordingly. \nHand held hose. Any hose that is connected to the City&#8217;s public water supply system and held in the hand during irrigation use. \nHose end sprinkler. An irrigation device that is connected to the City&#8217;s public water supply system and is not designed to be held in the hand during use. Examples are: single stream, multi-stream, and impact type sprinklers. \nHydrant meter. A water meter specifically designed, fabricated and leased from the City of Raleigh Public Utilities Department for consumers to purchase water from the City from fire hydrants in accordance with the City&#8217;s Hydrant Meter Program. \nIrrigation audit. The licensed irrigation contractor will follow the guidelines set forth by the Irrigation Association&#8217;s (IA) Irrigation Audit Guidelines (found in the Public Utilities Handbook and at: http:\/\/www.irrigation.org) to conduct an irrigation audit. The overall system must maintain a distribution uniformity (DU) of no less than fifty (50) per cent, and the results of said audit must be submitted to the City for approval in the format provided by the Irrigation Association. The auditor should inspect the installation of the backflow prevention assembly, main line, laterals, valves, sprinkler heads, drip\/micro-irrigation equipment, control wire, controller, rain sensor, timer or controller and any other water conserving devices, and should assure that the intent of the irrigation designer or consultant has been preserved. In addition, the audit shall also verify the installation of specified water management devices such as a rain shutoff device and\/or soil moisture sensors. Finally, the irrigation schedule shall be evaluated to assure that the irrigation system meets the supplemental water needs of the plants without wasting water. Systems which fail to meet the standards of the audit will have a period of two (2) weeks to correct the problem or result in having their irrigation service interrupted. \nIrrigation system. Set of components which may include a hose, piping, fittings, sprinklers, drip tubing, valves, and control wiring connected to a water source or water distribution network which is used to apply water to residential or commercial lawns, landscapes or other areas. \nLicensed irrigation contractor. A licensed irrigation contractor is an irrigation professional, who has met a set of minimum standards specified by the North Carolina Irrigation Contractors&#8217; Licensing Board under Chapter 89G of the North Carolina General Statutes. \nMajor water user. A water customer who uses one hundred thousand (100,000) gallons per day (GPD) or more per account as determined on either an annual or an average day during the City seasonal water demand period. \nNon-automatic spray irrigation system. Any installed irrigation system that is connected to the City&#8217;s public water supply system and which is operated manually. \nOn-site reuse water. On-site reuse water is effluent water from an individual on-site wastewater system which meets or exceeds the minimum requirements of the current North Carolina Reuse and Reclaimed Water Quality Standards. \nPotable water. Potable water is the water from the public water supply system of the City which meets or exceeds the minimum requirements of the current Federal and North Carolina Safe Drinking Water Act. \nProgrammable timer. An automatic timing device, connected either wired or wireless to remotely control valves and irrigation heads according to a set irrigation schedule. An approved timer must: (a) have the ability to program mandatory watering restrictions to include days and times; (b) register run-times as low as one-minute increments; and (c) be connected to an approved water conservation add-on device which will block the operation of the system if irrigation is unnecessary. \nProjection period. The remaining number of days in the calendar year from the date of the water supply projection, plus sixty (60) days. \nPublic water supply. The water supply of the City, and its customers for general use and which supply is recognized as the public water supply of the City by the North Carolina Department of Environment and Natural Resources. \nRain sensor (RS) or rain shut-off device or rain switch. A device designed to interrupt an automatic irrigation system&#8217;s cycle during periods of rain. Approved rain sensors, rain shut-off, or rain switch will be designed to shut off after one-fourth (¼) of an inch of rain has fallen, and be at least five (5) feet from a house or building. \nReuse water. City reuse water and\/or on-site reuse water. \nRoot zone (RZ). The depth of the soil from which the crop roots extract water and nutrients. \nRun-times (RT). The operating time of an irrigation zone for a single irrigation cycle. \nSeasonal demand period. The period of time from April 1st through November 30th. \nSmart controller. Smart controllers estimate or measure the available soil moisture, rainfall, wind, slope, soil, plant type, temperature (and more) of local conditions to operate an irrigation system, replenishing water as needed while maximizing water efficiency. A properly programmed smart controller requires initial site specific set-up and will make irrigation schedule adjustments, including run times and required cycles, throughout the irrigation season without human intervention. Approved systems will include a programmable irrigation controller and a weather based controller. \nSoil moisture sensor (SMS). A device which is either wired or connecting to the program controller to override an irrigation system&#8217;s cycle when there is a determined level of moisture within the soil. \nThe Irrigation Association® (IA). A specific non-profit organization established to improve the products and practices used to manage water resources and to help shape the worldwide business environment of the irrigation industry. The IA has developed irrigation certification, audit guidelines and audit result worksheets to facilitate sustainable water management. \nWater conservation device. An approved water conservation device, properly installed to improve water use efficiency within the irrigation system. These devices include: rain shutoff device, soil moisture sensors, weather stations, high-wind shutoff device, freeze protection devices, flow meter with totalizer, automated control system, matched precipitation rate nozzles, flow control nozzles, pressure regulators, multi-stream rotating nozzles, high flow shut-offs, and drip and micro- irrigation technologies. \nWater demand average. The average daily amount of water pumped from the City water plant(s) for the previous thirty (30) day period. \nWater shortage. A &#8220;water shortage&#8221; shall exist when the demands and requirements of water customers served by the City cannot be satisfied without depleting the water supply to or below a critical level, the level at which the continued availability of water for human consumption, sanitation and fire protection is jeopardized. \nWater Shortage Response Plan. A document which establishes authority for declaration of a water shortage, defines different stages of water shortage severity, and outlines appropriate responses for each stage. \nWeather-based sensor. A sensor that measures local weather conditions such as rain, temperature, soil conditions and\/or evapotranspiration. The City Code requires each system to incorporate two (2) sensors, each monitoring a separate weather characteristic, to be used as an add-on device to suspend irrigation cycles when watering is deemed unnecessary by the conditions of the sensor. \n(Ord. No. 2007-235, §1, 5-15-07; Ord. No. 2010-704, §§1, 2, 2-16-10, eff. 7-1-10; Ord. No. 2011-982, §1, 12-6-11)","text":{"0":{"id":"911","text":"As used in this article, the following terms shall have the meanings provided in this section unless the context clearly indicates otherwise. \nAdd-on device. A device utilized in combination with a programmable timer to measure local weather conditions such as rain, temperature, soil conditions and\/or evapotranspiration, and will have the capability, at a minimum, to be installed as an interrupt-type device on the common and\/or control wires for the controller. Such device will serve as a secondary shut-off device to assist in optimal watering conditions due to current climate conditions. \nApproved (or approval). Approved or approval means certified in writing by the Public Utilities Director as an acceptable water conservation device, program or methodology for the purpose of water conservation. \nAudit results. Licensed irrigation contractors will use the Landscape Worksheet provided by the Irrigation Association and submit this documentation to the City of Raleigh within two weeks of the irrigation audit&#8217;s completion. \nAvailable water supply. The total amount of water that is available to the City in the water supply pool(s). The U.S. Army Corps of Engineers will determine this amount for Falls Lake once the water level in Falls Lake drops below two hundred fifty-one and one-half (251.5) feet Mean Sea Level. \nAutomatic spray irrigation system. Any installed irrigation system that can be programmed to operate during certain times and\/or conditions and which is connect to the City&#8217;s public water supply system. \nBest Management Practice (BMP). A management practice that is designed to reduce water usage and protect water quality. \nCertified conservation user. A certified conservation user is a consumer who complies with the City of Raleigh Water Conservation Program. \nCity. City in this article means the City of Raleigh. \nCity reuse water. Effluent water from City facilities, including the City E.M. Johnson Water Treatment Plant, Smith Creek Wastewater Treatment Plant, Little Creek Wastewater Treatment Plant and\/or Neuse River Wastewater Treatment Plant, which meets or exceeds the minimum quality requirements of the current North Carolina Reuse and Reclaimed Water Quality Standards. \nConservation (or conserve). Conservation or conserve means any beneficial reduction in water loss, waste, or use. \nConservation device. An approved water conservation device, properly installed within a private plumbing or distribution system, to improve water use efficiency within the City water supply system. \nConservation program. A program that identifies the uses of water within residential users, industry groups, commercial and\/or industrial applications, which focuses on BMPs to reduce the consumption of water. The program will be submitted to Public Utilities for review and approval. Each conservation program should be updated as required by the Public Utilities Director. All certified conservation users should be publicly recognized as water savers. \nConsumer. Any person, business, corporation, institution, resident or industry responsible for any property at which water from the City of Raleigh public water supply is received. In the absence of other parties or the failure of other parties to accept the responsibilities herein set forth, the owner of record of the real property shall be ultimately responsible. \nDistribution Uniformity (DU). A measurement to determine the performance of installed irrigation systems; expresses the uniformity of applied irrigation water over an irrigated zone; expressed as a ratio of the average of the lowest twenty-five (25) per cent of measurements to the overall average measurement, gathered through the use of catch cans, commonly used to evaluate the coverage of one or more sprinklers or drip systems. The equation is expressed by that of DULQ:  \nVLQ = average of the lowest twenty-five (25) per cent (lower quarter) of catch cans measurements, ml. \nVavg = average all catch cans, ml. \nDistribution uniformity as measured by the low quarter distribution (DULQ) is a common measurement of efficiency. This distribution uniformity is determined by the following: \nEvapotranspiration (ET) sensor. A sensor that reads current, local ET data from a server and then adjusts the irrigation system&#8217;s run-times accordingly. \nHand held hose. Any hose that is connected to the City&#8217;s public water supply system and held in the hand during irrigation use. \nHose end sprinkler. An irrigation device that is connected to the City&#8217;s public water supply system and is not designed to be held in the hand during use. Examples are: single stream, multi-stream, and impact type sprinklers. \nHydrant meter. A water meter specifically designed, fabricated and leased from the City of Raleigh Public Utilities Department for consumers to purchase water from the City from fire hydrants in accordance with the City&#8217;s Hydrant Meter Program. \nIrrigation audit. The licensed irrigation contractor will follow the guidelines set forth by the Irrigation Association&#8217;s (IA) Irrigation Audit Guidelines (found in the Public Utilities Handbook and at: http:\/\/www.irrigation.org) to conduct an irrigation audit. The overall system must maintain a distribution uniformity (DU) of no less than fifty (50) per cent, and the results of said audit must be submitted to the City for approval in the format provided by the Irrigation Association. The auditor should inspect the installation of the backflow prevention assembly, main line, laterals, valves, sprinkler heads, drip\/micro-irrigation equipment, control wire, controller, rain sensor, timer or controller and any other water conserving devices, and should assure that the intent of the irrigation designer or consultant has been preserved. In addition, the audit shall also verify the installation of specified water management devices such as a rain shutoff device and\/or soil moisture sensors. Finally, the irrigation schedule shall be evaluated to assure that the irrigation system meets the supplemental water needs of the plants without wasting water. Systems which fail to meet the standards of the audit will have a period of two (2) weeks to correct the problem or result in having their irrigation service interrupted. \nIrrigation system. Set of components which may include a hose, piping, fittings, sprinklers, drip tubing, valves, and control wiring connected to a water source or water distribution network which is used to apply water to residential or commercial lawns, landscapes or other areas. \nLicensed irrigation contractor. A licensed irrigation contractor is an irrigation professional, who has met a set of minimum standards specified by the North Carolina Irrigation Contractors&#8217; Licensing Board under Chapter 89G of the North Carolina General Statutes. \nMajor water user. A water customer who uses one hundred thousand (100,000) gallons per day (GPD) or more per account as determined on either an annual or an average day during the City seasonal water demand period. \nNon-automatic spray irrigation system. Any installed irrigation system that is connected to the City&#8217;s public water supply system and which is operated manually. \nOn-site reuse water. On-site reuse water is effluent water from an individual on-site wastewater system which meets or exceeds the minimum requirements of the current North Carolina Reuse and Reclaimed Water Quality Standards. \nPotable water. Potable water is the water from the public water supply system of the City which meets or exceeds the minimum requirements of the current Federal and North Carolina Safe Drinking Water Act. \nProgrammable timer. An automatic timing device, connected either wired or wireless to remotely control valves and irrigation heads according to a set irrigation schedule. An approved timer must: (a) have the ability to program mandatory watering restrictions to include days and times; (b) register run-times as low as one-minute increments; and (c) be connected to an approved water conservation add-on device which will block the operation of the system if irrigation is unnecessary. \nProjection period. The remaining number of days in the calendar year from the date of the water supply projection, plus sixty (60) days. \nPublic water supply. The water supply of the City, and its customers for general use and which supply is recognized as the public water supply of the City by the North Carolina Department of Environment and Natural Resources. \nRain sensor (RS) or rain shut-off device or rain switch. A device designed to interrupt an automatic irrigation system&#8217;s cycle during periods of rain. Approved rain sensors, rain shut-off, or rain switch will be designed to shut off after one-fourth (¼) of an inch of rain has fallen, and be at least five (5) feet from a house or building. \nReuse water. City reuse water and\/or on-site reuse water. \nRoot zone (RZ). The depth of the soil from which the crop roots extract water and nutrients. \nRun-times (RT). The operating time of an irrigation zone for a single irrigation cycle. \nSeasonal demand period. The period of time from April 1st through November 30th. \nSmart controller. Smart controllers estimate or measure the available soil moisture, rainfall, wind, slope, soil, plant type, temperature (and more) of local conditions to operate an irrigation system, replenishing water as needed while maximizing water efficiency. A properly programmed smart controller requires initial site specific set-up and will make irrigation schedule adjustments, including run times and required cycles, throughout the irrigation season without human intervention. Approved systems will include a programmable irrigation controller and a weather based controller. \nSoil moisture sensor (SMS). A device which is either wired or connecting to the program controller to override an irrigation system&#8217;s cycle when there is a determined level of moisture within the soil. \nThe Irrigation Association® (IA). A specific non-profit organization established to improve the products and practices used to manage water resources and to help shape the worldwide business environment of the irrigation industry. The IA has developed irrigation certification, audit guidelines and audit result worksheets to facilitate sustainable water management. \nWater conservation device. An approved water conservation device, properly installed to improve water use efficiency within the irrigation system. These devices include: rain shutoff device, soil moisture sensors, weather stations, high-wind shutoff device, freeze protection devices, flow meter with totalizer, automated control system, matched precipitation rate nozzles, flow control nozzles, pressure regulators, multi-stream rotating nozzles, high flow shut-offs, and drip and micro- irrigation technologies. \nWater demand average. The average daily amount of water pumped from the City water plant(s) for the previous thirty (30) day period. \nWater shortage. A &#8220;water shortage&#8221; shall exist when the demands and requirements of water customers served by the City cannot be satisfied without depleting the water supply to or below a critical level, the level at which the continued availability of water for human consumption, sanitation and fire protection is jeopardized. \nWater Shortage Response Plan. A document which establishes authority for declaration of a water shortage, defines different stages of water shortage severity, and outlines appropriate responses for each stage. \nWeather-based sensor. A sensor that measures local weather conditions such as rain, temperature, soil conditions and\/or evapotranspiration. The City Code requires each system to incorporate two (2) sensors, each monitoring a separate weather characteristic, to be used as an add-on device to suspend irrigation cycles when watering is deemed unnecessary by the conditions of the sensor. \n(Ord. No. 2007-235, §1, 5-15-07; Ord. No. 2010-704, §§1, 2, 2-16-10, eff. 7-1-10; Ord. No. 2011-982, §1, 12-6-11)","type":"section","prefixes":[""],"prefix":"","entire_prefix":"","prefix_anchor":"","level":1}},"ancestry":{"1":{"id":"97","name":"ARTICLE E. - WATER CONSERVATION PLAN [6]","identifier":"E","label":"article","url":"\/II\/8\/2\/E\/"},"2":{"id":"88","name":"CHAPTER 2. - WATER AND SEWER SERVICE","identifier":"2","label":"chapter","url":"\/II\/8\/2\/"},"3":{"id":"84","name":"PART 8 - PUBLIC UTILITIES","identifier":"8","label":"part","url":"\/II\/8\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"291","structure_id":"97","section_number":"8-2161","catch_line":"PURPOSE AND INTENT.","url":"\/8-2161\/","token":"8-2161"},"1":{"id":"293","structure_id":"97","section_number":"8-2162","catch_line":"OBJECTIVE.","url":"\/8-2162\/","token":"8-2162"},"2":{"id":"294","structure_id":"97","section_number":"8-2163","catch_line":"DEFINITIONS.","url":"\/8-2163\/","token":"8-2163"},"3":{"id":"295","structure_id":"97","section_number":"8-2164","catch_line":"COMPLIANCE WITH FEDERAL AND STATE LAW.","url":"\/8-2164\/","token":"8-2164"},"4":{"id":"296","structure_id":"97","section_number":"8-2165","catch_line":"UNLAWFUL WATER USES.","url":"\/8-2165\/","token":"8-2165"},"5":{"id":"297","structure_id":"97","section_number":"8-2166","catch_line":"INSPECTION OF PROPERTY.","url":"\/8-2166\/","token":"8-2166"},"6":{"id":"298","structure_id":"97","section_number":"8-2167","catch_line":"RIGHT OF ACCESS.","url":"\/8-2167\/","token":"8-2167"},"7":{"id":"299","structure_id":"97","section_number":"8-2168","catch_line":"WATER METERING AND WATER USE AUDITS.","url":"\/8-2168\/","token":"8-2168"},"8":{"id":"300","structure_id":"97","section_number":"8-2169","catch_line":"LANDSCAPE WATER EFFICIENCY.","url":"\/8-2169\/","token":"8-2169"},"9":{"id":"301","structure_id":"97","section_number":"8-2170","catch_line":"MAJOR WATER USERS.","url":"\/8-2170\/","token":"8-2170"},"10":{"id":"302","structure_id":"97","section_number":"8-2171","catch_line":"RESERVED.","url":"\/8-2171\/","token":"8-2171"},"11":{"id":"304","structure_id":"97","section_number":"8-2172","catch_line":"WATER USE MONITORING.","url":"\/8-2172\/","token":"8-2172"},"12":{"id":"305","structure_id":"97","section_number":"8-2173","catch_line":"EDUCATION.","url":"\/8-2173\/","token":"8-2173"},"13":{"id":"306","structure_id":"97","section_number":"8-2174","catch_line":"CONSERVATION WATER RATE.","url":"\/8-2174\/","token":"8-2174"},"14":{"id":"307","structure_id":"97","section_number":"8-2175","catch_line":"MANDATORY WATER USE RESTRICTIONS.","url":"\/8-2175\/","token":"8-2175"},"15":{"id":"308","structure_id":"97","section_number":"8-2176","catch_line":"VOLUNTARY WATER USE MEASURES.","url":"\/8-2176\/","token":"8-2176"},"16":{"id":"309","structure_id":"97","section_number":"8-2177","catch_line":"ENFORCEMENT.","url":"\/8-2177\/","token":"8-2177"},"17":{"id":"310","structure_id":"97","section_number":"8-2178","catch_line":"RALEIGH WATER SHORTAGE RESPONSE PLAN.","url":"\/8-2178\/","token":"8-2178"},"18":{"id":"311","structure_id":"97","section_number":"8-2179","catch_line":"RESERVED.","url":"\/8-2179\/","token":"8-2179"}},"previous_section":{"id":"293","structure_id":"97","section_number":"8-2162","catch_line":"OBJECTIVE.","url":"\/8-2162\/","token":"8-2162"},"next_section":{"id":"295","structure_id":"97","section_number":"8-2164","catch_line":"COMPLIANCE WITH FEDERAL AND STATE LAW.","url":"\/8-2164\/","token":"8-2164"},"references":false,"formats":{"txt":"\/8-2163.txt","json":"\/8-2163.xml"},"dublin_core":{"Title":"DEFINITIONS.","Type":"Text","Format":"text\/html","Identifier":"§ 8-2163","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nDEFINITIONS. (§ 8-2163)\n\nAs used in this article, the following terms shall have the meanings provided in\nthis section unless the context clearly indicates otherwise. \nAdd-on device. A device utilized in combination with a programmable timer to\nmeasure local weather conditions such as rain, temperature, soil conditions\nand\/or evapotranspiration, and will have the capability, at a minimum, to be\ninstalled as an interrupt-type device on the common and\/or control wires for the\ncontroller. Such device will serve as a secondary shut-off device to assist in\noptimal watering conditions due to current climate conditions. \nApproved (or approval). Approved or approval means certified in writing by the\nPublic Utilities Director as an acceptable water conservation device, program or\nmethodology for the purpose of water conservation. \nAudit results. Licensed irrigation contractors will use the Landscape Worksheet\nprovided by the Irrigation Association and submit this documentation to the City\nof Raleigh within two weeks of the irrigation audit&#8217;s completion. \nAvailable water supply. The total amount of water that is available to the City\nin the water supply pool(s). The U.S. Army Corps of Engineers will determine\nthis amount for Falls Lake once the water level in Falls Lake drops below two\nhundred fifty-one and one-half (251.5) feet Mean Sea Level. \nAutomatic spray irrigation system. Any installed irrigation system that can be\nprogrammed to operate during certain times and\/or conditions and which is\nconnect to the City&#8217;s public water supply system. \nBest Management Practice (BMP). A management practice that is designed to reduce\nwater usage and protect water quality. \nCertified conservation user. A certified conservation user is a consumer who\ncomplies with the City of Raleigh Water Conservation Program. \nCity. City in this article means the City of Raleigh. \nCity reuse water. Effluent water from City facilities, including the City E.M.\nJohnson Water Treatment Plant, Smith Creek Wastewater Treatment Plant, Little\nCreek Wastewater Treatment Plant and\/or Neuse River Wastewater Treatment Plant,\nwhich meets or exceeds the minimum quality requirements of the current North\nCarolina Reuse and Reclaimed Water Quality Standards. \nConservation (or conserve). Conservation or conserve means any beneficial\nreduction in water loss, waste, or use. \nConservation device. An approved water conservation device, properly installed\nwithin a private plumbing or distribution system, to improve water use\nefficiency within the City water supply system. \nConservation program. A program that identifies the uses of water within\nresidential users, industry groups, commercial and\/or industrial applications,\nwhich focuses on BMPs to reduce the consumption of water. The program will be\nsubmitted to Public Utilities for review and approval. Each conservation program\nshould be updated as required by the Public Utilities Director. All certified\nconservation users should be publicly recognized as water savers. \nConsumer. Any person, business, corporation, institution, resident or industry\nresponsible for any property at which water from the City of Raleigh public\nwater supply is received. In the absence of other parties or the failure of\nother parties to accept the responsibilities herein set forth, the owner of\nrecord of the real property shall be ultimately responsible. \nDistribution Uniformity (DU). A measurement to determine the performance of\ninstalled irrigation systems; expresses the uniformity of applied irrigation\nwater over an irrigated zone; expressed as a ratio of the average of the lowest\ntwenty-five (25) per cent of measurements to the overall average measurement,\ngathered through the use of catch cans, commonly used to evaluate the coverage\nof one or more sprinklers or drip systems. The equation is expressed by that of\nDULQ:  \nVLQ = average of the lowest twenty-five (25) per cent (lower quarter) of catch\ncans measurements, ml. \nVavg = average all catch cans, ml. \nDistribution uniformity as measured by the low quarter distribution (DULQ) is a\ncommon measurement of efficiency. This distribution uniformity is determined by\nthe following: \nEvapotranspiration (ET) sensor. A sensor that reads current, local ET data from\na server and then adjusts the irrigation system&#8217;s run-times accordingly. \nHand held hose. Any hose that is connected to the City&#8217;s public water\nsupply system and held in the hand during irrigation use. \nHose end sprinkler. An irrigation device that is connected to the City&#8217;s\npublic water supply system and is not designed to be held in the hand during\nuse. Examples are: single stream, multi-stream, and impact type sprinklers. \nHydrant meter. A water meter specifically designed, fabricated and leased from\nthe City of Raleigh Public Utilities Department for consumers to purchase water\nfrom the City from fire hydrants in accordance with the City&#8217;s Hydrant\nMeter Program. \nIrrigation audit. The licensed irrigation contractor will follow the guidelines\nset forth by the Irrigation Association&#8217;s (IA) Irrigation Audit Guidelines\n(found in the Public Utilities Handbook and at: http:\/\/www.irrigation.org) to\nconduct an irrigation audit. The overall system must maintain a distribution\nuniformity (DU) of no less than fifty (50) per cent, and the results of said\naudit must be submitted to the City for approval in the format provided by the\nIrrigation Association. The auditor should inspect the installation of the\nbackflow prevention assembly, main line, laterals, valves, sprinkler heads,\ndrip\/micro-irrigation equipment, control wire, controller, rain sensor, timer or\ncontroller and any other water conserving devices, and should assure that the\nintent of the irrigation designer or consultant has been preserved. In addition,\nthe audit shall also verify the installation of specified water management\ndevices such as a rain shutoff device and\/or soil moisture sensors. Finally, the\nirrigation schedule shall be evaluated to assure that the irrigation system\nmeets the supplemental water needs of the plants without wasting water. Systems\nwhich fail to meet the standards of the audit will have a period of two (2)\nweeks to correct the problem or result in having their irrigation service\ninterrupted. \nIrrigation system. Set of components which may include a hose, piping, fittings,\nsprinklers, drip tubing, valves, and control wiring connected to a water source\nor water distribution network which is used to apply water to residential or\ncommercial lawns, landscapes or other areas. \nLicensed irrigation contractor. A licensed irrigation contractor is an\nirrigation professional, who has met a set of minimum standards specified by the\nNorth Carolina Irrigation Contractors&#8217; Licensing Board under Chapter 89G\nof the North Carolina General Statutes. \nMajor water user. A water customer who uses one hundred thousand (100,000)\ngallons per day (GPD) or more per account as determined on either an annual or\nan average day during the City seasonal water demand period. \nNon-automatic spray irrigation system. Any installed irrigation system that is\nconnected to the City&#8217;s public water supply system and which is operated\nmanually. \nOn-site reuse water. On-site reuse water is effluent water from an individual\non-site wastewater system which meets or exceeds the minimum requirements of the\ncurrent North Carolina Reuse and Reclaimed Water Quality Standards. \nPotable water. Potable water is the water from the public water supply system of\nthe City which meets or exceeds the minimum requirements of the current Federal\nand North Carolina Safe Drinking Water Act. \nProgrammable timer. An automatic timing device, connected either wired or\nwireless to remotely control valves and irrigation heads according to a set\nirrigation schedule. An approved timer must: (a) have the ability to program\nmandatory watering restrictions to include days and times; (b) register\nrun-times as low as one-minute increments; and (c) be connected to an approved\nwater conservation add-on device which will block the operation of the system if\nirrigation is unnecessary. \nProjection period. The remaining number of days in the calendar year from the\ndate of the water supply projection, plus sixty (60) days. \nPublic water supply. The water supply of the City, and its customers for general\nuse and which supply is recognized as the public water supply of the City by the\nNorth Carolina Department of Environment and Natural Resources. \nRain sensor (RS) or rain shut-off device or rain switch. A device designed to\ninterrupt an automatic irrigation system&#8217;s cycle during periods of rain.\nApproved rain sensors, rain shut-off, or rain switch will be designed to shut\noff after one-fourth (¼) of an inch of rain has fallen, and be at least five\n(5) feet from a house or building. \nReuse water. City reuse water and\/or on-site reuse water. \nRoot zone (RZ). The depth of the soil from which the crop roots extract water\nand nutrients. \nRun-times (RT). The operating time of an irrigation zone for a single irrigation\ncycle. \nSeasonal demand period. The period of time from April 1st through November 30th.\n\nSmart controller. Smart controllers estimate or measure the available soil\nmoisture, rainfall, wind, slope, soil, plant type, temperature (and more) of\nlocal conditions to operate an irrigation system, replenishing water as needed\nwhile maximizing water efficiency. A properly programmed smart controller\nrequires initial site specific set-up and will make irrigation schedule\nadjustments, including run times and required cycles, throughout the irrigation\nseason without human intervention. Approved systems will include a programmable\nirrigation controller and a weather based controller. \nSoil moisture sensor (SMS). A device which is either wired or connecting to the\nprogram controller to override an irrigation system&#8217;s cycle when there is\na determined level of moisture within the soil. \nThe Irrigation Association® (IA). A specific non-profit organization\nestablished to improve the products and practices used to manage water resources\nand to help shape the worldwide business environment of the irrigation industry.\nThe IA has developed irrigation certification, audit guidelines and audit result\nworksheets to facilitate sustainable water management. \nWater conservation device. An approved water conservation device, properly\ninstalled to improve water use efficiency within the irrigation system. These\ndevices include: rain shutoff device, soil moisture sensors, weather stations,\nhigh-wind shutoff device, freeze protection devices, flow meter with totalizer,\nautomated control system, matched precipitation rate nozzles, flow control\nnozzles, pressure regulators, multi-stream rotating nozzles, high flow\nshut-offs, and drip and micro- irrigation technologies. \nWater demand average. The average daily amount of water pumped from the City\nwater plant(s) for the previous thirty (30) day period. \nWater shortage. A &#8220;water shortage&#8221; shall exist when the demands and\nrequirements of water customers served by the City cannot be satisfied without\ndepleting the water supply to or below a critical level, the level at which the\ncontinued availability of water for human consumption, sanitation and fire\nprotection is jeopardized. \nWater Shortage Response Plan. A document which establishes authority for\ndeclaration of a water shortage, defines different stages of water shortage\nseverity, and outlines appropriate responses for each stage. \nWeather-based sensor. A sensor that measures local weather conditions such as\nrain, temperature, soil conditions and\/or evapotranspiration. The City Code\nrequires each system to incorporate two (2) sensors, each monitoring a separate\nweather characteristic, to be used as an add-on device to suspend irrigation\ncycles when watering is deemed unnecessary by the conditions of the sensor. \n(Ord. No. 2007-235, §1, 5-15-07; Ord. No. 2010-704, §§1, 2, 2-16-10, eff.\n7-1-10; Ord. No. 2011-982, §1, 12-6-11)\n"}