{"law_id":"355","section_number":"9-10005","catch_line":"ACTIVITIES.","history":"","order_by":"9-10005","metadata":false,"url":"\/9-10005\/","token":"9-10005","structure":{"1":{"id":"108","name":"ARTICLE A. - GENERAL PROVISIONS","identifier":"A","label":"article","url":"\/II\/9\/10\/A\/"},"2":{"id":"107","name":"CHAPTER 10. - ARTS COMMISSION [8]","identifier":"10","label":"chapter","url":"\/II\/9\/10\/"},"3":{"id":"106","name":"PART 9 - PARKS, RECREATION AND CULTURAL AFFAIRS","identifier":"9","label":"part","url":"\/II\/9\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"referred_to_by":false,"edition_id":"1","section_id":"355","structure_id":"108","full_text":"(a) To initiate, sponsor, conduct or support, alone or in cooperation with other public or private agencies, public programs in the arts.\r\r(b) To serve as a clearinghouse for information about Raleigh artists, art programs, facilities, organizations and institutions and to actively encourage public awareness, utilization and support of such resources.\r\r(c) To advise the City as to the availability and adequacy of facilities and space for the presentation of cultural activities.\r\r(d) To review and advise on the aesthetic aspects of all works of art or designs or public monuments accepted or commissioned by the City.\r\r(e) To prepare and submit budgetary recommendations to the City Council and Manager for annual expenditures necessary to the continuation and development of public programs furthering the arts.\r\r(f) To review funding requests and recommend to the City Council the allocation of public monies to cultural organizations.\r\r(g) To seek out and encourage contributions and grants to the arts from private and public sources and to receive and allocate such monies appropriated and\/or granted and donated for such purposes.\r\r(h) To initiate proposals for Federal and state assistance to the arts, and to review arts-related proposals and programs originating with other City agencies.\r\r(i) To keep abreast of what other communities are doing to further the arts and to adapt their accomplishments to the needs of Raleigh.\r\r(j) To prepare an annual report on the activities of the commission and the State of the Arts in Raleigh.\n(1977-578, §5, 7-5-77)\r\r","text":{"0":{"id":"1037","text":"To initiate, sponsor, conduct or support, alone or in cooperation with other public or private agencies, public programs in the arts.","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"1038","text":"To serve as a clearinghouse for information about Raleigh artists, art programs, facilities, organizations and institutions and to actively encourage public awareness, utilization and support of such resources.","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"2":{"id":"1039","text":"To advise the City as to the availability and adequacy of facilities and space for the presentation of cultural activities.","type":"section","prefixes":["(c)"],"prefix":"(c)","entire_prefix":"(c)","prefix_anchor":"(c)","level":1},"3":{"id":"1040","text":"To review and advise on the aesthetic aspects of all works of art or designs or public monuments accepted or commissioned by the City.","type":"section","prefixes":["(d)"],"prefix":"(d)","entire_prefix":"(d)","prefix_anchor":"(d)","level":1},"4":{"id":"1041","text":"To prepare and submit budgetary recommendations to the City Council and Manager for annual expenditures necessary to the continuation and development of public programs furthering the arts.","type":"section","prefixes":["(e)"],"prefix":"(e)","entire_prefix":"(e)","prefix_anchor":"(e)","level":1},"5":{"id":"1042","text":"To review funding requests and recommend to the City Council the allocation of public monies to cultural organizations.","type":"section","prefixes":["(f)"],"prefix":"(f)","entire_prefix":"(f)","prefix_anchor":"(f)","level":1},"6":{"id":"1043","text":"To seek out and encourage contributions and grants to the arts from private and public sources and to receive and allocate such monies appropriated and\/or granted and donated for such purposes.","type":"section","prefixes":["(g)"],"prefix":"(g)","entire_prefix":"(g)","prefix_anchor":"(g)","level":1},"7":{"id":"1044","text":"To initiate proposals for Federal and state assistance to the arts, and to review arts-related proposals and programs originating with other City agencies.","type":"section","prefixes":["(h)"],"prefix":"(h)","entire_prefix":"(h)","prefix_anchor":"(h)","level":1},"8":{"id":"1045","text":"To keep abreast of what other communities are doing to further the arts and to adapt their accomplishments to the needs of Raleigh.","type":"section","prefixes":["(i)"],"prefix":"(i)","entire_prefix":"(i)","prefix_anchor":"(i)","level":1},"9":{"id":"1046","text":"To prepare an annual report on the activities of the commission and the State of the Arts in Raleigh.\n(1977-578, §5, 7-5-77)","type":"section","prefixes":["(j)"],"prefix":"(j)","entire_prefix":"(j)","prefix_anchor":"(j)","level":1}},"ancestry":{"1":{"id":"108","name":"ARTICLE A. - GENERAL PROVISIONS","identifier":"A","label":"article","url":"\/II\/9\/10\/A\/"},"2":{"id":"107","name":"CHAPTER 10. - ARTS COMMISSION [8]","identifier":"10","label":"chapter","url":"\/II\/9\/10\/"},"3":{"id":"106","name":"PART 9 - PARKS, RECREATION AND CULTURAL AFFAIRS","identifier":"9","label":"part","url":"\/II\/9\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"351","structure_id":"108","section_number":"9-10001","catch_line":"COMMISSION CREATED.","url":"\/9-10001\/","token":"9-10001"},"1":{"id":"352","structure_id":"108","section_number":"9-10002","catch_line":"MEMBERSHIP.","url":"\/9-10002\/","token":"9-10002"},"2":{"id":"353","structure_id":"108","section_number":"9-10003","catch_line":"ORGANIZATION.","url":"\/9-10003\/","token":"9-10003"},"3":{"id":"354","structure_id":"108","section_number":"9-10004","catch_line":"PURPOSES.","url":"\/9-10004\/","token":"9-10004"},"4":{"id":"355","structure_id":"108","section_number":"9-10005","catch_line":"ACTIVITIES.","url":"\/9-10005\/","token":"9-10005"}},"previous_section":{"id":"354","structure_id":"108","section_number":"9-10004","catch_line":"PURPOSES.","url":"\/9-10004\/","token":"9-10004"},"references":false,"formats":{"txt":"\/9-10005.txt","json":"\/9-10005.xml"},"dublin_core":{"Title":"ACTIVITIES.","Type":"Text","Format":"text\/html","Identifier":"§ 9-10005","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nACTIVITIES. (§ 9-10005)\n\n(a) To initiate, sponsor, conduct or support, alone or in cooperation with other\npublic or private agencies, public programs in the arts.\n\n(b) To serve as a clearinghouse for information about Raleigh artists, art\nprograms, facilities, organizations and institutions and to actively encourage\npublic awareness, utilization and support of such resources.\n\n(c) To advise the City as to the availability and adequacy of facilities and\nspace for the presentation of cultural activities.\n\n(d) To review and advise on the aesthetic aspects of all works of art or designs\nor public monuments accepted or commissioned by the City.\n\n(e) To prepare and submit budgetary recommendations to the City Council and\nManager for annual expenditures necessary to the continuation and development of\npublic programs furthering the arts.\n\n(f) To review funding requests and recommend to the City Council the allocation\nof public monies to cultural organizations.\n\n(g) To seek out and encourage contributions and grants to the arts from private\nand public sources and to receive and allocate such monies appropriated and\/or\ngranted and donated for such purposes.\n\n(h) To initiate proposals for Federal and state assistance to the arts, and to\nreview arts-related proposals and programs originating with other City agencies.\n\n(i) To keep abreast of what other communities are doing to further the arts and\nto adapt their accomplishments to the needs of Raleigh.\n\n(j) To prepare an annual report on the activities of the commission and the\nState of the Arts in Raleigh.\n(1977-578, §5, 7-5-77)\n"}