{"law_id":"1002","section_number":"I-III-3.9","catch_line":"REGULATION OF PRIVATE TRANSACTIONS BETWEEN CITY AND ITS OFFICIALS AND EMPLOYEES.","history":"","order_by":"3.9","metadata":false,"url":"\/I-III-3.9\/","token":"I-III-3.9","structure":{"1":{"id":"4","name":"ARTICLE III. - APPOINTMENT AND REMOVAL OF OFFICERS AND EMPLOYEES; INTEREST OF OFFICIALS IN CONTRACTS","identifier":"III","label":"article","url":"\/I\/III\/"},"2":{"id":"1","name":"Division I - Charter","identifier":"I","label":"division","url":"\/I\/"}},"referred_to_by":false,"edition_id":"1","section_id":"1002","structure_id":"4","full_text":"(a) No member of the City Council, official, or employee of the City of Raleigh shall be financially interested, or have any personal beneficial interest, either directly or indirectly, as agent, representative, or otherwise, in the purchase of, or contract for, or in furnishing any materials, equipment or supplies to the City of Raleigh, nor shall any official or employee of the City of Raleigh accept or receive, or agree to accept or receive, directly or indirectly, from any person, firm or corporation to whom any contract may be awarded or from whom any materials, equipment or supplies may be purchased by the City of Raleigh, by rebate, gift, or otherwise, any money or anything of value whatsoever, or any promise, obligation or contract for future reward or compensation, for recommending or procuring the use of any such materials, equipment or supplies by the City of Raleigh; no member of the City Council, official or employee of the City of Raleigh shall for his own personal benefit operate, directly or indirectly, any concession in any building or on any lands of the City of Raleigh, nor shall any official or employee of the City of Raleigh bid for or be awarded any contract granting concessionary rights of any nature or kind from the City of Raleigh; it shall be unlawful for any member of the City Council, official or employee of the City of Raleigh to bid for or to purchase or to contract to purchase from the City of Raleigh any real estate, equipment, materials, or supplies of any nature or kind whatsoever, either directly or indirectly, at either public or private sale, either singly or through, or jointly with any other person. Any member of the City Council, official, or employee of the City of Raleigh, who shall violate any provision of this section shall be guilty of a misdemeanor, and upon conviction, shall be punished as provided by statute in such cases. If the City Council shall find that any official or employee has violated any provision of this section, such official or employee may be forthwith discharged by the City Council or by the City Manager from the service of the City of Raleigh.\r\r(b) Notwithstanding the provisions of subsection (a), nothing herein shall be construed as preventing any official or employee covered by this section from purchasing a plot or plots from the City in a City-owned cemetery, nor shall any such official or employee be prohibited from participating in any rental or home ownership program sponsored or operated by the City, so long as the official or employee meets all the criteria for the program and so long as the income of the recipient does not exceed sixty-five (65) per cent of the median area income based on household size. Participants in such a program must commit to occupying the unit acquired or rented as their personal dwelling and must commit to reside there at least three years unless prevented from doing so by extraordinary circumstances such as divorce, transfer of job, or death. The award of any such housing assistance to an employee shall be noted in the minutes of the City Council. \n(S.L. 1991, Ch. 312, §1) \nAmendment note: 1991 Session Laws, Ch. 312, §3, amended §33 of Ch. 1184 Session Laws 1949 by designating the existing text subsection (a) and adding subsection (b). \nCross reference: Police officer purchase of revolver, 1981 Session Laws, Ch. 255.\r\r","text":{"0":{"id":"4833","text":"No member of the City Council, official, or employee of the City of Raleigh shall be financially interested, or have any personal beneficial interest, either directly or indirectly, as agent, representative, or otherwise, in the purchase of, or contract for, or in furnishing any materials, equipment or supplies to the City of Raleigh, nor shall any official or employee of the City of Raleigh accept or receive, or agree to accept or receive, directly or indirectly, from any person, firm or corporation to whom any contract may be awarded or from whom any materials, equipment or supplies may be purchased by the City of Raleigh, by rebate, gift, or otherwise, any money or anything of value whatsoever, or any promise, obligation or contract for future reward or compensation, for recommending or procuring the use of any such materials, equipment or supplies by the City of Raleigh; no member of the City Council, official or employee of the City of Raleigh shall for his own personal benefit operate, directly or indirectly, any concession in any building or on any lands of the City of Raleigh, nor shall any official or employee of the City of Raleigh bid for or be awarded any contract granting concessionary rights of any nature or kind from the City of Raleigh; it shall be unlawful for any member of the City Council, official or employee of the City of Raleigh to bid for or to purchase or to contract to purchase from the City of Raleigh any real estate, equipment, materials, or supplies of any nature or kind whatsoever, either directly or indirectly, at either public or private sale, either singly or through, or jointly with any other person. Any member of the City Council, official, or employee of the City of Raleigh, who shall violate any provision of this section shall be guilty of a misdemeanor, and upon conviction, shall be punished as provided by statute in such cases. If the City Council shall find that any official or employee has violated any provision of this section, such official or employee may be forthwith discharged by the City Council or by the City Manager from the service of the City of Raleigh.","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"4834","text":"Notwithstanding the provisions of subsection (a), nothing herein shall be construed as preventing any official or employee covered by this section from purchasing a plot or plots from the City in a City-owned cemetery, nor shall any such official or employee be prohibited from participating in any rental or home ownership program sponsored or operated by the City, so long as the official or employee meets all the criteria for the program and so long as the income of the recipient does not exceed sixty-five (65) per cent of the median area income based on household size. Participants in such a program must commit to occupying the unit acquired or rented as their personal dwelling and must commit to reside there at least three years unless prevented from doing so by extraordinary circumstances such as divorce, transfer of job, or death. The award of any such housing assistance to an employee shall be noted in the minutes of the City Council. \n(S.L. 1991, Ch. 312, §1) \nAmendment note: 1991 Session Laws, Ch. 312, §3, amended §33 of Ch. 1184 Session Laws 1949 by designating the existing text subsection (a) and adding subsection (b). \nCross reference: Police officer purchase of revolver, 1981 Session Laws, Ch. 255.","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1}},"ancestry":{"1":{"id":"4","name":"ARTICLE III. - APPOINTMENT AND REMOVAL OF OFFICERS AND EMPLOYEES; INTEREST OF OFFICIALS IN CONTRACTS","identifier":"III","label":"article","url":"\/I\/III\/"},"2":{"id":"1","name":"Division I - Charter","identifier":"I","label":"division","url":"\/I\/"}},"structure_contents":{"0":{"id":"17","structure_id":"4","section_number":"I-III-3.1","catch_line":"CITY MANAGER; APPOINTMENT.","url":"\/I-III-3.1\/","token":"I-III-3.1"},"1":{"id":"18","structure_id":"4","section_number":"I-III-3.2","catch_line":"POWERS AND DUTIES.","url":"\/I-III-3.2\/","token":"I-III-3.2"},"2":{"id":"19","structure_id":"4","section_number":"I-III-3.3","catch_line":"APPOINTMENT AND REMOVAL OF OFFICERS.","url":"\/I-III-3.3\/","token":"I-III-3.3"},"3":{"id":"20","structure_id":"4","section_number":"I-III-3.4","catch_line":"CONTROL OF OFFICERS AND EMPLOYEES.","url":"\/I-III-3.4\/","token":"I-III-3.4"},"4":{"id":"21","structure_id":"4","section_number":"I-III-3.5","catch_line":"CITY COUNCIL APPOINTMENTS.","url":"\/I-III-3.5\/","token":"I-III-3.5"},"5":{"id":"22","structure_id":"4","section_number":"I-III-3.6","catch_line":"COUNCIL NOT TO INTERFERE IN APPOINTMENTS OR REMOVALS BY CITY MANAGER.","url":"\/I-III-3.6\/","token":"I-III-3.6"},"6":{"id":"23","structure_id":"4","section_number":"I-III-3.7","catch_line":"SALARIES.","url":"\/I-III-3.7\/","token":"I-III-3.7"},"7":{"id":"1001","structure_id":"4","section_number":"I-III-3.8","catch_line":"BONDS REQUIRED OF OFFICIALS AND EMPLOYEES OF THE CITY.","url":"\/I-III-3.8\/","token":"I-III-3.8"},"8":{"id":"1002","structure_id":"4","section_number":"I-III-3.9","catch_line":"REGULATION OF PRIVATE TRANSACTIONS BETWEEN CITY AND ITS OFFICIALS AND EMPLOYEES.","url":"\/I-III-3.9\/","token":"I-III-3.9"}},"previous_section":{"id":"1001","structure_id":"4","section_number":"I-III-3.8","catch_line":"BONDS REQUIRED OF OFFICIALS AND EMPLOYEES OF THE CITY.","url":"\/I-III-3.8\/","token":"I-III-3.8"},"references":false,"formats":{"txt":"\/I-III-3.9.txt","json":"\/I-III-3.9.xml"},"dublin_core":{"Title":"REGULATION OF PRIVATE TRANSACTIONS BETWEEN CITY AND ITS OFFICIALS AND EMPLOYEES.","Type":"Text","Format":"text\/html","Identifier":"§ I-III-3.9","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nREGULATION OF PRIVATE TRANSACTIONS BETWEEN CITY AND ITS OFFICIALS AND EMPLOYEES.\n(§ I-III-3.9)\n\n(a) No member of the City Council, official, or employee of the City of Raleigh\nshall be financially interested, or have any personal beneficial interest,\neither directly or indirectly, as agent, representative, or otherwise, in the\npurchase of, or contract for, or in furnishing any materials, equipment or\nsupplies to the City of Raleigh, nor shall any official or employee of the City\nof Raleigh accept or receive, or agree to accept or receive, directly or\nindirectly, from any person, firm or corporation to whom any contract may be\nawarded or from whom any materials, equipment or supplies may be purchased by\nthe City of Raleigh, by rebate, gift, or otherwise, any money or anything of\nvalue whatsoever, or any promise, obligation or contract for future reward or\ncompensation, for recommending or procuring the use of any such materials,\nequipment or supplies by the City of Raleigh; no member of the City Council,\nofficial or employee of the City of Raleigh shall for his own personal benefit\noperate, directly or indirectly, any concession in any building or on any lands\nof the City of Raleigh, nor shall any official or employee of the City of\nRaleigh bid for or be awarded any contract granting concessionary rights of any\nnature or kind from the City of Raleigh; it shall be unlawful for any member of\nthe City Council, official or employee of the City of Raleigh to bid for or to\npurchase or to contract to purchase from the City of Raleigh any real estate,\nequipment, materials, or supplies of any nature or kind whatsoever, either\ndirectly or indirectly, at either public or private sale, either singly or\nthrough, or jointly with any other person. Any member of the City Council,\nofficial, or employee of the City of Raleigh, who shall violate any provision of\nthis section shall be guilty of a misdemeanor, and upon conviction, shall be\npunished as provided by statute in such cases. If the City Council shall find\nthat any official or employee has violated any provision of this section, such\nofficial or employee may be forthwith discharged by the City Council or by the\nCity Manager from the service of the City of Raleigh.\n\n(b) Notwithstanding the provisions of subsection (a), nothing herein shall be\nconstrued as preventing any official or employee covered by this section from\npurchasing a plot or plots from the City in a City-owned cemetery, nor shall any\nsuch official or employee be prohibited from participating in any rental or home\nownership program sponsored or operated by the City, so long as the official or\nemployee meets all the criteria for the program and so long as the income of the\nrecipient does not exceed sixty-five (65) per cent of the median area income\nbased on household size. Participants in such a program must commit to occupying\nthe unit acquired or rented as their personal dwelling and must commit to reside\nthere at least three years unless prevented from doing so by extraordinary\ncircumstances such as divorce, transfer of job, or death. The award of any such\nhousing assistance to an employee shall be noted in the minutes of the City\nCouncil. \n(S.L. 1991, Ch. 312, §1) \nAmendment note: 1991 Session Laws, Ch. 312, §3, amended §33 of Ch. 1184\nSession Laws 1949 by designating the existing text subsection (a) and adding\nsubsection (b). \nCross reference: Police officer purchase of revolver, 1981 Session Laws, Ch.\n255.\n"}