{"law_id":"14","section_number":"I-II-2.14","catch_line":"EXPRESS POWERS ENUMERATED.","history":"","order_by":"2.14","metadata":false,"url":"\/I-II-2.14\/","token":"I-II-2.14","structure":{"1":{"id":"3","name":"ARTICLE II. - LEGISLATION, GOVERNING BODY, GENERAL POWERS","identifier":"II","label":"article","url":"\/I\/II\/"},"2":{"id":"1","name":"Division I - Charter","identifier":"I","label":"division","url":"\/I\/"}},"referred_to_by":false,"edition_id":"1","section_id":"14","structure_id":"3","full_text":"(b) [Regulatory fee.] \nSubject to the conditions hereinafter set forth, the City of Raleigh, following the adoption of an ordinance or ordinances, shall have the right, power, and authority to impose and collect a regulatory fee defined herein as an open space project fee on all new construction within its City limits and extraterritorial jurisdiction.\r\r(d) The City Council of the City of Raleigh in proposing to undertake any loan guaranty or similar program for rehabilitation of private buildings is authorized to submit to its voters the question whether such program shall be undertaken, such referendum to be conducted pursuant to the general and local laws applicable to special elections in the City of Raleigh.\r\r","text":{"0":{"id":"23","text":"","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"24","text":"\tCapital costs. \n&#8220;Capital costs&#8221; shall mean costs spent for the purchase only of land for open space but not for development thereof. \n","type":"section","prefixes":["(a)","(1)"],"prefix":"(1)","entire_prefix":"(a)(1)","prefix_anchor":"(a)(1)","level":2},"2":{"id":"25","text":"\tOpen space project. \n&#8220;Open space project&#8221; shall mean either the acquisition of land for parks, greenways or open spaces or the construction of recreation facilities. \n","type":"section","prefixes":["(a)","(2)"],"prefix":"(2)","entire_prefix":"(a)(2)","prefix_anchor":"(a)(2)","level":2},"3":{"id":"26","text":"\tDeveloper. \n&#8220;Developer&#8221; shall mean an individual, corporation, partnership, organization, association, firm, political subdivision, or other legal entity constructing or creating new construction. \n","type":"section","prefixes":["(a)","(3)"],"prefix":"(3)","entire_prefix":"(a)(3)","prefix_anchor":"(a)(3)","level":2},"4":{"id":"27","text":"\tOpen space projects fee. \n&#8220;Open space projects fee&#8221; shall mean the charge imposed upon new construction pursuant to the grant of regulatory authority contained herein. \n","type":"section","prefixes":["(a)","(4)"],"prefix":"(4)","entire_prefix":"(a)(4)","prefix_anchor":"(a)(4)","level":2},"5":{"id":"28","text":"\tNew construction. \n&#8220;New construction&#8221; shall mean any new development, construction, or installation that results in real property improvement or which requires a building permit. This term shall include the installation of a mobile home and factory-built and modular housing. This term shall not include fences, billboards, poles, pipelines, transmission lines, advertising signs, or similar structures and improvements, or renovation and repairs, which do not generate the need for additional or expanded open space projects upon completion of the new construction. \n","type":"section","prefixes":["(a)","(5)"],"prefix":"(5)","entire_prefix":"(a)(5)","prefix_anchor":"(a)(5)","level":2},"6":{"id":"29","text":"[Regulatory fee.] \nSubject to the conditions hereinafter set forth, the City of Raleigh, following the adoption of an ordinance or ordinances, shall have the right, power, and authority to impose and collect a regulatory fee defined herein as an open space project fee on all new construction within its City limits and extraterritorial jurisdiction.","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"7":{"id":"30","text":"","type":"section","prefixes":["(c)"],"prefix":"(c)","entire_prefix":"(c)","prefix_anchor":"(c)","level":1},"8":{"id":"31","text":"\tNo open space project fee shall be enacted until the City Council has caused to be prepared a report containing: (i) a description of the anticipated capital costs to the City of each additional or expanded open space project; (ii) a description of the relevant characteristics of construction which give rise to additional or expanded open space projects; (iii) a plan for providing one or more open space projects has been prepared. \n","type":"section","prefixes":["(c)","(1)"],"prefix":"(1)","entire_prefix":"(c)(1)","prefix_anchor":"(c)(1)","level":2},"9":{"id":"32","text":"\tBefore adopting or amending any open space project fee ordinance authorized by this subdivision, the City Council shall hold a public hearing. A notice of the public hearing shall be given so as to conform with G.S. 160A-364, as it may be amended from time to time. No such ordinance shall be adopted or amended without receiving the Planning Commission&#8217;s recommendation to the City Council. If the Planning Commission shall fail to return a recommendation within sixty (60) days of submittal of an ordinance, the ordinance shall be returned to the City Council and deemed to have a favorable recommendation as submitted to the Planning Commission. \n","type":"section","prefixes":["(c)","(2)"],"prefix":"(2)","entire_prefix":"(c)(2)","prefix_anchor":"(c)(2)","level":2},"10":{"id":"33","text":"\tThe amount of each fee imposed and collected hereunder shall be based upon reasonable and uniform considerations of capital costs to be incurred by the City as a result of new construction and shall bear a reasonable relationship to such capital costs. Such fee shall be based upon reasonable classifications and rates which shall be uniformly applied to all members of a class; however, the fees may differ within zones which may be established depending on the special needs and costs of open space projects in such zones. To the extent that the developer acquires and dedicates open space for open space projects for which the use of the fee is designated, which immediately becomes the property of the City, or another unit of government, and which are not otherwise reimbursed by the City, the fee shall be reduced by an amount equal to the value of the open space dedications. \n","type":"section","prefixes":["(c)","(3)"],"prefix":"(3)","entire_prefix":"(c)(3)","prefix_anchor":"(c)(3)","level":2},"11":{"id":"34","text":"\tAll monies from fees collected hereunder shall be placed in a separate trust fund. Expenditures from such trust fund shall be matched by an equal sum of money appropriated from non-fee sources and shall be spent for open space projects located in the same zone in which the fees were collected. No expenditures from such trust fund shall be made for any purpose other than an open space project undertaken by the City, or by the City in conjunction with other units of government. Open space project fees shall be spent for those community service facilities authorized by this Section [subparagraph] (82) which the City provides within six years after its collection and within 10 years for those community service facilities authorized by this Section [subparagraph] (82) which the City provides in conjunction with other units of government. \nAmendment note: 1985 Session Laws, Ch. 498, §2, amended §22 of Ch. 1184 Session Laws 1949 by adding subparagraph (82). 1987 Session Laws, Ch. 514, §4, amended subparagraph (a)(2) by rewriting the first sentence; and §5 rewrote the first sentence of subparagraph (c)(4). \n","type":"section","prefixes":["(c)","(4)"],"prefix":"(4)","entire_prefix":"(c)(4)","prefix_anchor":"(c)(4)","level":2},"12":{"id":"35","text":"\t[Passage of necessary legislation.] \nThe City is authorized to enact ordinances, resolutions, rules and regulations that are reasonable, necessary or expedient to carry subdivisions (80), (81) and (82) into execution and effect. \nAmendment note: 1985 Session Laws, Ch. 498, §2, amended §22 of Ch. 1184 Session Laws 1949 by adding subparagraph (83). \n","type":"section","prefixes":["(c)","(83"],"prefix":"(83","entire_prefix":"(c)(83","prefix_anchor":"(c)(83","level":2},"13":{"id":"36","text":"\t[Supplementary nature of (80)(82).] \nThe powers conferred in subdivisions (80), (81) and (82) shall be supplementary in addition to all other powers and procedures authorized by any other general or local law. Assessments, charges, fees, or rates authorized by any other general or local law shall not be affected by the provisions of this section. Nothing contained in subdivisions (80), (81) and (82) shall be construed to prevent the use of facility fee proceeds to retire debt which was used to fund facility fee eligible project. \nAmendment note: 1985 Session Laws, Ch. 498, §2, amended §22 of Ch. 1184 Session Laws 1949 by adding subparagraph (84). 1987 Session Laws, Ch. 514, §1, amended subparagraph (84) by adding the third sentence. \n","type":"section","prefixes":["(c)","(84"],"prefix":"(84","entire_prefix":"(c)(84","prefix_anchor":"(c)(84","level":2},"14":{"id":"37","text":"\tCooperation with Federal agencies. \nThe City may enter into contracts or agreements with any agency or department of the United States Government in order to execute any undertaking. Such contracts or agreements may involve activities carried out to benefit a foreign government but the contract or agreement shall be with an agency or department of the United States Government and shall substantially comply with the requirements for interlocal agreements set out in G.S. 160A-464. \nAmendment note: 1991 Session Laws, Ch. 843, §1, amended §22 of Ch. 1184 Session Laws 1949 by adding subparagraph (85). §2 of the act declared the provisions applicable only to contracts or agreements entered into prior to Dec. 1, 1993. \n","type":"section","prefixes":["(c)","(85"],"prefix":"(85","entire_prefix":"(c)(85","prefix_anchor":"(c)(85","level":2},"15":{"id":"38","text":"\t[Development funds.] \nThe City Council may, as part of its land development ordinances, provide that in lieu of required street right-of-way improvements, a developer may be required to provide funds that the City may use for the construction of right-of-way improvements to serve the occupants, residents, or invitees of the subdivision or development and these funds may be used for improvements which serve more than one subdivision or development within the area. All funds received by the City pursuant to this paragraph shall be used only for development of right-of-way improvements, including design, land acquisition, and construction. However, the City may undertake these activities in conjunction with the Department of Transportation under an agreement between the City and the North Carolina Department of Transportation. The ordinance may require a combination of partial payment of funds and partial dedication of constructed improvements when the governing body of the City determines that a combination is in the best interest of the citizens of the area to be served. \n(S.L. 1949, Ch. 1184, §22; S.L. 1959, Ch. 813, §1; S.L. 1961, Ch. 220, §1; S.L. 1963, Ch. 87, §1; S.L. 1963, Ch. 714, §1; S.L. 1967, Ch. 71, §§1, 2; S.L. 1969, Ch. 383, §2; S.L. 1971, Ch. 1209, §1(a), (b); S.L. 1973, Ch. 319, §§1(g), (h)(1), (2); S.L. 1973, Ch. 850, §1; S.L. 1975, Ch. 537, §1; S.L. 1975, Ch. 561, §§38; S.L. 1979, Ch. 277, §1; S.L. 1981, Ch. 992, §1; S.L. 1981, Ch. 1166, §1; S.L. 1983, Ch. 159, §1; S.L. 1983, Ch. 272, §1; S.L. 1985, Ch. 35, §1; S.L. 1985, Ch. 498, §§1, 2; S.L. 1987, Ch. 365, §1; S.L. 1987, Ch. 514, §§16; S.L. 1989, Ch. 816, §1; S.L. 1991, Ch. 312, §§1, 2; S.L. 1991, Ch. 843, §§1, 2) \nAmendment note: 1987 Session Laws, Ch. 514, §6, amended §22 of Ch. 1184 Session Laws 1949 by adding subparagraph (86). \n","type":"section","prefixes":["(c)","(86"],"prefix":"(86","entire_prefix":"(c)(86","prefix_anchor":"(c)(86","level":2},"16":{"id":"39","text":"The City Council of the City of Raleigh in proposing to undertake any loan guaranty or similar program for rehabilitation of private buildings is authorized to submit to its voters the question whether such program shall be undertaken, such referendum to be conducted pursuant to the general and local laws applicable to special elections in the City of Raleigh.","type":"section","prefixes":["(d)"],"prefix":"(d)","entire_prefix":"(d)","prefix_anchor":"(d)","level":1},"17":{"id":"40","text":"","type":"section","prefixes":["(e)"],"prefix":"(e)","entire_prefix":"(e)","prefix_anchor":"(e)","level":1},"18":{"id":"41","text":"\t[Reservation of sites.] \nTo adopt ordinances providing for the reservation of sites for public buildings or rights-of-way for public facilities and utilities including but not limited to fire stations, police stations, streets, water systems and sanitary sewer systems. The City Council after recommendation by the Planning Commission shall determine the location and size of any such reservations and shall cause those locations to appear on the City&#8217;s Comprehensive Land Use Plan. If the City enacts ordinances pursuant to this authority those ordinances shall provide, in part, that any subdivision submitted for approval which includes any such reservation or any request for a building permit not involving subdivision approval which includes such a reservation, the administrative official charged with receiving such request shall give notice of the request to the City Council at its next regularly scheduled meeting. The Council shall decide at that meeting whether it still wishes to require the reservation. If the Council does wish the reservation, it shall have a period of seven (7) months in which to acquire the reserved area by purchase or by eminent domain. If the Council has not purchased the reservation interest or begun condemnation proceedings within the seven-month period, the subdivider or building permit applicant may treat the land as freed of the reservation. \nAmendment note: 1983 Session Laws, Ch. 272, §1, amended §22 of Ch. 1184 Session Laws 1949 by adding subparagraph (78). \n","type":"section","prefixes":["(e)","(78"],"prefix":"(78","entire_prefix":"(e)(78","prefix_anchor":"(e)(78","level":2},"19":{"id":"42","text":"\t[Street construction.] \nTo construct streets outside the corporate limits but within its extraterritorial jurisdiction. Such a street may be built only after a finding by the City Council that the street is essential to the operation of an orderly transportation system for the City and the surrounding urbanized area. Upon annexation of any area in which such streets are located, the City is authorized to make special assessments against the property benefited by the improvements which were installed prior to the annexation. The City is also authorized to reimburse for overwidth streets those who build streets outside the City limits but within the extraterritorial jurisdiction for the City through the subdivision process or any other development process. In order to effect this reimbursement the City is authorized to establish reimbursement zones and to determine reimbursement rates for each zone. \nAmendment note: 1983 Session Laws, Ch. 272, §1, amended §22 of Ch. 1184 Session Laws 1949 by adding subparagraph (79). \n(80)\tSite plans. \nThe City Council may as part of its zoning regulations require that a site plan be prepared, submitted, and approved prior to the issuance of a building permit for new construction, excluding renovation and repair of existing structures, and excluding accessory uses and their structures, unless such renovations and repairs and accessory uses shall cause an increase in the off-street parking requirement or a change in occupancy as occupancy is defined by the North Carolina State Building Code. Such local law shall specify the elements to be included in site plans submitted for approval in accordance with standards of the zoning code; such elements may include, where appropriate, those relating to off-street parking, driveway access, internal circulation, screening, signs, landscaping, architectural features, locations and dimensions of buildings, topography and grading, utilities, drainage structures, street and sidewalk improvements, loading and service areas, fire hydrants, and such other elements as may reasonably be related to the health, safety and general welfare of the community. Where appropriate, approval of site plans may be conditioned to include requirements that street and utility and drainage rights-of-way, open space and recreation areas be dedicated or reserved for the public, or street, drainage, recreation, and utility improvements be made to the same extent as required by the local subdivision regulations. This provision shall not apply to additions of less than five (5) per cent of gross floor area on an annual basis unless such addition causes an increase in the off-street parking requirement or a change in occupancy as occupancy is defined by the North Carolina State Building Code. The City Council shall prescribe procedures for review and approval of such site plans to insure that development of property shall conform to applicable zoning or other relevant laws or regulations, with approvals by designated City staff, or the City Council. Appeals shall lie from the staff to the City Council. The City Council may require that site plans be in conformity with previously approved subdivision plans for the same property; further, in the event of conflict between a requirement for site plan approval and requirements for previously approved subdivision plans, the latter shall control. \nAmendment note: 1985 Session Laws, Ch. 498, §1, amended §22 of Ch. 1184 Session Laws 1949 by adding subparagraph (80). 1987 Session Laws, Ch. 514, §2, amended subparagraph (80) by adding reference to drainage and open space and recreation areas in the third sentence. \n","type":"section","prefixes":["(e)","(79"],"prefix":"(79","entire_prefix":"(e)(79","prefix_anchor":"(e)(79","level":2},"20":{"id":"43","text":"\tRoad or drainage projects fee. \n","type":"section","prefixes":["(e)","(81"],"prefix":"(81","entire_prefix":"(e)(81","prefix_anchor":"(e)(81","level":2}},"ancestry":{"1":{"id":"3","name":"ARTICLE II. - LEGISLATION, GOVERNING BODY, GENERAL POWERS","identifier":"II","label":"article","url":"\/I\/II\/"},"2":{"id":"1","name":"Division I - Charter","identifier":"I","label":"division","url":"\/I\/"}},"structure_contents":{"0":{"id":"1044","structure_id":"3","section_number":"I-II-2.1","catch_line":"CITY COUNCIL CONSTITUTES GOVERNING BODY.","url":"\/I-II-2.1\/","token":"I-II-2.1"},"1":{"id":"9","structure_id":"3","section_number":"I-II-2.10","catch_line":"RULE AS TO FINAL EFFECTIVE DATE.","url":"\/I-II-2.10\/","token":"I-II-2.10"},"2":{"id":"10","structure_id":"3","section_number":"I-II-2.11","catch_line":"GRANTING OF FRANCHISES.","url":"\/I-II-2.11\/","token":"I-II-2.11"},"3":{"id":"11","structure_id":"3","section_number":"I-II-2.12","catch_line":"COMPENSATION AND ALLOWANCES PAID TO COUNCIL AND MAYOR.","url":"\/I-II-2.12\/","token":"I-II-2.12"},"4":{"id":"12","structure_id":"3","section_number":"I-II-2.13","catch_line":"GENERAL MUNICIPAL POWERS.","url":"\/I-II-2.13\/","token":"I-II-2.13"},"5":{"id":"14","structure_id":"3","section_number":"I-II-2.14","catch_line":"EXPRESS POWERS ENUMERATED.","url":"\/I-II-2.14\/","token":"I-II-2.14"},"6":{"id":"15","structure_id":"3","section_number":"I-II-2.15","catch_line":"EXTENSION OF APPLICATION OF HEALTH, SANITARY AND PROTECTIVE ORDINANCES.","url":"\/I-II-2.15\/","token":"I-II-2.15"},"7":{"id":"16","structure_id":"3","section_number":"I-II-2.16","catch_line":"INITIATIVE AND REFERENDUM.","url":"\/I-II-2.16\/","token":"I-II-2.16"},"8":{"id":"1055","structure_id":"3","section_number":"I-II-2.2","catch_line":"NUMBER AND ELECTION OF MEMBERS OF CITY COUNCIL.","url":"\/I-II-2.2\/","token":"I-II-2.2"},"9":{"id":"1066","structure_id":"3","section_number":"I-II-2.3","catch_line":"POWER AND ORGANIZATION OF CITY COUNCIL.","url":"\/I-II-2.3\/","token":"I-II-2.3"},"10":{"id":"3","structure_id":"3","section_number":"I-II-2.4","catch_line":"MEETINGS OF THE CITY COUNCIL.","url":"\/I-II-2.4\/","token":"I-II-2.4"},"11":{"id":"4","structure_id":"3","section_number":"I-II-2.5","catch_line":"QUORUM AND CONDUCT OF BUSINESS.","url":"\/I-II-2.5\/","token":"I-II-2.5"},"12":{"id":"5","structure_id":"3","section_number":"I-II-2.6","catch_line":"ADOPTION OF RULES OF PROCEDURE; MEETINGS OPEN TO PUBLIC.","url":"\/I-II-2.6\/","token":"I-II-2.6"},"13":{"id":"6","structure_id":"3","section_number":"I-II-2.7","catch_line":"ORDINANCES; VOTE FOR FINAL PASSAGE, AMENDMENT BY ORDINANCE.","url":"\/I-II-2.7\/","token":"I-II-2.7"},"14":{"id":"7","structure_id":"3","section_number":"I-II-2.8","catch_line":"EFFECTIVE DATE.","url":"\/I-II-2.8\/","token":"I-II-2.8"},"15":{"id":"8","structure_id":"3","section_number":"I-II-2.9","catch_line":"EXCEPTIONS AS TO NEWSPAPER PUBLICATION OF CODE OF ORDINANCES.","url":"\/I-II-2.9\/","token":"I-II-2.9"}},"previous_section":{"id":"12","structure_id":"3","section_number":"I-II-2.13","catch_line":"GENERAL MUNICIPAL POWERS.","url":"\/I-II-2.13\/","token":"I-II-2.13"},"next_section":{"id":"15","structure_id":"3","section_number":"I-II-2.15","catch_line":"EXTENSION OF APPLICATION OF HEALTH, SANITARY AND PROTECTIVE ORDINANCES.","url":"\/I-II-2.15\/","token":"I-II-2.15"},"references":false,"formats":{"txt":"\/I-II-2.14.txt","json":"\/I-II-2.14.xml"},"dublin_core":{"Title":"EXPRESS POWERS ENUMERATED.","Type":"Text","Format":"text\/html","Identifier":"§ I-II-2.14","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nEXPRESS POWERS ENUMERATED. (§ I-II-2.14)\n\n(a) \n\n   (1) \tCapital costs. \n   &#8220;Capital costs&#8221; shall mean costs spent for the purchase only of\n   land for open space but not for development thereof. \n   \n\n   (2) \tOpen space project. \n   &#8220;Open space project&#8221; shall mean either the acquisition of land for\n   parks, greenways or open spaces or the construction of recreation facilities.\n   \n   \n\n   (3) \tDeveloper. \n   &#8220;Developer&#8221; shall mean an individual, corporation, partnership,\n   organization, association, firm, political subdivision, or other legal entity\n   constructing or creating new construction. \n   \n\n   (4) \tOpen space projects fee. \n   &#8220;Open space projects fee&#8221; shall mean the charge imposed upon new\n   construction pursuant to the grant of regulatory authority contained herein. \n   \n\n   (5) \tNew construction. \n   &#8220;New construction&#8221; shall mean any new development, construction,\n   or installation that results in real property improvement or which requires a\n   building permit. This term shall include the installation of a mobile home and\n   factory-built and modular housing. This term shall not include fences,\n   billboards, poles, pipelines, transmission lines, advertising signs, or\n   similar structures and improvements, or renovation and repairs, which do not\n   generate the need for additional or expanded open space projects upon\n   completion of the new construction. \n   \n\n(b) [Regulatory fee.] \nSubject to the conditions hereinafter set forth, the City of Raleigh, following\nthe adoption of an ordinance or ordinances, shall have the right, power, and\nauthority to impose and collect a regulatory fee defined herein as an open space\nproject fee on all new construction within its City limits and extraterritorial\njurisdiction.\n\n(c) \n\n   (1) \tNo open space project fee shall be enacted until the City Council has\n   caused to be prepared a report containing: (i) a description of the\n   anticipated capital costs to the City of each additional or expanded open\n   space project; (ii) a description of the relevant characteristics of\n   construction which give rise to additional or expanded open space projects;\n   (iii) a plan for providing one or more open space projects has been prepared.\n   \n   \n\n   (2) \tBefore adopting or amending any open space project fee ordinance\n   authorized by this subdivision, the City Council shall hold a public hearing.\n   A notice of the public hearing shall be given so as to conform with G.S.\n   160A-364, as it may be amended from time to time. No such ordinance shall be\n   adopted or amended without receiving the Planning Commission&#8217;s\n   recommendation to the City Council. If the Planning Commission shall fail to\n   return a recommendation within sixty (60) days of submittal of an ordinance,\n   the ordinance shall be returned to the City Council and deemed to have a\n   favorable recommendation as submitted to the Planning Commission. \n   \n\n   (3) \tThe amount of each fee imposed and collected hereunder shall be based\n   upon reasonable and uniform considerations of capital costs to be incurred by\n   the City as a result of new construction and shall bear a reasonable\n   relationship to such capital costs. Such fee shall be based upon reasonable\n   classifications and rates which shall be uniformly applied to all members of a\n   class; however, the fees may differ within zones which may be established\n   depending on the special needs and costs of open space projects in such zones.\n   To the extent that the developer acquires and dedicates open space for open\n   space projects for which the use of the fee is designated, which immediately\n   becomes the property of the City, or another unit of government, and which are\n   not otherwise reimbursed by the City, the fee shall be reduced by an amount\n   equal to the value of the open space dedications. \n   \n\n   (4) \tAll monies from fees collected hereunder shall be placed in a separate\n   trust fund. Expenditures from such trust fund shall be matched by an equal sum\n   of money appropriated from non-fee sources and shall be spent for open space\n   projects located in the same zone in which the fees were collected. No\n   expenditures from such trust fund shall be made for any purpose other than an\n   open space project undertaken by the City, or by the City in conjunction with\n   other units of government. Open space project fees shall be spent for those\n   community service facilities authorized by this Section [subparagraph] (82)\n   which the City provides within six years after its collection and within 10\n   years for those community service facilities authorized by this Section\n   [subparagraph] (82) which the City provides in conjunction with other units of\n   government. \n   Amendment note: 1985 Session Laws, Ch. 498, §2, amended §22 of Ch. 1184\n   Session Laws 1949 by adding subparagraph (82). 1987 Session Laws, Ch. 514,\n   §4, amended subparagraph (a)(2) by rewriting the first sentence; and §5\n   rewrote the first sentence of subparagraph (c)(4). \n   \n\n   (83. \t[Passage of necessary legislation.] \n   The City is authorized to enact ordinances, resolutions, rules and regulations\n   that are reasonable, necessary or expedient to carry subdivisions (80), (81)\n   and (82) into execution and effect. \n   Amendment note: 1985 Session Laws, Ch. 498, §2, amended §22 of Ch. 1184\n   Session Laws 1949 by adding subparagraph (83). \n   \n\n   (84. \t[Supplementary nature of (80)(82).] \n   The powers conferred in subdivisions (80), (81) and (82) shall be\n   supplementary in addition to all other powers and procedures authorized by any\n   other general or local law. Assessments, charges, fees, or rates authorized by\n   any other general or local law shall not be affected by the provisions of this\n   section. Nothing contained in subdivisions (80), (81) and (82) shall be\n   construed to prevent the use of facility fee proceeds to retire debt which was\n   used to fund facility fee eligible project. \n   Amendment note: 1985 Session Laws, Ch. 498, §2, amended §22 of Ch. 1184\n   Session Laws 1949 by adding subparagraph (84). 1987 Session Laws, Ch. 514,\n   §1, amended subparagraph (84) by adding the third sentence. \n   \n\n   (85. \tCooperation with Federal agencies. \n   The City may enter into contracts or agreements with any agency or department\n   of the United States Government in order to execute any undertaking. Such\n   contracts or agreements may involve activities carried out to benefit a\n   foreign government but the contract or agreement shall be with an agency or\n   department of the United States Government and shall substantially comply with\n   the requirements for interlocal agreements set out in G.S. 160A-464. \n   Amendment note: 1991 Session Laws, Ch. 843, §1, amended §22 of Ch. 1184\n   Session Laws 1949 by adding subparagraph (85). §2 of the act declared the\n   provisions applicable only to contracts or agreements entered into prior to\n   Dec. 1, 1993. \n   \n\n   (86. \t[Development funds.] \n   The City Council may, as part of its land development ordinances, provide that\n   in lieu of required street right-of-way improvements, a developer may be\n   required to provide funds that the City may use for the construction of\n   right-of-way improvements to serve the occupants, residents, or invitees of\n   the subdivision or development and these funds may be used for improvements\n   which serve more than one subdivision or development within the area. All\n   funds received by the City pursuant to this paragraph shall be used only for\n   development of right-of-way improvements, including design, land acquisition,\n   and construction. However, the City may undertake these activities in\n   conjunction with the Department of Transportation under an agreement between\n   the City and the North Carolina Department of Transportation. The ordinance\n   may require a combination of partial payment of funds and partial dedication\n   of constructed improvements when the governing body of the City determines\n   that a combination is in the best interest of the citizens of the area to be\n   served. \n   (S.L. 1949, Ch. 1184, §22; S.L. 1959, Ch. 813, §1; S.L. 1961, Ch. 220, §1;\n   S.L. 1963, Ch. 87, §1; S.L. 1963, Ch. 714, §1; S.L. 1967, Ch. 71, §§1, 2;\n   S.L. 1969, Ch. 383, §2; S.L. 1971, Ch. 1209, §1(a), (b); S.L. 1973, Ch. 319,\n   §§1(g), (h)(1), (2); S.L. 1973, Ch. 850, §1; S.L. 1975, Ch. 537, §1; S.L.\n   1975, Ch. 561, §§38; S.L. 1979, Ch. 277, §1; S.L. 1981, Ch. 992, §1; S.L.\n   1981, Ch. 1166, §1; S.L. 1983, Ch. 159, §1; S.L. 1983, Ch. 272, §1; S.L.\n   1985, Ch. 35, §1; S.L. 1985, Ch. 498, §§1, 2; S.L. 1987, Ch. 365, §1; S.L.\n   1987, Ch. 514, §§16; S.L. 1989, Ch. 816, §1; S.L. 1991, Ch. 312, §§1, 2;\n   S.L. 1991, Ch. 843, §§1, 2) \n   Amendment note: 1987 Session Laws, Ch. 514, §6, amended §22 of Ch. 1184\n   Session Laws 1949 by adding subparagraph (86). \n   \n\n(d) The City Council of the City of Raleigh in proposing to undertake any loan\nguaranty or similar program for rehabilitation of private buildings is\nauthorized to submit to its voters the question whether such program shall be\nundertaken, such referendum to be conducted pursuant to the general and local\nlaws applicable to special elections in the City of Raleigh.\n\n(e) \n\n   (78. \t[Reservation of sites.] \n   To adopt ordinances providing for the reservation of sites for public\n   buildings or rights-of-way for public facilities and utilities including but\n   not limited to fire stations, police stations, streets, water systems and\n   sanitary sewer systems. The City Council after recommendation by the Planning\n   Commission shall determine the location and size of any such reservations and\n   shall cause those locations to appear on the City&#8217;s Comprehensive Land\n   Use Plan. If the City enacts ordinances pursuant to this authority those\n   ordinances shall provide, in part, that any subdivision submitted for approval\n   which includes any such reservation or any request for a building permit not\n   involving subdivision approval which includes such a reservation, the\n   administrative official charged with receiving such request shall give notice\n   of the request to the City Council at its next regularly scheduled meeting.\n   The Council shall decide at that meeting whether it still wishes to require\n   the reservation. If the Council does wish the reservation, it shall have a\n   period of seven (7) months in which to acquire the reserved area by purchase\n   or by eminent domain. If the Council has not purchased the reservation\n   interest or begun condemnation proceedings within the seven-month period, the\n   subdivider or building permit applicant may treat the land as freed of the\n   reservation. \n   Amendment note: 1983 Session Laws, Ch. 272, §1, amended §22 of Ch. 1184\n   Session Laws 1949 by adding subparagraph (78). \n   \n\n   (79. \t[Street construction.] \n   To construct streets outside the corporate limits but within its\n   extraterritorial jurisdiction. Such a street may be built only after a finding\n   by the City Council that the street is essential to the operation of an\n   orderly transportation system for the City and the surrounding urbanized area.\n   Upon annexation of any area in which such streets are located, the City is\n   authorized to make special assessments against the property benefited by the\n   improvements which were installed prior to the annexation. The City is also\n   authorized to reimburse for overwidth streets those who build streets outside\n   the City limits but within the extraterritorial jurisdiction for the City\n   through the subdivision process or any other development process. In order to\n   effect this reimbursement the City is authorized to establish reimbursement\n   zones and to determine reimbursement rates for each zone. \n   Amendment note: 1983 Session Laws, Ch. 272, §1, amended §22 of Ch. 1184\n   Session Laws 1949 by adding subparagraph (79). \n   (80)\tSite plans. \n   The City Council may as part of its zoning regulations require that a site\n   plan be prepared, submitted, and approved prior to the issuance of a building\n   permit for new construction, excluding renovation and repair of existing\n   structures, and excluding accessory uses and their structures, unless such\n   renovations and repairs and accessory uses shall cause an increase in the\n   off-street parking requirement or a change in occupancy as occupancy is\n   defined by the North Carolina State Building Code. Such local law shall\n   specify the elements to be included in site plans submitted for approval in\n   accordance with standards of the zoning code; such elements may include, where\n   appropriate, those relating to off-street parking, driveway access, internal\n   circulation, screening, signs, landscaping, architectural features, locations\n   and dimensions of buildings, topography and grading, utilities, drainage\n   structures, street and sidewalk improvements, loading and service areas, fire\n   hydrants, and such other elements as may reasonably be related to the health,\n   safety and general welfare of the community. Where appropriate, approval of\n   site plans may be conditioned to include requirements that street and utility\n   and drainage rights-of-way, open space and recreation areas be dedicated or\n   reserved for the public, or street, drainage, recreation, and utility\n   improvements be made to the same extent as required by the local subdivision\n   regulations. This provision shall not apply to additions of less than five (5)\n   per cent of gross floor area on an annual basis unless such addition causes an\n   increase in the off-street parking requirement or a change in occupancy as\n   occupancy is defined by the North Carolina State Building Code. The City\n   Council shall prescribe procedures for review and approval of such site plans\n   to insure that development of property shall conform to applicable zoning or\n   other relevant laws or regulations, with approvals by designated City staff,\n   or the City Council. Appeals shall lie from the staff to the City Council. The\n   City Council may require that site plans be in conformity with previously\n   approved subdivision plans for the same property; further, in the event of\n   conflict between a requirement for site plan approval and requirements for\n   previously approved subdivision plans, the latter shall control. \n   Amendment note: 1985 Session Laws, Ch. 498, §1, amended §22 of Ch. 1184\n   Session Laws 1949 by adding subparagraph (80). 1987 Session Laws, Ch. 514,\n   §2, amended subparagraph (80) by adding reference to drainage and open space\n   and recreation areas in the third sentence. \n   \n\n   (81. \tRoad or drainage projects fee.\n"}