{"law_id":"16","section_number":"I-II-2.16","catch_line":"INITIATIVE AND REFERENDUM.","history":"","order_by":"2.16","metadata":false,"url":"\/I-II-2.16\/","token":"I-II-2.16","structure":{"1":{"id":"3","name":"ARTICLE II. - LEGISLATION, GOVERNING BODY, GENERAL POWERS","identifier":"II","label":"article","url":"\/I\/II\/"},"2":{"id":"1","name":"Division I - Charter","identifier":"I","label":"division","url":"\/I\/"}},"referred_to_by":false,"edition_id":"1","section_id":"16","structure_id":"3","full_text":"(a) Power of Initiative. \nThe electors shall have power to propose any ordinance, except an ordinance appropriating moneys or authorizing the levy of taxes, and to adopt or reject the same at the polls, such power being known as the initiative. Any initiated ordinance may be submitted to the Council by a petition signed by qualified electors of the City equal in number to at least ten per centum of the registered voters at the last regular municipal election.\r\r(b) Power of Referendum. \nThe electors shall have power to approve or reject at the polls any ordinance passed by the Council, or submitted by the Council to a vote of the electors, except an ordinance appropriating money or authorizing the levy of taxes, such power being known as the referendum. Ordinances submitted to the Council by initiative petition and passed by the Council without change shall be subject to the referendum in the same manner as other ordinances. Within twenty days after the enactment and publication by the Council of any ordinance which is subject to a referendum, a petition signed by qualified electors of the City equal in number to at least ten per centum of the registered voters at the last preceding regular municipal election may be filed with the City Clerk requesting that any such ordinance be either repealed or submitted to a vote of the electors.\r\r(c) Form of Petitions; Committee of Petitioners. \nAll petition papers circulated for the purpose of an initiative or referendum shall be substantially uniform in size and style. Initiative petition papers shall contain the full text of the proposed ordinance. The signatures to initiative or referendum petitions need not all be appended to one paper, but to each separate petition there shall be attached a statement of the circulator thereof as provided by this section. Each signer of any such petition paper shall sign his name in ink or indelible pencil and shall indicate after his name his place of residence by street and number, or other description sufficient to identify the place. There shall appear on each petition the names and addresses of the same five electors, who, as a committee of the petitioners, shall be regarded as responsible for the circulation and filing of the petition. Attached to each separate petition paper there shall be an affidavit of the circulator thereof that he, and he only, personally circulated the foregoing paper, that it bears a stated number of signatures, that all signatures appended thereto were made in his presence, and that he believes them to be genuine signatures of the persons whose names they purport to be.\r\r(d) Filing, Examination, Amendment and Certification of Petitions. \nAll petition papers shall be assembled and filed with the City Clerk as one instrument. Within five (5) business days after a petition is filed, the City Clerk shall examine the petition papers to determine whether each paper conforms to the requirements set forth in paragraph (c) herein and whether the number of signatures on valid petition papers is prima facie equal at least to the minimum number required. In making his examination, the City Clerk shall declare any petition paper entirely invalid which lacks any one of the following items; viz: The text of the proposed ordinance or the identification of the ordinance upon which a referendum is asked, the names of the committee members responsible for the petition, or the affidavit of the circulator. If a petition paper is found to be signed by more persons than the number of signatures certified by the circulator, the last signatures in excess of the number certified shall be disregarded and the City Clerk shall clearly indicate the cutoff point. If a petition paper is found to be signed by fewer persons than the number certified, the Clerk shall indicate the actual number of signatures. If the number of signatures on the valid petition papers shall be less than the number necessary, the City Clerk shall issue a certificate addressed to the committee of the petitioners setting forth the particulars in which the petition is defective. The committee shall be allowed ten business days to amend their petition by filing additional petition papers, but in no case shall any invalid petition paper be returned to the committee for perfection. In the event an amendment is filed, the City Clerk shall determine within five business days whether the petition as amended is now sufficient. If he find it still to be insufficient, he shall file his certificate to that effect in his office and notify the committee of the petitioners of his findings and no further action shall be had on such insufficient petition. Provided, however, that the finding of the insufficiency of an initiative petition shall not prejudice the filing of a new petition for the same purpose. If the City Clerk find the petition to be prima facie sufficient, he shall deliver the same to the Wake County Board of Elections for a checking of the names of the signers against the registration books. The board of elections shall complete its check within fifteen business days; provided, however, that the said board shall not be obligated to conduct a check in any thirty-day period immediately preceding, or in any ten-day period immediately following, a County-wide or City-wide election. In making its check of names, the said board shall be bound by the finding of the City Clerk as to validity of any particular petition paper and shall follow the rules set out above concerning petitions found to have different numbers of signers than those stated in the affidavits. Upon the completion of its check, the board of elections, through its Chairman or other duly authorized official, shall certify the outcome to the City Clerk. This certificate shall state (1) the total number of registered voters at the time of the most recent regular election of the members of the City Council, [(2)] the number of voters registered in the City of Raleigh whose names appear on the petition papers that the board found it necessary to examine, and [(3)] whether or not this number is sufficient for the submission of the proposed issue or issues to popular vote. If it was found unnecessary to check all names on the petition papers, this fact shall be indicated in the certificate. The petition papers shall be returned to the City Clerk by the County Board of Elections together with its certificate.\r\r(e) Certification of Sufficient Petition; Effect on a Referendum Petition of Certification. \nUpon receiving the certificate of the Wake County Board of Elections, the City Clerk shall prepare a final certificate indicating the result of the board&#8217;s examination and shall submit this certificate to the next regular meeting of the City Council. Whenever a referendum petition, or amended petition, has been certified as sufficient by the City Clerk, the ordinance specified in the petition shall not go into effect until and unless approved by the electors, as hereinafter provided.\r\r(f) Consideration by the City Council. \nWhenever the City Council shall receive an initiative or referendum petition certified to be sufficient by the City Clerk as provided in paragraph (e) hereof, it shall proceed at once to consider such petition. A proposed initiative ordinance shall be read and provision shall be made for a public hearing upon the proposed ordinance. The Council shall take final action on the ordinance not later than sixty days after the date on which such ordinance was submitted to the Council by the City Clerk. A referred ordinance shall be reconsidered by the Council and its final vote upon such reconsideration shall be taken not later than the second regular meeting of the Council following the certification and shall be upon the question, &#8220;Shall the ordinance specified in the referendum petition be repealed?&#8221;.\r\r(g) Submission of Ordinance to Electors. \nIf the Council shall fail to pass an ordinance proposed by initiative petition, or shall pass it in a form different from that set forth in the petition therefor, or if the Council fail to repeal a referred ordinance, the proposed or referred ordinance shall be submitted to the electors not less than thirty days nor more than one year from the date the Council takes its final vote thereon. The Council may, in its discretion, and if no regular election is to be held within such period shall, provide for a special election. Provided that, in case the Council shall pass an ordinance proposed by initiative petition in a form different from that set forth in the petition, the initiative form of the ordinance shall be submitted to the electors of the City only if, within twenty business days after the passage and publication of the ordinance in different form by the City Council, an additional petition signed by qualified electors of the City equal in number to at least five per centum of the registered voters at the time of the last regular municipal election is submitted to the City Council. The same rules that governed the filing, examination, amendment and certification of the original petition shall apply to the additional petition.\r\r(h) Form of Ballot for Initiated and Referred Ordinances. \nOrdinances submitted to vote of the electors in accordance with the initiative and referendum provisions of this charter shall be submitted by ballot title, which shall be prepared in all cases by the principal legal adviser of the City. The ballot title may be different from the legal title of any such initiated or referred ordinance and shall be a clear, concise statement, without argument or prejudice, descriptive of the substance of such ordinance. The ballot used in voting upon any ordinance, if a paper ballot, shall have below the ballot title the following propositions, one above the other, in the order indicated: &#8220;FOR THE ORDINANCE&#8221; and &#8220;AGAINST THE ORDINANCE.&#8221; Immediately at the left of each proposition there shall be a square in which by making a cross (X) the elector may vote for or against the ordinance. Any number of ordinances may be voted on at the same election and may be submitted on the same ballot, but any paper ballot used for voting thereon shall be for that purpose only. If voting machines are used, the ballot title of any ordinance shall be presented in such manner as to permit the elector to vote for or against the ordinance.\r\r(i) Result of Election. \nIf a majority of the electors voting on a proposed initiative ordinance shall vote in favor thereof, it shall thereupon be an ordinance of the City. A referred ordinance which is not approved by a majority of the electors voting thereon shall thereupon be deemed repealed. If conflicting ordinances are approved by the electors at the same election, the one receiving the greatest number of affirmative votes shall prevail to the extent of such conflict.\r\r(j) Publication, Amendment, and Repeal of Initiative or Referendum Ordinances. \nInitiative and referendum ordinances adopted or approved by the electors shall be published and shall take effect as do other ordinances. Such initiative or referendum ordinances may be repealed only by vote of the electors of the City. The City Council may request the Wake County Board of Elections to submit a proposition for the repeal of any such ordinances, or for amendments thereto, to be voted upon at any succeeding general City election; and should any such proposition so submitted receive a majority of the votes cast thereon at such election, such ordinance shall thereby be repealed or amended accordingly.\r\r(k) Restrictions on Use of Initiative Process. \nThe initiative process shall not be used to reverse the result of a referendum until one (1) year shall have passed since the referendum vote or the effective date of the referred ordinance, whichever shall be the more recent. Nor shall the same question be submitted to the voters twice in the same twelve-month period.\r\r(l) Use of Initiative Process To Repeal an Existing Ordinance. \nIn the event the initiative process is used for the purpose of the repeal of an existing ordinance, the petition shall set out the ordinance the repeal of which is sought, and a vote shall be had only on the question of the repeal of such ordinance. If such process is used for the purpose of the repeal of a part of an existing ordinance, the vote shall be had only on the question of the repeal of that part of the ordinance set out in the petition. \n(S.L. 1957, Ch. 970, §1)\r\r","text":{"0":{"id":"45","text":"Power of Initiative. \nThe electors shall have power to propose any ordinance, except an ordinance appropriating moneys or authorizing the levy of taxes, and to adopt or reject the same at the polls, such power being known as the initiative. Any initiated ordinance may be submitted to the Council by a petition signed by qualified electors of the City equal in number to at least ten per centum of the registered voters at the last regular municipal election.","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"46","text":"Power of Referendum. \nThe electors shall have power to approve or reject at the polls any ordinance passed by the Council, or submitted by the Council to a vote of the electors, except an ordinance appropriating money or authorizing the levy of taxes, such power being known as the referendum. Ordinances submitted to the Council by initiative petition and passed by the Council without change shall be subject to the referendum in the same manner as other ordinances. Within twenty days after the enactment and publication by the Council of any ordinance which is subject to a referendum, a petition signed by qualified electors of the City equal in number to at least ten per centum of the registered voters at the last preceding regular municipal election may be filed with the City Clerk requesting that any such ordinance be either repealed or submitted to a vote of the electors.","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"2":{"id":"47","text":"Form of Petitions; Committee of Petitioners. \nAll petition papers circulated for the purpose of an initiative or referendum shall be substantially uniform in size and style. Initiative petition papers shall contain the full text of the proposed ordinance. The signatures to initiative or referendum petitions need not all be appended to one paper, but to each separate petition there shall be attached a statement of the circulator thereof as provided by this section. Each signer of any such petition paper shall sign his name in ink or indelible pencil and shall indicate after his name his place of residence by street and number, or other description sufficient to identify the place. There shall appear on each petition the names and addresses of the same five electors, who, as a committee of the petitioners, shall be regarded as responsible for the circulation and filing of the petition. Attached to each separate petition paper there shall be an affidavit of the circulator thereof that he, and he only, personally circulated the foregoing paper, that it bears a stated number of signatures, that all signatures appended thereto were made in his presence, and that he believes them to be genuine signatures of the persons whose names they purport to be.","type":"section","prefixes":["(c)"],"prefix":"(c)","entire_prefix":"(c)","prefix_anchor":"(c)","level":1},"3":{"id":"48","text":"Filing, Examination, Amendment and Certification of Petitions. \nAll petition papers shall be assembled and filed with the City Clerk as one instrument. Within five (5) business days after a petition is filed, the City Clerk shall examine the petition papers to determine whether each paper conforms to the requirements set forth in paragraph (c) herein and whether the number of signatures on valid petition papers is prima facie equal at least to the minimum number required. In making his examination, the City Clerk shall declare any petition paper entirely invalid which lacks any one of the following items; viz: The text of the proposed ordinance or the identification of the ordinance upon which a referendum is asked, the names of the committee members responsible for the petition, or the affidavit of the circulator. If a petition paper is found to be signed by more persons than the number of signatures certified by the circulator, the last signatures in excess of the number certified shall be disregarded and the City Clerk shall clearly indicate the cutoff point. If a petition paper is found to be signed by fewer persons than the number certified, the Clerk shall indicate the actual number of signatures. If the number of signatures on the valid petition papers shall be less than the number necessary, the City Clerk shall issue a certificate addressed to the committee of the petitioners setting forth the particulars in which the petition is defective. The committee shall be allowed ten business days to amend their petition by filing additional petition papers, but in no case shall any invalid petition paper be returned to the committee for perfection. In the event an amendment is filed, the City Clerk shall determine within five business days whether the petition as amended is now sufficient. If he find it still to be insufficient, he shall file his certificate to that effect in his office and notify the committee of the petitioners of his findings and no further action shall be had on such insufficient petition. Provided, however, that the finding of the insufficiency of an initiative petition shall not prejudice the filing of a new petition for the same purpose. If the City Clerk find the petition to be prima facie sufficient, he shall deliver the same to the Wake County Board of Elections for a checking of the names of the signers against the registration books. The board of elections shall complete its check within fifteen business days; provided, however, that the said board shall not be obligated to conduct a check in any thirty-day period immediately preceding, or in any ten-day period immediately following, a County-wide or City-wide election. In making its check of names, the said board shall be bound by the finding of the City Clerk as to validity of any particular petition paper and shall follow the rules set out above concerning petitions found to have different numbers of signers than those stated in the affidavits. Upon the completion of its check, the board of elections, through its Chairman or other duly authorized official, shall certify the outcome to the City Clerk. This certificate shall state (1) the total number of registered voters at the time of the most recent regular election of the members of the City Council, [(2)] the number of voters registered in the City of Raleigh whose names appear on the petition papers that the board found it necessary to examine, and [(3)] whether or not this number is sufficient for the submission of the proposed issue or issues to popular vote. If it was found unnecessary to check all names on the petition papers, this fact shall be indicated in the certificate. The petition papers shall be returned to the City Clerk by the County Board of Elections together with its certificate.","type":"section","prefixes":["(d)"],"prefix":"(d)","entire_prefix":"(d)","prefix_anchor":"(d)","level":1},"4":{"id":"49","text":"Certification of Sufficient Petition; Effect on a Referendum Petition of Certification. \nUpon receiving the certificate of the Wake County Board of Elections, the City Clerk shall prepare a final certificate indicating the result of the board&#8217;s examination and shall submit this certificate to the next regular meeting of the City Council. Whenever a referendum petition, or amended petition, has been certified as sufficient by the City Clerk, the ordinance specified in the petition shall not go into effect until and unless approved by the electors, as hereinafter provided.","type":"section","prefixes":["(e)"],"prefix":"(e)","entire_prefix":"(e)","prefix_anchor":"(e)","level":1},"5":{"id":"50","text":"Consideration by the City Council. \nWhenever the City Council shall receive an initiative or referendum petition certified to be sufficient by the City Clerk as provided in paragraph (e) hereof, it shall proceed at once to consider such petition. A proposed initiative ordinance shall be read and provision shall be made for a public hearing upon the proposed ordinance. The Council shall take final action on the ordinance not later than sixty days after the date on which such ordinance was submitted to the Council by the City Clerk. A referred ordinance shall be reconsidered by the Council and its final vote upon such reconsideration shall be taken not later than the second regular meeting of the Council following the certification and shall be upon the question, &#8220;Shall the ordinance specified in the referendum petition be repealed?&#8221;.","type":"section","prefixes":["(f)"],"prefix":"(f)","entire_prefix":"(f)","prefix_anchor":"(f)","level":1},"6":{"id":"51","text":"Submission of Ordinance to Electors. \nIf the Council shall fail to pass an ordinance proposed by initiative petition, or shall pass it in a form different from that set forth in the petition therefor, or if the Council fail to repeal a referred ordinance, the proposed or referred ordinance shall be submitted to the electors not less than thirty days nor more than one year from the date the Council takes its final vote thereon. The Council may, in its discretion, and if no regular election is to be held within such period shall, provide for a special election. Provided that, in case the Council shall pass an ordinance proposed by initiative petition in a form different from that set forth in the petition, the initiative form of the ordinance shall be submitted to the electors of the City only if, within twenty business days after the passage and publication of the ordinance in different form by the City Council, an additional petition signed by qualified electors of the City equal in number to at least five per centum of the registered voters at the time of the last regular municipal election is submitted to the City Council. The same rules that governed the filing, examination, amendment and certification of the original petition shall apply to the additional petition.","type":"section","prefixes":["(g)"],"prefix":"(g)","entire_prefix":"(g)","prefix_anchor":"(g)","level":1},"7":{"id":"52","text":"Form of Ballot for Initiated and Referred Ordinances. \nOrdinances submitted to vote of the electors in accordance with the initiative and referendum provisions of this charter shall be submitted by ballot title, which shall be prepared in all cases by the principal legal adviser of the City. The ballot title may be different from the legal title of any such initiated or referred ordinance and shall be a clear, concise statement, without argument or prejudice, descriptive of the substance of such ordinance. The ballot used in voting upon any ordinance, if a paper ballot, shall have below the ballot title the following propositions, one above the other, in the order indicated: &#8220;FOR THE ORDINANCE&#8221; and &#8220;AGAINST THE ORDINANCE.&#8221; Immediately at the left of each proposition there shall be a square in which by making a cross (X) the elector may vote for or against the ordinance. Any number of ordinances may be voted on at the same election and may be submitted on the same ballot, but any paper ballot used for voting thereon shall be for that purpose only. If voting machines are used, the ballot title of any ordinance shall be presented in such manner as to permit the elector to vote for or against the ordinance.","type":"section","prefixes":["(h)"],"prefix":"(h)","entire_prefix":"(h)","prefix_anchor":"(h)","level":1},"8":{"id":"53","text":"Result of Election. \nIf a majority of the electors voting on a proposed initiative ordinance shall vote in favor thereof, it shall thereupon be an ordinance of the City. A referred ordinance which is not approved by a majority of the electors voting thereon shall thereupon be deemed repealed. If conflicting ordinances are approved by the electors at the same election, the one receiving the greatest number of affirmative votes shall prevail to the extent of such conflict.","type":"section","prefixes":["(i)"],"prefix":"(i)","entire_prefix":"(i)","prefix_anchor":"(i)","level":1},"9":{"id":"54","text":"Publication, Amendment, and Repeal of Initiative or Referendum Ordinances. \nInitiative and referendum ordinances adopted or approved by the electors shall be published and shall take effect as do other ordinances. Such initiative or referendum ordinances may be repealed only by vote of the electors of the City. The City Council may request the Wake County Board of Elections to submit a proposition for the repeal of any such ordinances, or for amendments thereto, to be voted upon at any succeeding general City election; and should any such proposition so submitted receive a majority of the votes cast thereon at such election, such ordinance shall thereby be repealed or amended accordingly.","type":"section","prefixes":["(j)"],"prefix":"(j)","entire_prefix":"(j)","prefix_anchor":"(j)","level":1},"10":{"id":"55","text":"Restrictions on Use of Initiative Process. \nThe initiative process shall not be used to reverse the result of a referendum until one (1) year shall have passed since the referendum vote or the effective date of the referred ordinance, whichever shall be the more recent. Nor shall the same question be submitted to the voters twice in the same twelve-month period.","type":"section","prefixes":["(k)"],"prefix":"(k)","entire_prefix":"(k)","prefix_anchor":"(k)","level":1},"11":{"id":"56","text":"Use of Initiative Process To Repeal an Existing Ordinance. \nIn the event the initiative process is used for the purpose of the repeal of an existing ordinance, the petition shall set out the ordinance the repeal of which is sought, and a vote shall be had only on the question of the repeal of such ordinance. If such process is used for the purpose of the repeal of a part of an existing ordinance, the vote shall be had only on the question of the repeal of that part of the ordinance set out in the petition. \n(S.L. 1957, Ch. 970, §1)","type":"section","prefixes":["(l)"],"prefix":"(l)","entire_prefix":"(l)","prefix_anchor":"(l)","level":1}},"ancestry":{"1":{"id":"3","name":"ARTICLE II. - LEGISLATION, GOVERNING BODY, GENERAL POWERS","identifier":"II","label":"article","url":"\/I\/II\/"},"2":{"id":"1","name":"Division I - Charter","identifier":"I","label":"division","url":"\/I\/"}},"structure_contents":{"0":{"id":"1044","structure_id":"3","section_number":"I-II-2.1","catch_line":"CITY COUNCIL CONSTITUTES GOVERNING BODY.","url":"\/I-II-2.1\/","token":"I-II-2.1"},"1":{"id":"9","structure_id":"3","section_number":"I-II-2.10","catch_line":"RULE AS TO FINAL EFFECTIVE DATE.","url":"\/I-II-2.10\/","token":"I-II-2.10"},"2":{"id":"10","structure_id":"3","section_number":"I-II-2.11","catch_line":"GRANTING OF FRANCHISES.","url":"\/I-II-2.11\/","token":"I-II-2.11"},"3":{"id":"11","structure_id":"3","section_number":"I-II-2.12","catch_line":"COMPENSATION AND ALLOWANCES PAID TO COUNCIL AND MAYOR.","url":"\/I-II-2.12\/","token":"I-II-2.12"},"4":{"id":"12","structure_id":"3","section_number":"I-II-2.13","catch_line":"GENERAL MUNICIPAL POWERS.","url":"\/I-II-2.13\/","token":"I-II-2.13"},"5":{"id":"14","structure_id":"3","section_number":"I-II-2.14","catch_line":"EXPRESS POWERS ENUMERATED.","url":"\/I-II-2.14\/","token":"I-II-2.14"},"6":{"id":"15","structure_id":"3","section_number":"I-II-2.15","catch_line":"EXTENSION OF APPLICATION OF HEALTH, SANITARY AND PROTECTIVE ORDINANCES.","url":"\/I-II-2.15\/","token":"I-II-2.15"},"7":{"id":"16","structure_id":"3","section_number":"I-II-2.16","catch_line":"INITIATIVE AND REFERENDUM.","url":"\/I-II-2.16\/","token":"I-II-2.16"},"8":{"id":"1055","structure_id":"3","section_number":"I-II-2.2","catch_line":"NUMBER AND ELECTION OF MEMBERS OF CITY COUNCIL.","url":"\/I-II-2.2\/","token":"I-II-2.2"},"9":{"id":"1066","structure_id":"3","section_number":"I-II-2.3","catch_line":"POWER AND ORGANIZATION OF CITY COUNCIL.","url":"\/I-II-2.3\/","token":"I-II-2.3"},"10":{"id":"3","structure_id":"3","section_number":"I-II-2.4","catch_line":"MEETINGS OF THE CITY COUNCIL.","url":"\/I-II-2.4\/","token":"I-II-2.4"},"11":{"id":"4","structure_id":"3","section_number":"I-II-2.5","catch_line":"QUORUM AND CONDUCT OF BUSINESS.","url":"\/I-II-2.5\/","token":"I-II-2.5"},"12":{"id":"5","structure_id":"3","section_number":"I-II-2.6","catch_line":"ADOPTION OF RULES OF PROCEDURE; MEETINGS OPEN TO PUBLIC.","url":"\/I-II-2.6\/","token":"I-II-2.6"},"13":{"id":"6","structure_id":"3","section_number":"I-II-2.7","catch_line":"ORDINANCES; VOTE FOR FINAL PASSAGE, AMENDMENT BY ORDINANCE.","url":"\/I-II-2.7\/","token":"I-II-2.7"},"14":{"id":"7","structure_id":"3","section_number":"I-II-2.8","catch_line":"EFFECTIVE DATE.","url":"\/I-II-2.8\/","token":"I-II-2.8"},"15":{"id":"8","structure_id":"3","section_number":"I-II-2.9","catch_line":"EXCEPTIONS AS TO NEWSPAPER PUBLICATION OF CODE OF ORDINANCES.","url":"\/I-II-2.9\/","token":"I-II-2.9"}},"previous_section":{"id":"15","structure_id":"3","section_number":"I-II-2.15","catch_line":"EXTENSION OF APPLICATION OF HEALTH, SANITARY AND PROTECTIVE ORDINANCES.","url":"\/I-II-2.15\/","token":"I-II-2.15"},"next_section":{"id":"1055","structure_id":"3","section_number":"I-II-2.2","catch_line":"NUMBER AND ELECTION OF MEMBERS OF CITY COUNCIL.","url":"\/I-II-2.2\/","token":"I-II-2.2"},"references":false,"formats":{"txt":"\/I-II-2.16.txt","json":"\/I-II-2.16.xml"},"dublin_core":{"Title":"INITIATIVE AND REFERENDUM.","Type":"Text","Format":"text\/html","Identifier":"§ I-II-2.16","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nINITIATIVE AND REFERENDUM. (§ I-II-2.16)\n\n(a) Power of Initiative. \nThe electors shall have power to propose any ordinance, except an ordinance\nappropriating moneys or authorizing the levy of taxes, and to adopt or reject\nthe same at the polls, such power being known as the initiative. Any initiated\nordinance may be submitted to the Council by a petition signed by qualified\nelectors of the City equal in number to at least ten per centum of the\nregistered voters at the last regular municipal election.\n\n(b) Power of Referendum. \nThe electors shall have power to approve or reject at the polls any ordinance\npassed by the Council, or submitted by the Council to a vote of the electors,\nexcept an ordinance appropriating money or authorizing the levy of taxes, such\npower being known as the referendum. Ordinances submitted to the Council by\ninitiative petition and passed by the Council without change shall be subject to\nthe referendum in the same manner as other ordinances. Within twenty days after\nthe enactment and publication by the Council of any ordinance which is subject\nto a referendum, a petition signed by qualified electors of the City equal in\nnumber to at least ten per centum of the registered voters at the last preceding\nregular municipal election may be filed with the City Clerk requesting that any\nsuch ordinance be either repealed or submitted to a vote of the electors.\n\n(c) Form of Petitions; Committee of Petitioners. \nAll petition papers circulated for the purpose of an initiative or referendum\nshall be substantially uniform in size and style. Initiative petition papers\nshall contain the full text of the proposed ordinance. The signatures to\ninitiative or referendum petitions need not all be appended to one paper, but to\neach separate petition there shall be attached a statement of the circulator\nthereof as provided by this section. Each signer of any such petition paper\nshall sign his name in ink or indelible pencil and shall indicate after his name\nhis place of residence by street and number, or other description sufficient to\nidentify the place. There shall appear on each petition the names and addresses\nof the same five electors, who, as a committee of the petitioners, shall be\nregarded as responsible for the circulation and filing of the petition. Attached\nto each separate petition paper there shall be an affidavit of the circulator\nthereof that he, and he only, personally circulated the foregoing paper, that it\nbears a stated number of signatures, that all signatures appended thereto were\nmade in his presence, and that he believes them to be genuine signatures of the\npersons whose names they purport to be.\n\n(d) Filing, Examination, Amendment and Certification of Petitions. \nAll petition papers shall be assembled and filed with the City Clerk as one\ninstrument. Within five (5) business days after a petition is filed, the City\nClerk shall examine the petition papers to determine whether each paper conforms\nto the requirements set forth in paragraph (c) herein and whether the number of\nsignatures on valid petition papers is prima facie equal at least to the minimum\nnumber required. In making his examination, the City Clerk shall declare any\npetition paper entirely invalid which lacks any one of the following items; viz:\nThe text of the proposed ordinance or the identification of the ordinance upon\nwhich a referendum is asked, the names of the committee members responsible for\nthe petition, or the affidavit of the circulator. If a petition paper is found\nto be signed by more persons than the number of signatures certified by the\ncirculator, the last signatures in excess of the number certified shall be\ndisregarded and the City Clerk shall clearly indicate the cutoff point. If a\npetition paper is found to be signed by fewer persons than the number certified,\nthe Clerk shall indicate the actual number of signatures. If the number of\nsignatures on the valid petition papers shall be less than the number necessary,\nthe City Clerk shall issue a certificate addressed to the committee of the\npetitioners setting forth the particulars in which the petition is defective.\nThe committee shall be allowed ten business days to amend their petition by\nfiling additional petition papers, but in no case shall any invalid petition\npaper be returned to the committee for perfection. In the event an amendment is\nfiled, the City Clerk shall determine within five business days whether the\npetition as amended is now sufficient. If he find it still to be insufficient,\nhe shall file his certificate to that effect in his office and notify the\ncommittee of the petitioners of his findings and no further action shall be had\non such insufficient petition. Provided, however, that the finding of the\ninsufficiency of an initiative petition shall not prejudice the filing of a new\npetition for the same purpose. If the City Clerk find the petition to be prima\nfacie sufficient, he shall deliver the same to the Wake County Board of\nElections for a checking of the names of the signers against the registration\nbooks. The board of elections shall complete its check within fifteen business\ndays; provided, however, that the said board shall not be obligated to conduct a\ncheck in any thirty-day period immediately preceding, or in any ten-day period\nimmediately following, a County-wide or City-wide election. In making its check\nof names, the said board shall be bound by the finding of the City Clerk as to\nvalidity of any particular petition paper and shall follow the rules set out\nabove concerning petitions found to have different numbers of signers than those\nstated in the affidavits. Upon the completion of its check, the board of\nelections, through its Chairman or other duly authorized official, shall certify\nthe outcome to the City Clerk. This certificate shall state (1) the total number\nof registered voters at the time of the most recent regular election of the\nmembers of the City Council, [(2)] the number of voters registered in the City\nof Raleigh whose names appear on the petition papers that the board found it\nnecessary to examine, and [(3)] whether or not this number is sufficient for the\nsubmission of the proposed issue or issues to popular vote. If it was found\nunnecessary to check all names on the petition papers, this fact shall be\nindicated in the certificate. The petition papers shall be returned to the City\nClerk by the County Board of Elections together with its certificate.\n\n(e) Certification of Sufficient Petition; Effect on a Referendum Petition of\nCertification. \nUpon receiving the certificate of the Wake County Board of Elections, the City\nClerk shall prepare a final certificate indicating the result of the\nboard&#8217;s examination and shall submit this certificate to the next regular\nmeeting of the City Council. Whenever a referendum petition, or amended\npetition, has been certified as sufficient by the City Clerk, the ordinance\nspecified in the petition shall not go into effect until and unless approved by\nthe electors, as hereinafter provided.\n\n(f) Consideration by the City Council. \nWhenever the City Council shall receive an initiative or referendum petition\ncertified to be sufficient by the City Clerk as provided in paragraph (e)\nhereof, it shall proceed at once to consider such petition. A proposed\ninitiative ordinance shall be read and provision shall be made for a public\nhearing upon the proposed ordinance. The Council shall take final action on the\nordinance not later than sixty days after the date on which such ordinance was\nsubmitted to the Council by the City Clerk. A referred ordinance shall be\nreconsidered by the Council and its final vote upon such reconsideration shall\nbe taken not later than the second regular meeting of the Council following the\ncertification and shall be upon the question, &#8220;Shall the ordinance\nspecified in the referendum petition be repealed?&#8221;.\n\n(g) Submission of Ordinance to Electors. \nIf the Council shall fail to pass an ordinance proposed by initiative petition,\nor shall pass it in a form different from that set forth in the petition\ntherefor, or if the Council fail to repeal a referred ordinance, the proposed or\nreferred ordinance shall be submitted to the electors not less than thirty days\nnor more than one year from the date the Council takes its final vote thereon.\nThe Council may, in its discretion, and if no regular election is to be held\nwithin such period shall, provide for a special election. Provided that, in case\nthe Council shall pass an ordinance proposed by initiative petition in a form\ndifferent from that set forth in the petition, the initiative form of the\nordinance shall be submitted to the electors of the City only if, within twenty\nbusiness days after the passage and publication of the ordinance in different\nform by the City Council, an additional petition signed by qualified electors of\nthe City equal in number to at least five per centum of the registered voters at\nthe time of the last regular municipal election is submitted to the City\nCouncil. The same rules that governed the filing, examination, amendment and\ncertification of the original petition shall apply to the additional petition.\n\n(h) Form of Ballot for Initiated and Referred Ordinances. \nOrdinances submitted to vote of the electors in accordance with the initiative\nand referendum provisions of this charter shall be submitted by ballot title,\nwhich shall be prepared in all cases by the principal legal adviser of the City.\nThe ballot title may be different from the legal title of any such initiated or\nreferred ordinance and shall be a clear, concise statement, without argument or\nprejudice, descriptive of the substance of such ordinance. The ballot used in\nvoting upon any ordinance, if a paper ballot, shall have below the ballot title\nthe following propositions, one above the other, in the order indicated:\n&#8220;FOR THE ORDINANCE&#8221; and &#8220;AGAINST THE ORDINANCE.&#8221;\nImmediately at the left of each proposition there shall be a square in which by\nmaking a cross (X) the elector may vote for or against the ordinance. Any number\nof ordinances may be voted on at the same election and may be submitted on the\nsame ballot, but any paper ballot used for voting thereon shall be for that\npurpose only. If voting machines are used, the ballot title of any ordinance\nshall be presented in such manner as to permit the elector to vote for or\nagainst the ordinance.\n\n(i) Result of Election. \nIf a majority of the electors voting on a proposed initiative ordinance shall\nvote in favor thereof, it shall thereupon be an ordinance of the City. A\nreferred ordinance which is not approved by a majority of the electors voting\nthereon shall thereupon be deemed repealed. If conflicting ordinances are\napproved by the electors at the same election, the one receiving the greatest\nnumber of affirmative votes shall prevail to the extent of such conflict.\n\n(j) Publication, Amendment, and Repeal of Initiative or Referendum Ordinances. \nInitiative and referendum ordinances adopted or approved by the electors shall\nbe published and shall take effect as do other ordinances. Such initiative or\nreferendum ordinances may be repealed only by vote of the electors of the City.\nThe City Council may request the Wake County Board of Elections to submit a\nproposition for the repeal of any such ordinances, or for amendments thereto, to\nbe voted upon at any succeeding general City election; and should any such\nproposition so submitted receive a majority of the votes cast thereon at such\nelection, such ordinance shall thereby be repealed or amended accordingly.\n\n(k) Restrictions on Use of Initiative Process. \nThe initiative process shall not be used to reverse the result of a referendum\nuntil one (1) year shall have passed since the referendum vote or the effective\ndate of the referred ordinance, whichever shall be the more recent. Nor shall\nthe same question be submitted to the voters twice in the same twelve-month\nperiod.\n\n(l) Use of Initiative Process To Repeal an Existing Ordinance. \nIn the event the initiative process is used for the purpose of the repeal of an\nexisting ordinance, the petition shall set out the ordinance the repeal of which\nis sought, and a vote shall be had only on the question of the repeal of such\nordinance. If such process is used for the purpose of the repeal of a part of an\nexisting ordinance, the vote shall be had only on the question of the repeal of\nthat part of the ordinance set out in the petition. \n(S.L. 1957, Ch. 970, §1)\n"}