{"law_id":"1001","section_number":"I-III-3.8","catch_line":"BONDS REQUIRED OF OFFICIALS AND EMPLOYEES OF THE CITY.","history":"","order_by":"3.8","metadata":false,"url":"\/I-III-3.8\/","token":"I-III-3.8","structure":{"1":{"id":"4","name":"ARTICLE III. - APPOINTMENT AND REMOVAL OF OFFICERS AND EMPLOYEES; INTEREST OF OFFICIALS IN CONTRACTS","identifier":"III","label":"article","url":"\/I\/III\/"},"2":{"id":"1","name":"Division I - Charter","identifier":"I","label":"division","url":"\/I\/"}},"referred_to_by":false,"edition_id":"1","section_id":"1001","structure_id":"4","full_text":"(a) Every official, employee or agent of the City who handles or has custody of more than one hundred dollars ($100) of the funds of the City at any time shall, before assuming his duties as such, and thereafter annually on or before the first day of the fiscal year of the City, be required to furnish the City a good and sufficient bond in an amount determined by the City Council to be sufficient to protect the City, payable to the City of Raleigh and conditioned upon the faithful performance of his duties and a true accounting for all funds of the City which may come into his hands, custody or control during the particular fiscal year, which bond shall be approved by the City Council and deposited with the City Clerk; provided, however, that such bond of any employee or employees may, in the discretion of the City Council and authorized by resolution, be conditioned only upon a true accounting for funds of the City. The City shall pay the premiums for such bonds. The bond required by this section may be a bond executed by the particular official, employee, or agent, as principal, and by the surety or sureties required and approved by the City Council, or the bond may be a schedule bond executed by a surety company, insurance company or other company authorized to execute such bonds and authorized to do a surety business in the State of North Carolina, without the necessity of the signature of the particular officials, employees or agents constituting the principals of such bond, which bonds shall list the names of the officials, employees and agents covered as principals by the bond and their respective positions with the City of Raleigh, or the said bond may be a schedule position bond or blanket position bond which lists the particular positions of employment and offices whose incumbents are covered by said bond; and when any authorized company shall execute, as surety, any such schedule bond, listing, by name or position, the officials, employees and agents of the City covered by the bond, it shall be conclusively presumed that the bond was executed and furnished by the particular officials, employees and agents of the City, respectively specified therein, by name or position, and each such official, employee and agent required to furnish bond and each surety executing any such bond is hereby charged with notice of this section of this act, which shall be a part of the obligation of every such bond.\r\r(b) The City Council shall not accept any continuing bond or renewal bond but shall require a new bond for the period of each fiscal year of the City, and such bond shall be and shall be known as &#8220;Official Bond of Public Officials,&#8221; and the six-year statute of limitations shall apply as to actions for recovery under any such bond.\r\r","text":{"0":{"id":"4831","text":"Every official, employee or agent of the City who handles or has custody of more than one hundred dollars ($100) of the funds of the City at any time shall, before assuming his duties as such, and thereafter annually on or before the first day of the fiscal year of the City, be required to furnish the City a good and sufficient bond in an amount determined by the City Council to be sufficient to protect the City, payable to the City of Raleigh and conditioned upon the faithful performance of his duties and a true accounting for all funds of the City which may come into his hands, custody or control during the particular fiscal year, which bond shall be approved by the City Council and deposited with the City Clerk; provided, however, that such bond of any employee or employees may, in the discretion of the City Council and authorized by resolution, be conditioned only upon a true accounting for funds of the City. The City shall pay the premiums for such bonds. The bond required by this section may be a bond executed by the particular official, employee, or agent, as principal, and by the surety or sureties required and approved by the City Council, or the bond may be a schedule bond executed by a surety company, insurance company or other company authorized to execute such bonds and authorized to do a surety business in the State of North Carolina, without the necessity of the signature of the particular officials, employees or agents constituting the principals of such bond, which bonds shall list the names of the officials, employees and agents covered as principals by the bond and their respective positions with the City of Raleigh, or the said bond may be a schedule position bond or blanket position bond which lists the particular positions of employment and offices whose incumbents are covered by said bond; and when any authorized company shall execute, as surety, any such schedule bond, listing, by name or position, the officials, employees and agents of the City covered by the bond, it shall be conclusively presumed that the bond was executed and furnished by the particular officials, employees and agents of the City, respectively specified therein, by name or position, and each such official, employee and agent required to furnish bond and each surety executing any such bond is hereby charged with notice of this section of this act, which shall be a part of the obligation of every such bond.","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"4832","text":"The City Council shall not accept any continuing bond or renewal bond but shall require a new bond for the period of each fiscal year of the City, and such bond shall be and shall be known as &#8220;Official Bond of Public Officials,&#8221; and the six-year statute of limitations shall apply as to actions for recovery under any such bond.","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1}},"ancestry":{"1":{"id":"4","name":"ARTICLE III. - APPOINTMENT AND REMOVAL OF OFFICERS AND EMPLOYEES; INTEREST OF OFFICIALS IN CONTRACTS","identifier":"III","label":"article","url":"\/I\/III\/"},"2":{"id":"1","name":"Division I - Charter","identifier":"I","label":"division","url":"\/I\/"}},"structure_contents":{"0":{"id":"17","structure_id":"4","section_number":"I-III-3.1","catch_line":"CITY MANAGER; APPOINTMENT.","url":"\/I-III-3.1\/","token":"I-III-3.1"},"1":{"id":"18","structure_id":"4","section_number":"I-III-3.2","catch_line":"POWERS AND DUTIES.","url":"\/I-III-3.2\/","token":"I-III-3.2"},"2":{"id":"19","structure_id":"4","section_number":"I-III-3.3","catch_line":"APPOINTMENT AND REMOVAL OF OFFICERS.","url":"\/I-III-3.3\/","token":"I-III-3.3"},"3":{"id":"20","structure_id":"4","section_number":"I-III-3.4","catch_line":"CONTROL OF OFFICERS AND EMPLOYEES.","url":"\/I-III-3.4\/","token":"I-III-3.4"},"4":{"id":"21","structure_id":"4","section_number":"I-III-3.5","catch_line":"CITY COUNCIL APPOINTMENTS.","url":"\/I-III-3.5\/","token":"I-III-3.5"},"5":{"id":"22","structure_id":"4","section_number":"I-III-3.6","catch_line":"COUNCIL NOT TO INTERFERE IN APPOINTMENTS OR REMOVALS BY CITY MANAGER.","url":"\/I-III-3.6\/","token":"I-III-3.6"},"6":{"id":"23","structure_id":"4","section_number":"I-III-3.7","catch_line":"SALARIES.","url":"\/I-III-3.7\/","token":"I-III-3.7"},"7":{"id":"1001","structure_id":"4","section_number":"I-III-3.8","catch_line":"BONDS REQUIRED OF OFFICIALS AND EMPLOYEES OF THE CITY.","url":"\/I-III-3.8\/","token":"I-III-3.8"},"8":{"id":"1002","structure_id":"4","section_number":"I-III-3.9","catch_line":"REGULATION OF PRIVATE TRANSACTIONS BETWEEN CITY AND ITS OFFICIALS AND EMPLOYEES.","url":"\/I-III-3.9\/","token":"I-III-3.9"}},"previous_section":{"id":"23","structure_id":"4","section_number":"I-III-3.7","catch_line":"SALARIES.","url":"\/I-III-3.7\/","token":"I-III-3.7"},"next_section":{"id":"1002","structure_id":"4","section_number":"I-III-3.9","catch_line":"REGULATION OF PRIVATE TRANSACTIONS BETWEEN CITY AND ITS OFFICIALS AND EMPLOYEES.","url":"\/I-III-3.9\/","token":"I-III-3.9"},"references":false,"formats":{"txt":"\/I-III-3.8.txt","json":"\/I-III-3.8.xml"},"dublin_core":{"Title":"BONDS REQUIRED OF OFFICIALS AND EMPLOYEES OF THE CITY.","Type":"Text","Format":"text\/html","Identifier":"§ I-III-3.8","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nBONDS REQUIRED OF OFFICIALS AND EMPLOYEES OF THE CITY. (§ I-III-3.8)\n\n(a) Every official, employee or agent of the City who handles or has custody of\nmore than one hundred dollars ($100) of the funds of the City at any time shall,\nbefore assuming his duties as such, and thereafter annually on or before the\nfirst day of the fiscal year of the City, be required to furnish the City a good\nand sufficient bond in an amount determined by the City Council to be sufficient\nto protect the City, payable to the City of Raleigh and conditioned upon the\nfaithful performance of his duties and a true accounting for all funds of the\nCity which may come into his hands, custody or control during the particular\nfiscal year, which bond shall be approved by the City Council and deposited with\nthe City Clerk; provided, however, that such bond of any employee or employees\nmay, in the discretion of the City Council and authorized by resolution, be\nconditioned only upon a true accounting for funds of the City. The City shall\npay the premiums for such bonds. The bond required by this section may be a bond\nexecuted by the particular official, employee, or agent, as principal, and by\nthe surety or sureties required and approved by the City Council, or the bond\nmay be a schedule bond executed by a surety company, insurance company or other\ncompany authorized to execute such bonds and authorized to do a surety business\nin the State of North Carolina, without the necessity of the signature of the\nparticular officials, employees or agents constituting the principals of such\nbond, which bonds shall list the names of the officials, employees and agents\ncovered as principals by the bond and their respective positions with the City\nof Raleigh, or the said bond may be a schedule position bond or blanket position\nbond which lists the particular positions of employment and offices whose\nincumbents are covered by said bond; and when any authorized company shall\nexecute, as surety, any such schedule bond, listing, by name or position, the\nofficials, employees and agents of the City covered by the bond, it shall be\nconclusively presumed that the bond was executed and furnished by the particular\nofficials, employees and agents of the City, respectively specified therein, by\nname or position, and each such official, employee and agent required to furnish\nbond and each surety executing any such bond is hereby charged with notice of\nthis section of this act, which shall be a part of the obligation of every such\nbond.\n\n(b) The City Council shall not accept any continuing bond or renewal bond but\nshall require a new bond for the period of each fiscal year of the City, and\nsuch bond shall be and shall be known as &#8220;Official Bond of Public\nOfficials,&#8221; and the six-year statute of limitations shall apply as to\nactions for recovery under any such bond.\n"}