{"law_id":"99","edition_id":"1","section_id":"99","structure_id":"47","section_number":"II-5-3003","catch_line":"ANNUAL APPROPRIATION.","history":"","full_text":"(a) Compliance; Responsibility for Enforcement. \nCompliance with the provisions of this article, including all requirements of the Fire Prevention Code adopted hereunder, shall be enforced by the inspectors of the Fire Prevention Bureau of the Fire Department. In exercising its enforcement responsibilities, the goal of the Fire Prevention Bureau shall be to employ the enforcement alternatives calculated most effectively to secure compliance with the Fire Prevention Code and other fire prevention standards and requirements of the City.\r\r(b) Violations. \nAny person, who shall violate or fail to comply with any of the provisions of this article, including the Fire Prevention Code adopted hereunder, or who shall violate or fail to comply with any corrective order of the Fire Prevention Bureau issued hereunder, or who shall build in violation of any specifications or plans submitted and approved hereunder shall be deemed to have committed a violation of this article and shall be held responsible and subject to the penalties and remedies herein provided. In addition, any such person owning, leasing, using, managing, or occupying any building, structure, or land wherein or whereon there exists anything in violation of this article, including the Fire Prevention Code, or any lawful order issued or plan approved hereunder; or any architect, builder, contractor, engineer, agent, or other person who acts in concert, participates, directs, or assists in the creation or maintenance of a violation of this article or any order issued or plan approved hereunder; or any person who shall erect or use any land, building or structure or any part thereof contrary to this article, the Fire Prevention Code, any order issued or plan approved hereunder; or any person who shall omit, neglect, or refuse to do any act provided for in this article, including the Fire Prevention Code, or any order issued or plan approved hereunder shall be held responsible for a violation of this article and be subject to the penalties and remedies herein provided.\r\r(i) Payment;\n(ii)\tArrangement for payment to be made; or\n(iii)\tA prima facie showing to the Fire Marshal that the notice and citation were issued as a result of mistake, inadvertence, or inexcusable neglect. \ne.\tProvide and state that, unless the violation is corrected and the Civil Penalty paid or otherwise cleared within the specified time period or periods, respectively, the violator may be charged additional civil penalties for each day&#8217;s continuing violation, as provided herein below: \nSettlement of civil claim: \nThe Fire Marshal is authorized to accept payment in full and final settlement of the claim or claims, right or rights of action which the City may have to enforce such penalty by civil action in the nature of debt. Acceptance of a penalty shall be deemed a full and final release of any and all claims or right of action arising out of contended violations, only if the activities or non-activities which gave rise to the violations are abated or otherwise made lawful. \nf.\tA penalty of fifty dollars ($50.00) in addition to the civil penalty shall apply in those cases in which penalties prescribed in subsection (c)(3) have not been paid within the prescribed period and a civil action has been instituted.\r\r(d) Failure to Correct Violations; Continuing Violations. \nIf a violation of this article is not corrected within the time specified in the notice and citation or other lawful order issued hereunder, the violator shall be guilty of a new and separate offense, and each day&#8217;s further continuing violation shall be a separate and distinct offense, enforceable by all the remedies herein set forth, including additional civil penalties. \n(Ord. No. 2011-873-TC-344, §1, TC-6-11, 5-3-11) \n\n________________________________________\nFOOTNOTE(S):\n________________________________________\n&#8212; (1) &#8212; \nEditor&#8217;s note: Ord. No. 2011-873-TC-344, §1, TC-6-11, adopted May 3, 2011, effective June 4, 2011, amended Pt. 5, Ch. 2, Art. B in its entirety to read as herein set out. Former Art. B, §§ 5-2031—5-2045, pertained to similar subject matter, and derived from Ord. No. 1991-841-TC-372, §1, adopted Sept. 3, 1991, as amended. See the Code Comparative Table for complete derivation. (Back)\r\r","order_by":"5-3003","text":{"0":{"id":"219","text":"Compliance; Responsibility for Enforcement. \nCompliance with the provisions of this article, including all requirements of the Fire Prevention Code adopted hereunder, shall be enforced by the inspectors of the Fire Prevention Bureau of the Fire Department. In exercising its enforcement responsibilities, the goal of the Fire Prevention Bureau shall be to employ the enforcement alternatives calculated most effectively to secure compliance with the Fire Prevention Code and other fire prevention standards and requirements of the City.","type":"section","prefixes":["(a)"],"prefix":"(a)","entire_prefix":"(a)","prefix_anchor":"(a)","level":1},"1":{"id":"220","text":"Violations. \nAny person, who shall violate or fail to comply with any of the provisions of this article, including the Fire Prevention Code adopted hereunder, or who shall violate or fail to comply with any corrective order of the Fire Prevention Bureau issued hereunder, or who shall build in violation of any specifications or plans submitted and approved hereunder shall be deemed to have committed a violation of this article and shall be held responsible and subject to the penalties and remedies herein provided. In addition, any such person owning, leasing, using, managing, or occupying any building, structure, or land wherein or whereon there exists anything in violation of this article, including the Fire Prevention Code, or any lawful order issued or plan approved hereunder; or any architect, builder, contractor, engineer, agent, or other person who acts in concert, participates, directs, or assists in the creation or maintenance of a violation of this article or any order issued or plan approved hereunder; or any person who shall erect or use any land, building or structure or any part thereof contrary to this article, the Fire Prevention Code, any order issued or plan approved hereunder; or any person who shall omit, neglect, or refuse to do any act provided for in this article, including the Fire Prevention Code, or any order issued or plan approved hereunder shall be held responsible for a violation of this article and be subject to the penalties and remedies herein provided.","type":"section","prefixes":["(b)"],"prefix":"(b)","entire_prefix":"(b)","prefix_anchor":"(b)","level":1},"2":{"id":"221","text":"","type":"section","prefixes":["(c)"],"prefix":"(c)","entire_prefix":"(c)","prefix_anchor":"(c)","level":1},"3":{"id":"222","text":"\tEquitable remedies, including injunctions and orders of abatement. \nAs authorized by the City Council, the City may apply for any appropriate equitable remedy to enforce the provisions of this article, including mandatory or prohibitory injunctions commanding the defendant, or in the case of counterclaims the plaintiff, to correct the unlawful condition or cease the unlawful use of property; or apply for orders of abatement directing that buildings or other structures on the property be closed, demolished, or removed; that fixtures, furniture, or other movable property be moved; that improvements or repairs be made; or that other action be taken as necessary to secure compliance with the provisions of this article. \n","type":"section","prefixes":["(c)","(1)"],"prefix":"(1)","entire_prefix":"(c)(1)","prefix_anchor":"(c)(1)","level":2},"4":{"id":"223","text":"\tCriminal offense. \nA violation of this article shall constitute a misdemeanor offense as provided by G.S. 14-4; and the maximum fine or term of imprisonment, or both, as authorized by law is hereby imposed. \n","type":"section","prefixes":["(c)","(2)"],"prefix":"(2)","entire_prefix":"(c)(2)","prefix_anchor":"(c)(2)","level":2},"5":{"id":"224","text":"\tCivil penalty. \nAny act constituting a violation shall subject the offender to a civil penalty in the following amounts: \nLife Safety violation—First offense: \nFor violations of Pamphlet 101, &#8220;Life Safety,&#8221; of the Fire Prevention Code &#8230;..$100.00 \nLife Safety violation—Repeat offenses: \nFor each successive violation of Pamphlet 101, &#8220;Life Safety,&#8221; of the Fire Prevention Code, the penalty shall increase from the previous penalty assessed by &#8230;..$100.00 \nFor violations of other provisions of this article, including the Fire Prevention Code &#8230;..$50.00 \nAny inspector of the Fire Prevention Bureau who determines that a violation of this article has occurred shall either personally serve upon the violator or mail to the violator by certified mail, return receipt requested, a notice of violation and civil penalty citation. Such notice and citation shall: \na.\tState the nature of the violation and the penalty to be imposed.\nb.\tDirect the violator to pay the civil penalty by mailing the citation and penalty to the City Revenue Collector, P.O. Box 590, Raleigh, N.C. 27602, or by personally paying the amount at the cashier&#8217;s window, Raleigh Finance Department, room 118 of the Municipal Building, 222 West Hargett Street. \nc.\tNotify the offender that a failure to pay the penalty within the prescribed time shall subject the offender to a civil action in the nature of debt for the stated penalty plus any additional penalties, together with the cost of the action to be taxed by the court. \nd.\tProvide and state that the penalty must either be paid as set forth above or the failure to pay must be approved by the Fire Marshal within thirty (30) days from the issuance of the notice and citation. The notice and citation shall further state that if the citation is not cleared within the specified period, the filing of a civil complaint for collection of the penalty may be initiated, together with other legal proceedings, including the filing of criminal charges. As used herein, the term &#8220;cleared&#8221; shall mean either: \n","type":"section","prefixes":["(c)","(3)"],"prefix":"(3)","entire_prefix":"(c)(3)","prefix_anchor":"(c)(3)","level":2},"6":{"id":"225","text":"Payment;\n(ii)\tArrangement for payment to be made; or\n(iii)\tA prima facie showing to the Fire Marshal that the notice and citation were issued as a result of mistake, inadvertence, or inexcusable neglect. \ne.\tProvide and state that, unless the violation is corrected and the Civil Penalty paid or otherwise cleared within the specified time period or periods, respectively, the violator may be charged additional civil penalties for each day&#8217;s continuing violation, as provided herein below: \nSettlement of civil claim: \nThe Fire Marshal is authorized to accept payment in full and final settlement of the claim or claims, right or rights of action which the City may have to enforce such penalty by civil action in the nature of debt. Acceptance of a penalty shall be deemed a full and final release of any and all claims or right of action arising out of contended violations, only if the activities or non-activities which gave rise to the violations are abated or otherwise made lawful. \nf.\tA penalty of fifty dollars ($50.00) in addition to the civil penalty shall apply in those cases in which penalties prescribed in subsection (c)(3) have not been paid within the prescribed period and a civil action has been instituted.","type":"section","prefixes":["(i)"],"prefix":"(i)","entire_prefix":"(i)","prefix_anchor":"(i)","level":1},"7":{"id":"226","text":"Failure to Correct Violations; Continuing Violations. \nIf a violation of this article is not corrected within the time specified in the notice and citation or other lawful order issued hereunder, the violator shall be guilty of a new and separate offense, and each day&#8217;s further continuing violation shall be a separate and distinct offense, enforceable by all the remedies herein set forth, including additional civil penalties. \n(Ord. No. 2011-873-TC-344, §1, TC-6-11, 5-3-11) \n\n________________________________________\nFOOTNOTE(S):\n________________________________________\n&#8212; (1) &#8212; \nEditor&#8217;s note: Ord. No. 2011-873-TC-344, §1, TC-6-11, adopted May 3, 2011, effective June 4, 2011, amended Pt. 5, Ch. 2, Art. B in its entirety to read as herein set out. Former Art. B, §§ 5-2031—5-2045, pertained to similar subject matter, and derived from Ord. No. 1991-841-TC-372, §1, adopted Sept. 3, 1991, as amended. See the Code Comparative Table for complete derivation. (Back)","type":"section","prefixes":["(d)"],"prefix":"(d)","entire_prefix":"(d)","prefix_anchor":"(d)","level":1}},"ancestry":{"1":{"id":"47","name":"Sec. 5-3003. - ANNUAL APPROPRIATION.","identifier":"5-3003","label":"section","url":"\/II\/5\/3\/5-3003\/"},"2":{"id":"44","name":"CHAPTER 3. - POLICEMEN AND FIREMEN SPECIAL RELIEF FUND","identifier":"3","label":"chapter","url":"\/II\/5\/3\/"},"3":{"id":"34","name":"PART 5 - PUBLIC SAFETY","identifier":"5","label":"part","url":"\/II\/5\/"},"4":{"id":"5","name":"Division II - Planning and Development","identifier":"II","label":"division","url":"\/II\/"}},"structure_contents":{"0":{"id":"99","structure_id":"47","section_number":"II-5-3003","catch_line":"ANNUAL APPROPRIATION.","url":"\/II-5-3003\/","token":"II-5-3003"}},"metadata":false,"references":false,"url":"\/II-5-3003\/","token":"II-5-3003","formats":{"txt":"\/II-5-3003.txt","json":"\/II-5-3003.xml"},"dublin_core":{"Title":"ANNUAL APPROPRIATION.","Type":"Text","Format":"text\/html","Identifier":"§ II-5-3003","Relation":"Code of State"},"plain_text":"                                  CODE OF STATE\n\nANNUAL APPROPRIATION. (§ II-5-3003)\n\n(a) Compliance; Responsibility for Enforcement. \nCompliance with the provisions of this article, including all requirements of\nthe Fire Prevention Code adopted hereunder, shall be enforced by the inspectors\nof the Fire Prevention Bureau of the Fire Department. In exercising its\nenforcement responsibilities, the goal of the Fire Prevention Bureau shall be to\nemploy the enforcement alternatives calculated most effectively to secure\ncompliance with the Fire Prevention Code and other fire prevention standards and\nrequirements of the City.\n\n(b) Violations. \nAny person, who shall violate or fail to comply with any of the provisions of\nthis article, including the Fire Prevention Code adopted hereunder, or who shall\nviolate or fail to comply with any corrective order of the Fire Prevention\nBureau issued hereunder, or who shall build in violation of any specifications\nor plans submitted and approved hereunder shall be deemed to have committed a\nviolation of this article and shall be held responsible and subject to the\npenalties and remedies herein provided. In addition, any such person owning,\nleasing, using, managing, or occupying any building, structure, or land wherein\nor whereon there exists anything in violation of this article, including the\nFire Prevention Code, or any lawful order issued or plan approved hereunder; or\nany architect, builder, contractor, engineer, agent, or other person who acts in\nconcert, participates, directs, or assists in the creation or maintenance of a\nviolation of this article or any order issued or plan approved hereunder; or any\nperson who shall erect or use any land, building or structure or any part\nthereof contrary to this article, the Fire Prevention Code, any order issued or\nplan approved hereunder; or any person who shall omit, neglect, or refuse to do\nany act provided for in this article, including the Fire Prevention Code, or any\norder issued or plan approved hereunder shall be held responsible for a\nviolation of this article and be subject to the penalties and remedies herein\nprovided.\n\n(c) \n\n   (1) \tEquitable remedies, including injunctions and orders of abatement. \n   As authorized by the City Council, the City may apply for any appropriate\n   equitable remedy to enforce the provisions of this article, including\n   mandatory or prohibitory injunctions commanding the defendant, or in the case\n   of counterclaims the plaintiff, to correct the unlawful condition or cease the\n   unlawful use of property; or apply for orders of abatement directing that\n   buildings or other structures on the property be closed, demolished, or\n   removed; that fixtures, furniture, or other movable property be moved; that\n   improvements or repairs be made; or that other action be taken as necessary to\n   secure compliance with the provisions of this article. \n   \n\n   (2) \tCriminal offense. \n   A violation of this article shall constitute a misdemeanor offense as provided\n   by G.S. 14-4; and the maximum fine or term of imprisonment, or both, as\n   authorized by law is hereby imposed. \n   \n\n   (3) \tCivil penalty. \n   Any act constituting a violation shall subject the offender to a civil penalty\n   in the following amounts: \n   Life Safety violation—First offense: \n   For violations of Pamphlet 101, &#8220;Life Safety,&#8221; of the Fire\n   Prevention Code &#8230;..$100.00 \n   Life Safety violation—Repeat offenses: \n   For each successive violation of Pamphlet 101, &#8220;Life Safety,&#8221; of\n   the Fire Prevention Code, the penalty shall increase from the previous penalty\n   assessed by &#8230;..$100.00 \n   For violations of other provisions of this article, including the Fire\n   Prevention Code &#8230;..$50.00 \n   Any inspector of the Fire Prevention Bureau who determines that a violation of\n   this article has occurred shall either personally serve upon the violator or\n   mail to the violator by certified mail, return receipt requested, a notice of\n   violation and civil penalty citation. Such notice and citation shall: \n   a.\tState the nature of the violation and the penalty to be imposed.\n   b.\tDirect the violator to pay the civil penalty by mailing the citation and\n   penalty to the City Revenue Collector, P.O. Box 590, Raleigh, N.C. 27602, or\n   by personally paying the amount at the cashier&#8217;s window, Raleigh Finance\n   Department, room 118 of the Municipal Building, 222 West Hargett Street. \n   c.\tNotify the offender that a failure to pay the penalty within the prescribed\n   time shall subject the offender to a civil action in the nature of debt for\n   the stated penalty plus any additional penalties, together with the cost of\n   the action to be taxed by the court. \n   d.\tProvide and state that the penalty must either be paid as set forth above\n   or the failure to pay must be approved by the Fire Marshal within thirty (30)\n   days from the issuance of the notice and citation. The notice and citation\n   shall further state that if the citation is not cleared within the specified\n   period, the filing of a civil complaint for collection of the penalty may be\n   initiated, together with other legal proceedings, including the filing of\n   criminal charges. As used herein, the term &#8220;cleared&#8221; shall mean\n   either: \n   \n\n(i) Payment;\n(ii)\tArrangement for payment to be made; or\n(iii)\tA prima facie showing to the Fire Marshal that the notice and citation\nwere issued as a result of mistake, inadvertence, or inexcusable neglect. \ne.\tProvide and state that, unless the violation is corrected and the Civil\nPenalty paid or otherwise cleared within the specified time period or periods,\nrespectively, the violator may be charged additional civil penalties for each\nday&#8217;s continuing violation, as provided herein below: \nSettlement of civil claim: \nThe Fire Marshal is authorized to accept payment in full and final settlement of\nthe claim or claims, right or rights of action which the City may have to\nenforce such penalty by civil action in the nature of debt. Acceptance of a\npenalty shall be deemed a full and final release of any and all claims or right\nof action arising out of contended violations, only if the activities or\nnon-activities which gave rise to the violations are abated or otherwise made\nlawful. \nf.\tA penalty of fifty dollars ($50.00) in addition to the civil penalty shall\napply in those cases in which penalties prescribed in subsection (c)(3) have not\nbeen paid within the prescribed period and a civil action has been instituted.\n\n(d) Failure to Correct Violations; Continuing Violations. \nIf a violation of this article is not corrected within the time specified in the\nnotice and citation or other lawful order issued hereunder, the violator shall\nbe guilty of a new and separate offense, and each day&#8217;s further continuing\nviolation shall be a separate and distinct offense, enforceable by all the\nremedies herein set forth, including additional civil penalties. \n(Ord. No. 2011-873-TC-344, §1, TC-6-11, 5-3-11) \n\n________________________________________\nFOOTNOTE(S):\n________________________________________\n&#8212; (1) &#8212; \nEditor&#8217;s note: Ord. No. 2011-873-TC-344, §1, TC-6-11, adopted May 3,\n2011, effective June 4, 2011, amended Pt. 5, Ch. 2, Art. B in its entirety to\nread as herein set out. Former Art. B, §§ 5-2031—5-2045, pertained to\nsimilar subject matter, and derived from Ord. No. 1991-841-TC-372, §1, adopted\nSept. 3, 1991, as amended. See the Code Comparative Table for complete\nderivation. (Back)\n"}